window.areaData = [{
      "code": "110000",
      "name": "北京市",
      "type": 1,
      "path": "110000",
      "parentCode": null
},
{
      "code": "110100",
      "name": "北京市",
      "type": 2,
      "path": "110000,110100",
      "parentCode": "110000"
},
{
      "code": "110101",
      "name": "东城区",
      "type": 3,
      "path": "110000,110100,110101",
      "parentCode": "110100"
},
{
      "code": "110102",
      "name": "西城区",
      "type": 3,
      "path": "110000,110100,110102",
      "parentCode": "110100"
},
{
      "code": "110105",
      "name": "朝阳区",
      "type": 3,
      "path": "110000,110100,110105",
      "parentCode": "110100"
},
{
      "code": "110106",
      "name": "丰台区",
      "type": 3,
      "path": "110000,110100,110106",
      "parentCode": "110100"
},
{
      "code": "110107",
      "name": "石景山区",
      "type": 3,
      "path": "110000,110100,110107",
      "parentCode": "110100"
},
{
      "code": "110108",
      "name": "海淀区",
      "type": 3,
      "path": "110000,110100,110108",
      "parentCode": "110100"
},
{
      "code": "110109",
      "name": "门头沟区",
      "type": 3,
      "path": "110000,110100,110109",
      "parentCode": "110100"
},
{
      "code": "110111",
      "name": "房山区",
      "type": 3,
      "path": "110000,110100,110111",
      "parentCode": "110100"
},
{
      "code": "110112",
      "name": "通州区",
      "type": 3,
      "path": "110000,110100,110112",
      "parentCode": "110100"
},
{
      "code": "110113",
      "name": "顺义区",
      "type": 3,
      "path": "110000,110100,110113",
      "parentCode": "110100"
},
{
      "code": "110114",
      "name": "昌平区",
      "type": 3,
      "path": "110000,110100,110114",
      "parentCode": "110100"
},
{
      "code": "110115",
      "name": "大兴区",
      "type": 3,
      "path": "110000,110100,110115",
      "parentCode": "110100"
},
{
      "code": "110116",
      "name": "怀柔区",
      "type": 3,
      "path": "110000,110100,110116",
      "parentCode": "110100"
},
{
      "code": "110117",
      "name": "平谷区",
      "type": 3,
      "path": "110000,110100,110117",
      "parentCode": "110100"
},
{
      "code": "110200",
      "name": "北京市辖县",
      "type": 2,
      "path": "110000,110200",
      "parentCode": "110000"
},
{
      "code": "110228",
      "name": "密云县",
      "type": 3,
      "path": "110000,110200,110228",
      "parentCode": "110200"
},
{
      "code": "110229",
      "name": "延庆县",
      "type": 3,
      "path": "110000,110200,110229",
      "parentCode": "110200"
},
{
      "code": "120000",
      "name": "天津市",
      "type": 1,
      "path": "120000",
      "parentCode": null
},
{
      "code": "120100",
      "name": "天津市",
      "type": 2,
      "path": "120000,120100",
      "parentCode": "120000"
},
{
      "code": "120101",
      "name": "和平区",
      "type": 3,
      "path": "120000,120100,120101",
      "parentCode": "120100"
},
{
      "code": "120102",
      "name": "河东区",
      "type": 3,
      "path": "120000,120100,120102",
      "parentCode": "120100"
},
{
      "code": "120103",
      "name": "河西区",
      "type": 3,
      "path": "120000,120100,120103",
      "parentCode": "120100"
},
{
      "code": "120104",
      "name": "南开区",
      "type": 3,
      "path": "120000,120100,120104",
      "parentCode": "120100"
},
{
      "code": "120105",
      "name": "河北区",
      "type": 3,
      "path": "120000,120100,120105",
      "parentCode": "120100"
},
{
      "code": "120106",
      "name": "红桥区",
      "type": 3,
      "path": "120000,120100,120106",
      "parentCode": "120100"
},
{
      "code": "120110",
      "name": "东丽区",
      "type": 3,
      "path": "120000,120100,120110",
      "parentCode": "120100"
},
{
      "code": "120111",
      "name": "西青区",
      "type": 3,
      "path": "120000,120100,120111",
      "parentCode": "120100"
},
{
      "code": "120112",
      "name": "津南区",
      "type": 3,
      "path": "120000,120100,120112",
      "parentCode": "120100"
},
{
      "code": "120113",
      "name": "北辰区",
      "type": 3,
      "path": "120000,120100,120113",
      "parentCode": "120100"
},
{
      "code": "120114",
      "name": "武清区",
      "type": 3,
      "path": "120000,120100,120114",
      "parentCode": "120100"
},
{
      "code": "120115",
      "name": "宝坻区",
      "type": 3,
      "path": "120000,120100,120115",
      "parentCode": "120100"
},
{
      "code": "120116",
      "name": "滨海新区",
      "type": 3,
      "path": "120000,120100,120116",
      "parentCode": "120100"
},
{
      "code": "120200",
      "name": "天津市辖县",
      "type": 2,
      "path": "120000,120200",
      "parentCode": "120000"
},
{
      "code": "120221",
      "name": "宁河县",
      "type": 3,
      "path": "120000,120200,120221",
      "parentCode": "120200"
},
{
      "code": "120223",
      "name": "静海县",
      "type": 3,
      "path": "120000,120200,120223",
      "parentCode": "120200"
},
{
      "code": "120225",
      "name": "蓟县",
      "type": 3,
      "path": "120000,120200,120225",
      "parentCode": "120200"
},
{
      "code": "130000",
      "name": "河北省",
      "type": 1,
      "path": "130000",
      "parentCode": null
},
{
      "code": "130100",
      "name": "石家庄市",
      "type": 2,
      "path": "130000,130100",
      "parentCode": "130000"
},
{
      "code": "130102",
      "name": "长安区",
      "type": 3,
      "path": "130000,130100,130102",
      "parentCode": "130100"
},
{
      "code": "130104",
      "name": "桥西区",
      "type": 3,
      "path": "130000,130100,130104",
      "parentCode": "130100"
},
{
      "code": "130105",
      "name": "新华区",
      "type": 3,
      "path": "130000,130100,130105",
      "parentCode": "130100"
},
{
      "code": "130107",
      "name": "井陉矿区",
      "type": 3,
      "path": "130000,130100,130107",
      "parentCode": "130100"
},
{
      "code": "130108",
      "name": "裕华区",
      "type": 3,
      "path": "130000,130100,130108",
      "parentCode": "130100"
},
{
      "code": "130109",
      "name": "藁城区",
      "type": 3,
      "path": "130000,130100,130109",
      "parentCode": "130100"
},
{
      "code": "130110",
      "name": "鹿泉区",
      "type": 3,
      "path": "130000,130100,130110",
      "parentCode": "130100"
},
{
      "code": "130111",
      "name": "栾城区",
      "type": 3,
      "path": "130000,130100,130111",
      "parentCode": "130100"
},
{
      "code": "130121",
      "name": "井陉县",
      "type": 3,
      "path": "130000,130100,130121",
      "parentCode": "130100"
},
{
      "code": "130123",
      "name": "正定县",
      "type": 3,
      "path": "130000,130100,130123",
      "parentCode": "130100"
},
{
      "code": "130125",
      "name": "行唐县",
      "type": 3,
      "path": "130000,130100,130125",
      "parentCode": "130100"
},
{
      "code": "130126",
      "name": "灵寿县",
      "type": 3,
      "path": "130000,130100,130126",
      "parentCode": "130100"
},
{
      "code": "130127",
      "name": "高邑县",
      "type": 3,
      "path": "130000,130100,130127",
      "parentCode": "130100"
},
{
      "code": "130128",
      "name": "深泽县",
      "type": 3,
      "path": "130000,130100,130128",
      "parentCode": "130100"
},
{
      "code": "130129",
      "name": "赞皇县",
      "type": 3,
      "path": "130000,130100,130129",
      "parentCode": "130100"
},
{
      "code": "130130",
      "name": "无极县",
      "type": 3,
      "path": "130000,130100,130130",
      "parentCode": "130100"
},
{
      "code": "130131",
      "name": "平山县",
      "type": 3,
      "path": "130000,130100,130131",
      "parentCode": "130100"
},
{
      "code": "130132",
      "name": "元氏县",
      "type": 3,
      "path": "130000,130100,130132",
      "parentCode": "130100"
},
{
      "code": "130133",
      "name": "赵县",
      "type": 3,
      "path": "130000,130100,130133",
      "parentCode": "130100"
},
{
      "code": "130181",
      "name": "辛集市",
      "type": 3,
      "path": "130000,130100,130181",
      "parentCode": "130100"
},
{
      "code": "130183",
      "name": "晋州市",
      "type": 3,
      "path": "130000,130100,130183",
      "parentCode": "130100"
},
{
      "code": "130184",
      "name": "新乐市",
      "type": 3,
      "path": "130000,130100,130184",
      "parentCode": "130100"
},
{
      "code": "130200",
      "name": "唐山市",
      "type": 2,
      "path": "130000,130200",
      "parentCode": "130000"
},
{
      "code": "130202",
      "name": "路南区",
      "type": 3,
      "path": "130000,130200,130202",
      "parentCode": "130200"
},
{
      "code": "130203",
      "name": "路北区",
      "type": 3,
      "path": "130000,130200,130203",
      "parentCode": "130200"
},
{
      "code": "130204",
      "name": "古冶区",
      "type": 3,
      "path": "130000,130200,130204",
      "parentCode": "130200"
},
{
      "code": "130205",
      "name": "开平区",
      "type": 3,
      "path": "130000,130200,130205",
      "parentCode": "130200"
},
{
      "code": "130207",
      "name": "丰南区",
      "type": 3,
      "path": "130000,130200,130207",
      "parentCode": "130200"
},
{
      "code": "130208",
      "name": "丰润区",
      "type": 3,
      "path": "130000,130200,130208",
      "parentCode": "130200"
},
{
      "code": "130209",
      "name": "曹妃甸区",
      "type": 3,
      "path": "130000,130200,130209",
      "parentCode": "130200"
},
{
      "code": "130223",
      "name": "滦县",
      "type": 3,
      "path": "130000,130200,130223",
      "parentCode": "130200"
},
{
      "code": "130224",
      "name": "滦南县",
      "type": 3,
      "path": "130000,130200,130224",
      "parentCode": "130200"
},
{
      "code": "130225",
      "name": "乐亭县",
      "type": 3,
      "path": "130000,130200,130225",
      "parentCode": "130200"
},
{
      "code": "130227",
      "name": "迁西县",
      "type": 3,
      "path": "130000,130200,130227",
      "parentCode": "130200"
},
{
      "code": "130229",
      "name": "玉田县",
      "type": 3,
      "path": "130000,130200,130229",
      "parentCode": "130200"
},
{
      "code": "130281",
      "name": "遵化市",
      "type": 3,
      "path": "130000,130200,130281",
      "parentCode": "130200"
},
{
      "code": "130283",
      "name": "迁安市",
      "type": 3,
      "path": "130000,130200,130283",
      "parentCode": "130200"
},
{
      "code": "130300",
      "name": "秦皇岛市",
      "type": 2,
      "path": "130000,130300",
      "parentCode": "130000"
},
{
      "code": "130302",
      "name": "海港区",
      "type": 3,
      "path": "130000,130300,130302",
      "parentCode": "130300"
},
{
      "code": "130303",
      "name": "山海关区",
      "type": 3,
      "path": "130000,130300,130303",
      "parentCode": "130300"
},
{
      "code": "130304",
      "name": "北戴河区",
      "type": 3,
      "path": "130000,130300,130304",
      "parentCode": "130300"
},
{
      "code": "130321",
      "name": "青龙满族自治县",
      "type": 3,
      "path": "130000,130300,130321",
      "parentCode": "130300"
},
{
      "code": "130322",
      "name": "昌黎县",
      "type": 3,
      "path": "130000,130300,130322",
      "parentCode": "130300"
},
{
      "code": "130323",
      "name": "抚宁县",
      "type": 3,
      "path": "130000,130300,130323",
      "parentCode": "130300"
},
{
      "code": "130324",
      "name": "卢龙县",
      "type": 3,
      "path": "130000,130300,130324",
      "parentCode": "130300"
},
{
      "code": "130400",
      "name": "邯郸市",
      "type": 2,
      "path": "130000,130400",
      "parentCode": "130000"
},
{
      "code": "130402",
      "name": "邯山区",
      "type": 3,
      "path": "130000,130400,130402",
      "parentCode": "130400"
},
{
      "code": "130403",
      "name": "丛台区",
      "type": 3,
      "path": "130000,130400,130403",
      "parentCode": "130400"
},
{
      "code": "130404",
      "name": "复兴区",
      "type": 3,
      "path": "130000,130400,130404",
      "parentCode": "130400"
},
{
      "code": "130406",
      "name": "峰峰矿区",
      "type": 3,
      "path": "130000,130400,130406",
      "parentCode": "130400"
},
{
      "code": "130421",
      "name": "邯郸县",
      "type": 3,
      "path": "130000,130400,130421",
      "parentCode": "130400"
},
{
      "code": "130423",
      "name": "临漳县",
      "type": 3,
      "path": "130000,130400,130423",
      "parentCode": "130400"
},
{
      "code": "130424",
      "name": "成安县",
      "type": 3,
      "path": "130000,130400,130424",
      "parentCode": "130400"
},
{
      "code": "130425",
      "name": "大名县",
      "type": 3,
      "path": "130000,130400,130425",
      "parentCode": "130400"
},
{
      "code": "130426",
      "name": "涉县",
      "type": 3,
      "path": "130000,130400,130426",
      "parentCode": "130400"
},
{
      "code": "130427",
      "name": "磁县",
      "type": 3,
      "path": "130000,130400,130427",
      "parentCode": "130400"
},
{
      "code": "130428",
      "name": "肥乡县",
      "type": 3,
      "path": "130000,130400,130428",
      "parentCode": "130400"
},
{
      "code": "130429",
      "name": "永年县",
      "type": 3,
      "path": "130000,130400,130429",
      "parentCode": "130400"
},
{
      "code": "130430",
      "name": "邱县",
      "type": 3,
      "path": "130000,130400,130430",
      "parentCode": "130400"
},
{
      "code": "130431",
      "name": "鸡泽县",
      "type": 3,
      "path": "130000,130400,130431",
      "parentCode": "130400"
},
{
      "code": "130432",
      "name": "广平县",
      "type": 3,
      "path": "130000,130400,130432",
      "parentCode": "130400"
},
{
      "code": "130433",
      "name": "馆陶县",
      "type": 3,
      "path": "130000,130400,130433",
      "parentCode": "130400"
},
{
      "code": "130434",
      "name": "魏县",
      "type": 3,
      "path": "130000,130400,130434",
      "parentCode": "130400"
},
{
      "code": "130435",
      "name": "曲周县",
      "type": 3,
      "path": "130000,130400,130435",
      "parentCode": "130400"
},
{
      "code": "130481",
      "name": "武安市",
      "type": 3,
      "path": "130000,130400,130481",
      "parentCode": "130400"
},
{
      "code": "130500",
      "name": "邢台市",
      "type": 2,
      "path": "130000,130500",
      "parentCode": "130000"
},
{
      "code": "130502",
      "name": "桥东区",
      "type": 3,
      "path": "130000,130500,130502",
      "parentCode": "130500"
},
{
      "code": "130503",
      "name": "桥西区",
      "type": 3,
      "path": "130000,130500,130503",
      "parentCode": "130500"
},
{
      "code": "130521",
      "name": "邢台县",
      "type": 3,
      "path": "130000,130500,130521",
      "parentCode": "130500"
},
{
      "code": "130522",
      "name": "临城县",
      "type": 3,
      "path": "130000,130500,130522",
      "parentCode": "130500"
},
{
      "code": "130523",
      "name": "内丘县",
      "type": 3,
      "path": "130000,130500,130523",
      "parentCode": "130500"
},
{
      "code": "130524",
      "name": "柏乡县",
      "type": 3,
      "path": "130000,130500,130524",
      "parentCode": "130500"
},
{
      "code": "130525",
      "name": "隆尧县",
      "type": 3,
      "path": "130000,130500,130525",
      "parentCode": "130500"
},
{
      "code": "130526",
      "name": "任县",
      "type": 3,
      "path": "130000,130500,130526",
      "parentCode": "130500"
},
{
      "code": "130527",
      "name": "南和县",
      "type": 3,
      "path": "130000,130500,130527",
      "parentCode": "130500"
},
{
      "code": "130528",
      "name": "宁晋县",
      "type": 3,
      "path": "130000,130500,130528",
      "parentCode": "130500"
},
{
      "code": "130529",
      "name": "巨鹿县",
      "type": 3,
      "path": "130000,130500,130529",
      "parentCode": "130500"
},
{
      "code": "130530",
      "name": "新河县",
      "type": 3,
      "path": "130000,130500,130530",
      "parentCode": "130500"
},
{
      "code": "130531",
      "name": "广宗县",
      "type": 3,
      "path": "130000,130500,130531",
      "parentCode": "130500"
},
{
      "code": "130532",
      "name": "平乡县",
      "type": 3,
      "path": "130000,130500,130532",
      "parentCode": "130500"
},
{
      "code": "130533",
      "name": "威县",
      "type": 3,
      "path": "130000,130500,130533",
      "parentCode": "130500"
},
{
      "code": "130534",
      "name": "清河县",
      "type": 3,
      "path": "130000,130500,130534",
      "parentCode": "130500"
},
{
      "code": "130535",
      "name": "临西县",
      "type": 3,
      "path": "130000,130500,130535",
      "parentCode": "130500"
},
{
      "code": "130581",
      "name": "南宫市",
      "type": 3,
      "path": "130000,130500,130581",
      "parentCode": "130500"
},
{
      "code": "130582",
      "name": "沙河市",
      "type": 3,
      "path": "130000,130500,130582",
      "parentCode": "130500"
},
{
      "code": "130600",
      "name": "保定市",
      "type": 2,
      "path": "130000,130600",
      "parentCode": "130000"
},
{
      "code": "130602",
      "name": "新市区",
      "type": 3,
      "path": "130000,130600,130602",
      "parentCode": "130600"
},
{
      "code": "130603",
      "name": "北市区",
      "type": 3,
      "path": "130000,130600,130603",
      "parentCode": "130600"
},
{
      "code": "130604",
      "name": "南市区",
      "type": 3,
      "path": "130000,130600,130604",
      "parentCode": "130600"
},
{
      "code": "130621",
      "name": "满城县",
      "type": 3,
      "path": "130000,130600,130621",
      "parentCode": "130600"
},
{
      "code": "130622",
      "name": "清苑县",
      "type": 3,
      "path": "130000,130600,130622",
      "parentCode": "130600"
},
{
      "code": "130623",
      "name": "涞水县",
      "type": 3,
      "path": "130000,130600,130623",
      "parentCode": "130600"
},
{
      "code": "130624",
      "name": "阜平县",
      "type": 3,
      "path": "130000,130600,130624",
      "parentCode": "130600"
},
{
      "code": "130625",
      "name": "徐水县",
      "type": 3,
      "path": "130000,130600,130625",
      "parentCode": "130600"
},
{
      "code": "130626",
      "name": "定兴县",
      "type": 3,
      "path": "130000,130600,130626",
      "parentCode": "130600"
},
{
      "code": "130627",
      "name": "唐县",
      "type": 3,
      "path": "130000,130600,130627",
      "parentCode": "130600"
},
{
      "code": "130628",
      "name": "高阳县",
      "type": 3,
      "path": "130000,130600,130628",
      "parentCode": "130600"
},
{
      "code": "130629",
      "name": "容城县",
      "type": 3,
      "path": "130000,130600,130629",
      "parentCode": "130600"
},
{
      "code": "130630",
      "name": "涞源县",
      "type": 3,
      "path": "130000,130600,130630",
      "parentCode": "130600"
},
{
      "code": "130631",
      "name": "望都县",
      "type": 3,
      "path": "130000,130600,130631",
      "parentCode": "130600"
},
{
      "code": "130632",
      "name": "安新县",
      "type": 3,
      "path": "130000,130600,130632",
      "parentCode": "130600"
},
{
      "code": "130633",
      "name": "易县",
      "type": 3,
      "path": "130000,130600,130633",
      "parentCode": "130600"
},
{
      "code": "130634",
      "name": "曲阳县",
      "type": 3,
      "path": "130000,130600,130634",
      "parentCode": "130600"
},
{
      "code": "130635",
      "name": "蠡县",
      "type": 3,
      "path": "130000,130600,130635",
      "parentCode": "130600"
},
{
      "code": "130636",
      "name": "顺平县",
      "type": 3,
      "path": "130000,130600,130636",
      "parentCode": "130600"
},
{
      "code": "130637",
      "name": "博野县",
      "type": 3,
      "path": "130000,130600,130637",
      "parentCode": "130600"
},
{
      "code": "130638",
      "name": "雄县",
      "type": 3,
      "path": "130000,130600,130638",
      "parentCode": "130600"
},
{
      "code": "130681",
      "name": "涿州市",
      "type": 3,
      "path": "130000,130600,130681",
      "parentCode": "130600"
},
{
      "code": "130682",
      "name": "定州市",
      "type": 3,
      "path": "130000,130600,130682",
      "parentCode": "130600"
},
{
      "code": "130683",
      "name": "安国市",
      "type": 3,
      "path": "130000,130600,130683",
      "parentCode": "130600"
},
{
      "code": "130684",
      "name": "高碑店市",
      "type": 3,
      "path": "130000,130600,130684",
      "parentCode": "130600"
},
{
      "code": "130700",
      "name": "张家口市",
      "type": 2,
      "path": "130000,130700",
      "parentCode": "130000"
},
{
      "code": "130702",
      "name": "桥东区",
      "type": 3,
      "path": "130000,130700,130702",
      "parentCode": "130700"
},
{
      "code": "130703",
      "name": "桥西区",
      "type": 3,
      "path": "130000,130700,130703",
      "parentCode": "130700"
},
{
      "code": "130705",
      "name": "宣化区",
      "type": 3,
      "path": "130000,130700,130705",
      "parentCode": "130700"
},
{
      "code": "130706",
      "name": "下花园区",
      "type": 3,
      "path": "130000,130700,130706",
      "parentCode": "130700"
},
{
      "code": "130721",
      "name": "宣化县",
      "type": 3,
      "path": "130000,130700,130721",
      "parentCode": "130700"
},
{
      "code": "130722",
      "name": "张北县",
      "type": 3,
      "path": "130000,130700,130722",
      "parentCode": "130700"
},
{
      "code": "130723",
      "name": "康保县",
      "type": 3,
      "path": "130000,130700,130723",
      "parentCode": "130700"
},
{
      "code": "130724",
      "name": "沽源县",
      "type": 3,
      "path": "130000,130700,130724",
      "parentCode": "130700"
},
{
      "code": "130725",
      "name": "尚义县",
      "type": 3,
      "path": "130000,130700,130725",
      "parentCode": "130700"
},
{
      "code": "130726",
      "name": "蔚县",
      "type": 3,
      "path": "130000,130700,130726",
      "parentCode": "130700"
},
{
      "code": "130727",
      "name": "阳原县",
      "type": 3,
      "path": "130000,130700,130727",
      "parentCode": "130700"
},
{
      "code": "130728",
      "name": "怀安县",
      "type": 3,
      "path": "130000,130700,130728",
      "parentCode": "130700"
},
{
      "code": "130729",
      "name": "万全县",
      "type": 3,
      "path": "130000,130700,130729",
      "parentCode": "130700"
},
{
      "code": "130730",
      "name": "怀来县",
      "type": 3,
      "path": "130000,130700,130730",
      "parentCode": "130700"
},
{
      "code": "130731",
      "name": "涿鹿县",
      "type": 3,
      "path": "130000,130700,130731",
      "parentCode": "130700"
},
{
      "code": "130732",
      "name": "赤城县",
      "type": 3,
      "path": "130000,130700,130732",
      "parentCode": "130700"
},
{
      "code": "130733",
      "name": "崇礼县",
      "type": 3,
      "path": "130000,130700,130733",
      "parentCode": "130700"
},
{
      "code": "130800",
      "name": "承德市",
      "type": 2,
      "path": "130000,130800",
      "parentCode": "130000"
},
{
      "code": "130802",
      "name": "双桥区",
      "type": 3,
      "path": "130000,130800,130802",
      "parentCode": "130800"
},
{
      "code": "130803",
      "name": "双滦区",
      "type": 3,
      "path": "130000,130800,130803",
      "parentCode": "130800"
},
{
      "code": "130804",
      "name": "鹰手营子矿区",
      "type": 3,
      "path": "130000,130800,130804",
      "parentCode": "130800"
},
{
      "code": "130821",
      "name": "承德县",
      "type": 3,
      "path": "130000,130800,130821",
      "parentCode": "130800"
},
{
      "code": "130822",
      "name": "兴隆县",
      "type": 3,
      "path": "130000,130800,130822",
      "parentCode": "130800"
},
{
      "code": "130823",
      "name": "平泉县",
      "type": 3,
      "path": "130000,130800,130823",
      "parentCode": "130800"
},
{
      "code": "130824",
      "name": "滦平县",
      "type": 3,
      "path": "130000,130800,130824",
      "parentCode": "130800"
},
{
      "code": "130825",
      "name": "隆化县",
      "type": 3,
      "path": "130000,130800,130825",
      "parentCode": "130800"
},
{
      "code": "130826",
      "name": "丰宁满族自治县",
      "type": 3,
      "path": "130000,130800,130826",
      "parentCode": "130800"
},
{
      "code": "130827",
      "name": "宽城满族自治县",
      "type": 3,
      "path": "130000,130800,130827",
      "parentCode": "130800"
},
{
      "code": "130828",
      "name": "围场满族蒙古族自治县",
      "type": 3,
      "path": "130000,130800,130828",
      "parentCode": "130800"
},
{
      "code": "130900",
      "name": "沧州市",
      "type": 2,
      "path": "130000,130900",
      "parentCode": "130000"
},
{
      "code": "130902",
      "name": "新华区",
      "type": 3,
      "path": "130000,130900,130902",
      "parentCode": "130900"
},
{
      "code": "130903",
      "name": "运河区",
      "type": 3,
      "path": "130000,130900,130903",
      "parentCode": "130900"
},
{
      "code": "130921",
      "name": "沧县",
      "type": 3,
      "path": "130000,130900,130921",
      "parentCode": "130900"
},
{
      "code": "130922",
      "name": "青县",
      "type": 3,
      "path": "130000,130900,130922",
      "parentCode": "130900"
},
{
      "code": "130923",
      "name": "东光县",
      "type": 3,
      "path": "130000,130900,130923",
      "parentCode": "130900"
},
{
      "code": "130924",
      "name": "海兴县",
      "type": 3,
      "path": "130000,130900,130924",
      "parentCode": "130900"
},
{
      "code": "130925",
      "name": "盐山县",
      "type": 3,
      "path": "130000,130900,130925",
      "parentCode": "130900"
},
{
      "code": "130926",
      "name": "肃宁县",
      "type": 3,
      "path": "130000,130900,130926",
      "parentCode": "130900"
},
{
      "code": "130927",
      "name": "南皮县",
      "type": 3,
      "path": "130000,130900,130927",
      "parentCode": "130900"
},
{
      "code": "130928",
      "name": "吴桥县",
      "type": 3,
      "path": "130000,130900,130928",
      "parentCode": "130900"
},
{
      "code": "130929",
      "name": "献县",
      "type": 3,
      "path": "130000,130900,130929",
      "parentCode": "130900"
},
{
      "code": "130930",
      "name": "孟村回族自治县",
      "type": 3,
      "path": "130000,130900,130930",
      "parentCode": "130900"
},
{
      "code": "130981",
      "name": "泊头市",
      "type": 3,
      "path": "130000,130900,130981",
      "parentCode": "130900"
},
{
      "code": "130982",
      "name": "任丘市",
      "type": 3,
      "path": "130000,130900,130982",
      "parentCode": "130900"
},
{
      "code": "130983",
      "name": "黄骅市",
      "type": 3,
      "path": "130000,130900,130983",
      "parentCode": "130900"
},
{
      "code": "130984",
      "name": "河间市",
      "type": 3,
      "path": "130000,130900,130984",
      "parentCode": "130900"
},
{
      "code": "131000",
      "name": "廊坊市",
      "type": 2,
      "path": "130000,131000",
      "parentCode": "130000"
},
{
      "code": "131002",
      "name": "安次区",
      "type": 3,
      "path": "130000,131000,131002",
      "parentCode": "131000"
},
{
      "code": "131003",
      "name": "广阳区",
      "type": 3,
      "path": "130000,131000,131003",
      "parentCode": "131000"
},
{
      "code": "131022",
      "name": "固安县",
      "type": 3,
      "path": "130000,131000,131022",
      "parentCode": "131000"
},
{
      "code": "131023",
      "name": "永清县",
      "type": 3,
      "path": "130000,131000,131023",
      "parentCode": "131000"
},
{
      "code": "131024",
      "name": "香河县",
      "type": 3,
      "path": "130000,131000,131024",
      "parentCode": "131000"
},
{
      "code": "131025",
      "name": "大城县",
      "type": 3,
      "path": "130000,131000,131025",
      "parentCode": "131000"
},
{
      "code": "131026",
      "name": "文安县",
      "type": 3,
      "path": "130000,131000,131026",
      "parentCode": "131000"
},
{
      "code": "131028",
      "name": "大厂回族自治县",
      "type": 3,
      "path": "130000,131000,131028",
      "parentCode": "131000"
},
{
      "code": "131081",
      "name": "霸州市",
      "type": 3,
      "path": "130000,131000,131081",
      "parentCode": "131000"
},
{
      "code": "131082",
      "name": "三河市",
      "type": 3,
      "path": "130000,131000,131082",
      "parentCode": "131000"
},
{
      "code": "131100",
      "name": "衡水市",
      "type": 2,
      "path": "130000,131100",
      "parentCode": "130000"
},
{
      "code": "131102",
      "name": "桃城区",
      "type": 3,
      "path": "130000,131100,131102",
      "parentCode": "131100"
},
{
      "code": "131121",
      "name": "枣强县",
      "type": 3,
      "path": "130000,131100,131121",
      "parentCode": "131100"
},
{
      "code": "131122",
      "name": "武邑县",
      "type": 3,
      "path": "130000,131100,131122",
      "parentCode": "131100"
},
{
      "code": "131123",
      "name": "武强县",
      "type": 3,
      "path": "130000,131100,131123",
      "parentCode": "131100"
},
{
      "code": "131124",
      "name": "饶阳县",
      "type": 3,
      "path": "130000,131100,131124",
      "parentCode": "131100"
},
{
      "code": "131125",
      "name": "安平县",
      "type": 3,
      "path": "130000,131100,131125",
      "parentCode": "131100"
},
{
      "code": "131126",
      "name": "故城县",
      "type": 3,
      "path": "130000,131100,131126",
      "parentCode": "131100"
},
{
      "code": "131127",
      "name": "景县",
      "type": 3,
      "path": "130000,131100,131127",
      "parentCode": "131100"
},
{
      "code": "131128",
      "name": "阜城县",
      "type": 3,
      "path": "130000,131100,131128",
      "parentCode": "131100"
},
{
      "code": "131181",
      "name": "冀州市",
      "type": 3,
      "path": "130000,131100,131181",
      "parentCode": "131100"
},
{
      "code": "131182",
      "name": "深州市",
      "type": 3,
      "path": "130000,131100,131182",
      "parentCode": "131100"
},
{
      "code": "140000",
      "name": "山西省",
      "type": 1,
      "path": "140000",
      "parentCode": null
},
{
      "code": "140100",
      "name": "太原市",
      "type": 2,
      "path": "140000,140100",
      "parentCode": "140000"
},
{
      "code": "140105",
      "name": "小店区",
      "type": 3,
      "path": "140000,140100,140105",
      "parentCode": "140100"
},
{
      "code": "140106",
      "name": "迎泽区",
      "type": 3,
      "path": "140000,140100,140106",
      "parentCode": "140100"
},
{
      "code": "140107",
      "name": "杏花岭区",
      "type": 3,
      "path": "140000,140100,140107",
      "parentCode": "140100"
},
{
      "code": "140108",
      "name": "尖草坪区",
      "type": 3,
      "path": "140000,140100,140108",
      "parentCode": "140100"
},
{
      "code": "140109",
      "name": "万柏林区",
      "type": 3,
      "path": "140000,140100,140109",
      "parentCode": "140100"
},
{
      "code": "140110",
      "name": "晋源区",
      "type": 3,
      "path": "140000,140100,140110",
      "parentCode": "140100"
},
{
      "code": "140121",
      "name": "清徐县",
      "type": 3,
      "path": "140000,140100,140121",
      "parentCode": "140100"
},
{
      "code": "140122",
      "name": "阳曲县",
      "type": 3,
      "path": "140000,140100,140122",
      "parentCode": "140100"
},
{
      "code": "140123",
      "name": "娄烦县",
      "type": 3,
      "path": "140000,140100,140123",
      "parentCode": "140100"
},
{
      "code": "140181",
      "name": "古交市",
      "type": 3,
      "path": "140000,140100,140181",
      "parentCode": "140100"
},
{
      "code": "140200",
      "name": "大同市",
      "type": 2,
      "path": "140000,140200",
      "parentCode": "140000"
},
{
      "code": "140202",
      "name": "城区",
      "type": 3,
      "path": "140000,140200,140202",
      "parentCode": "140200"
},
{
      "code": "140203",
      "name": "矿区",
      "type": 3,
      "path": "140000,140200,140203",
      "parentCode": "140200"
},
{
      "code": "140211",
      "name": "南郊区",
      "type": 3,
      "path": "140000,140200,140211",
      "parentCode": "140200"
},
{
      "code": "140212",
      "name": "新荣区",
      "type": 3,
      "path": "140000,140200,140212",
      "parentCode": "140200"
},
{
      "code": "140221",
      "name": "阳高县",
      "type": 3,
      "path": "140000,140200,140221",
      "parentCode": "140200"
},
{
      "code": "140222",
      "name": "天镇县",
      "type": 3,
      "path": "140000,140200,140222",
      "parentCode": "140200"
},
{
      "code": "140223",
      "name": "广灵县",
      "type": 3,
      "path": "140000,140200,140223",
      "parentCode": "140200"
},
{
      "code": "140224",
      "name": "灵丘县",
      "type": 3,
      "path": "140000,140200,140224",
      "parentCode": "140200"
},
{
      "code": "140225",
      "name": "浑源县",
      "type": 3,
      "path": "140000,140200,140225",
      "parentCode": "140200"
},
{
      "code": "140226",
      "name": "左云县",
      "type": 3,
      "path": "140000,140200,140226",
      "parentCode": "140200"
},
{
      "code": "140227",
      "name": "大同县",
      "type": 3,
      "path": "140000,140200,140227",
      "parentCode": "140200"
},
{
      "code": "140300",
      "name": "阳泉市",
      "type": 2,
      "path": "140000,140300",
      "parentCode": "140000"
},
{
      "code": "140302",
      "name": "城区",
      "type": 3,
      "path": "140000,140300,140302",
      "parentCode": "140300"
},
{
      "code": "140303",
      "name": "矿区",
      "type": 3,
      "path": "140000,140300,140303",
      "parentCode": "140300"
},
{
      "code": "140311",
      "name": "郊区",
      "type": 3,
      "path": "140000,140300,140311",
      "parentCode": "140300"
},
{
      "code": "140321",
      "name": "平定县",
      "type": 3,
      "path": "140000,140300,140321",
      "parentCode": "140300"
},
{
      "code": "140322",
      "name": "盂县",
      "type": 3,
      "path": "140000,140300,140322",
      "parentCode": "140300"
},
{
      "code": "140400",
      "name": "长治市",
      "type": 2,
      "path": "140000,140400",
      "parentCode": "140000"
},
{
      "code": "140402",
      "name": "城区",
      "type": 3,
      "path": "140000,140400,140402",
      "parentCode": "140400"
},
{
      "code": "140411",
      "name": "郊区",
      "type": 3,
      "path": "140000,140400,140411",
      "parentCode": "140400"
},
{
      "code": "140421",
      "name": "长治县",
      "type": 3,
      "path": "140000,140400,140421",
      "parentCode": "140400"
},
{
      "code": "140423",
      "name": "襄垣县",
      "type": 3,
      "path": "140000,140400,140423",
      "parentCode": "140400"
},
{
      "code": "140424",
      "name": "屯留县",
      "type": 3,
      "path": "140000,140400,140424",
      "parentCode": "140400"
},
{
      "code": "140425",
      "name": "平顺县",
      "type": 3,
      "path": "140000,140400,140425",
      "parentCode": "140400"
},
{
      "code": "140426",
      "name": "黎城县",
      "type": 3,
      "path": "140000,140400,140426",
      "parentCode": "140400"
},
{
      "code": "140427",
      "name": "壶关县",
      "type": 3,
      "path": "140000,140400,140427",
      "parentCode": "140400"
},
{
      "code": "140428",
      "name": "长子县",
      "type": 3,
      "path": "140000,140400,140428",
      "parentCode": "140400"
},
{
      "code": "140429",
      "name": "武乡县",
      "type": 3,
      "path": "140000,140400,140429",
      "parentCode": "140400"
},
{
      "code": "140430",
      "name": "沁县",
      "type": 3,
      "path": "140000,140400,140430",
      "parentCode": "140400"
},
{
      "code": "140431",
      "name": "沁源县",
      "type": 3,
      "path": "140000,140400,140431",
      "parentCode": "140400"
},
{
      "code": "140481",
      "name": "潞城市",
      "type": 3,
      "path": "140000,140400,140481",
      "parentCode": "140400"
},
{
      "code": "140500",
      "name": "晋城市",
      "type": 2,
      "path": "140000,140500",
      "parentCode": "140000"
},
{
      "code": "140502",
      "name": "城区",
      "type": 3,
      "path": "140000,140500,140502",
      "parentCode": "140500"
},
{
      "code": "140521",
      "name": "沁水县",
      "type": 3,
      "path": "140000,140500,140521",
      "parentCode": "140500"
},
{
      "code": "140522",
      "name": "阳城县",
      "type": 3,
      "path": "140000,140500,140522",
      "parentCode": "140500"
},
{
      "code": "140524",
      "name": "陵川县",
      "type": 3,
      "path": "140000,140500,140524",
      "parentCode": "140500"
},
{
      "code": "140525",
      "name": "泽州县",
      "type": 3,
      "path": "140000,140500,140525",
      "parentCode": "140500"
},
{
      "code": "140581",
      "name": "高平市",
      "type": 3,
      "path": "140000,140500,140581",
      "parentCode": "140500"
},
{
      "code": "140600",
      "name": "朔州市",
      "type": 2,
      "path": "140000,140600",
      "parentCode": "140000"
},
{
      "code": "140602",
      "name": "朔城区",
      "type": 3,
      "path": "140000,140600,140602",
      "parentCode": "140600"
},
{
      "code": "140603",
      "name": "平鲁区",
      "type": 3,
      "path": "140000,140600,140603",
      "parentCode": "140600"
},
{
      "code": "140621",
      "name": "山阴县",
      "type": 3,
      "path": "140000,140600,140621",
      "parentCode": "140600"
},
{
      "code": "140622",
      "name": "应县",
      "type": 3,
      "path": "140000,140600,140622",
      "parentCode": "140600"
},
{
      "code": "140623",
      "name": "右玉县",
      "type": 3,
      "path": "140000,140600,140623",
      "parentCode": "140600"
},
{
      "code": "140624",
      "name": "怀仁县",
      "type": 3,
      "path": "140000,140600,140624",
      "parentCode": "140600"
},
{
      "code": "140700",
      "name": "晋中市",
      "type": 2,
      "path": "140000,140700",
      "parentCode": "140000"
},
{
      "code": "140702",
      "name": "榆次区",
      "type": 3,
      "path": "140000,140700,140702",
      "parentCode": "140700"
},
{
      "code": "140721",
      "name": "榆社县",
      "type": 3,
      "path": "140000,140700,140721",
      "parentCode": "140700"
},
{
      "code": "140722",
      "name": "左权县",
      "type": 3,
      "path": "140000,140700,140722",
      "parentCode": "140700"
},
{
      "code": "140723",
      "name": "和顺县",
      "type": 3,
      "path": "140000,140700,140723",
      "parentCode": "140700"
},
{
      "code": "140724",
      "name": "昔阳县",
      "type": 3,
      "path": "140000,140700,140724",
      "parentCode": "140700"
},
{
      "code": "140725",
      "name": "寿阳县",
      "type": 3,
      "path": "140000,140700,140725",
      "parentCode": "140700"
},
{
      "code": "140726",
      "name": "太谷县",
      "type": 3,
      "path": "140000,140700,140726",
      "parentCode": "140700"
},
{
      "code": "140727",
      "name": "祁县",
      "type": 3,
      "path": "140000,140700,140727",
      "parentCode": "140700"
},
{
      "code": "140728",
      "name": "平遥县",
      "type": 3,
      "path": "140000,140700,140728",
      "parentCode": "140700"
},
{
      "code": "140729",
      "name": "灵石县",
      "type": 3,
      "path": "140000,140700,140729",
      "parentCode": "140700"
},
{
      "code": "140781",
      "name": "介休市",
      "type": 3,
      "path": "140000,140700,140781",
      "parentCode": "140700"
},
{
      "code": "140800",
      "name": "运城市",
      "type": 2,
      "path": "140000,140800",
      "parentCode": "140000"
},
{
      "code": "140802",
      "name": "盐湖区",
      "type": 3,
      "path": "140000,140800,140802",
      "parentCode": "140800"
},
{
      "code": "140821",
      "name": "临猗县",
      "type": 3,
      "path": "140000,140800,140821",
      "parentCode": "140800"
},
{
      "code": "140822",
      "name": "万荣县",
      "type": 3,
      "path": "140000,140800,140822",
      "parentCode": "140800"
},
{
      "code": "140823",
      "name": "闻喜县",
      "type": 3,
      "path": "140000,140800,140823",
      "parentCode": "140800"
},
{
      "code": "140824",
      "name": "稷山县",
      "type": 3,
      "path": "140000,140800,140824",
      "parentCode": "140800"
},
{
      "code": "140825",
      "name": "新绛县",
      "type": 3,
      "path": "140000,140800,140825",
      "parentCode": "140800"
},
{
      "code": "140826",
      "name": "绛县",
      "type": 3,
      "path": "140000,140800,140826",
      "parentCode": "140800"
},
{
      "code": "140827",
      "name": "垣曲县",
      "type": 3,
      "path": "140000,140800,140827",
      "parentCode": "140800"
},
{
      "code": "140828",
      "name": "夏县",
      "type": 3,
      "path": "140000,140800,140828",
      "parentCode": "140800"
},
{
      "code": "140829",
      "name": "平陆县",
      "type": 3,
      "path": "140000,140800,140829",
      "parentCode": "140800"
},
{
      "code": "140830",
      "name": "芮城县",
      "type": 3,
      "path": "140000,140800,140830",
      "parentCode": "140800"
},
{
      "code": "140881",
      "name": "永济市",
      "type": 3,
      "path": "140000,140800,140881",
      "parentCode": "140800"
},
{
      "code": "140882",
      "name": "河津市",
      "type": 3,
      "path": "140000,140800,140882",
      "parentCode": "140800"
},
{
      "code": "140900",
      "name": "忻州市",
      "type": 2,
      "path": "140000,140900",
      "parentCode": "140000"
},
{
      "code": "140902",
      "name": "忻府区",
      "type": 3,
      "path": "140000,140900,140902",
      "parentCode": "140900"
},
{
      "code": "140921",
      "name": "定襄县",
      "type": 3,
      "path": "140000,140900,140921",
      "parentCode": "140900"
},
{
      "code": "140922",
      "name": "五台县",
      "type": 3,
      "path": "140000,140900,140922",
      "parentCode": "140900"
},
{
      "code": "140923",
      "name": "代县",
      "type": 3,
      "path": "140000,140900,140923",
      "parentCode": "140900"
},
{
      "code": "140924",
      "name": "繁峙县",
      "type": 3,
      "path": "140000,140900,140924",
      "parentCode": "140900"
},
{
      "code": "140925",
      "name": "宁武县",
      "type": 3,
      "path": "140000,140900,140925",
      "parentCode": "140900"
},
{
      "code": "140926",
      "name": "静乐县",
      "type": 3,
      "path": "140000,140900,140926",
      "parentCode": "140900"
},
{
      "code": "140927",
      "name": "神池县",
      "type": 3,
      "path": "140000,140900,140927",
      "parentCode": "140900"
},
{
      "code": "140928",
      "name": "五寨县",
      "type": 3,
      "path": "140000,140900,140928",
      "parentCode": "140900"
},
{
      "code": "140929",
      "name": "岢岚县",
      "type": 3,
      "path": "140000,140900,140929",
      "parentCode": "140900"
},
{
      "code": "140930",
      "name": "河曲县",
      "type": 3,
      "path": "140000,140900,140930",
      "parentCode": "140900"
},
{
      "code": "140931",
      "name": "保德县",
      "type": 3,
      "path": "140000,140900,140931",
      "parentCode": "140900"
},
{
      "code": "140932",
      "name": "偏关县",
      "type": 3,
      "path": "140000,140900,140932",
      "parentCode": "140900"
},
{
      "code": "140981",
      "name": "原平市",
      "type": 3,
      "path": "140000,140900,140981",
      "parentCode": "140900"
},
{
      "code": "141000",
      "name": "临汾市",
      "type": 2,
      "path": "140000,141000",
      "parentCode": "140000"
},
{
      "code": "141002",
      "name": "尧都区",
      "type": 3,
      "path": "140000,141000,141002",
      "parentCode": "141000"
},
{
      "code": "141021",
      "name": "曲沃县",
      "type": 3,
      "path": "140000,141000,141021",
      "parentCode": "141000"
},
{
      "code": "141022",
      "name": "翼城县",
      "type": 3,
      "path": "140000,141000,141022",
      "parentCode": "141000"
},
{
      "code": "141023",
      "name": "襄汾县",
      "type": 3,
      "path": "140000,141000,141023",
      "parentCode": "141000"
},
{
      "code": "141024",
      "name": "洪洞县",
      "type": 3,
      "path": "140000,141000,141024",
      "parentCode": "141000"
},
{
      "code": "141025",
      "name": "古县",
      "type": 3,
      "path": "140000,141000,141025",
      "parentCode": "141000"
},
{
      "code": "141026",
      "name": "安泽县",
      "type": 3,
      "path": "140000,141000,141026",
      "parentCode": "141000"
},
{
      "code": "141027",
      "name": "浮山县",
      "type": 3,
      "path": "140000,141000,141027",
      "parentCode": "141000"
},
{
      "code": "141028",
      "name": "吉县",
      "type": 3,
      "path": "140000,141000,141028",
      "parentCode": "141000"
},
{
      "code": "141029",
      "name": "乡宁县",
      "type": 3,
      "path": "140000,141000,141029",
      "parentCode": "141000"
},
{
      "code": "141030",
      "name": "大宁县",
      "type": 3,
      "path": "140000,141000,141030",
      "parentCode": "141000"
},
{
      "code": "141031",
      "name": "隰县",
      "type": 3,
      "path": "140000,141000,141031",
      "parentCode": "141000"
},
{
      "code": "141032",
      "name": "永和县",
      "type": 3,
      "path": "140000,141000,141032",
      "parentCode": "141000"
},
{
      "code": "141033",
      "name": "蒲县",
      "type": 3,
      "path": "140000,141000,141033",
      "parentCode": "141000"
},
{
      "code": "141034",
      "name": "汾西县",
      "type": 3,
      "path": "140000,141000,141034",
      "parentCode": "141000"
},
{
      "code": "141081",
      "name": "侯马市",
      "type": 3,
      "path": "140000,141000,141081",
      "parentCode": "141000"
},
{
      "code": "141082",
      "name": "霍州市",
      "type": 3,
      "path": "140000,141000,141082",
      "parentCode": "141000"
},
{
      "code": "141100",
      "name": "吕梁市",
      "type": 2,
      "path": "140000,141100",
      "parentCode": "140000"
},
{
      "code": "141102",
      "name": "离石区",
      "type": 3,
      "path": "140000,141100,141102",
      "parentCode": "141100"
},
{
      "code": "141121",
      "name": "文水县",
      "type": 3,
      "path": "140000,141100,141121",
      "parentCode": "141100"
},
{
      "code": "141122",
      "name": "交城县",
      "type": 3,
      "path": "140000,141100,141122",
      "parentCode": "141100"
},
{
      "code": "141123",
      "name": "兴县",
      "type": 3,
      "path": "140000,141100,141123",
      "parentCode": "141100"
},
{
      "code": "141124",
      "name": "临县",
      "type": 3,
      "path": "140000,141100,141124",
      "parentCode": "141100"
},
{
      "code": "141125",
      "name": "柳林县",
      "type": 3,
      "path": "140000,141100,141125",
      "parentCode": "141100"
},
{
      "code": "141126",
      "name": "石楼县",
      "type": 3,
      "path": "140000,141100,141126",
      "parentCode": "141100"
},
{
      "code": "141127",
      "name": "岚县",
      "type": 3,
      "path": "140000,141100,141127",
      "parentCode": "141100"
},
{
      "code": "141128",
      "name": "方山县",
      "type": 3,
      "path": "140000,141100,141128",
      "parentCode": "141100"
},
{
      "code": "141129",
      "name": "中阳县",
      "type": 3,
      "path": "140000,141100,141129",
      "parentCode": "141100"
},
{
      "code": "141130",
      "name": "交口县",
      "type": 3,
      "path": "140000,141100,141130",
      "parentCode": "141100"
},
{
      "code": "141181",
      "name": "孝义市",
      "type": 3,
      "path": "140000,141100,141181",
      "parentCode": "141100"
},
{
      "code": "141182",
      "name": "汾阳市",
      "type": 3,
      "path": "140000,141100,141182",
      "parentCode": "141100"
},
{
      "code": "150000",
      "name": "内蒙古自治区",
      "type": 1,
      "path": "150000",
      "parentCode": null
},
{
      "code": "150100",
      "name": "呼和浩特市",
      "type": 2,
      "path": "150000,150100",
      "parentCode": "150000"
},
{
      "code": "150102",
      "name": "新城区",
      "type": 3,
      "path": "150000,150100,150102",
      "parentCode": "150100"
},
{
      "code": "150103",
      "name": "回民区",
      "type": 3,
      "path": "150000,150100,150103",
      "parentCode": "150100"
},
{
      "code": "150104",
      "name": "玉泉区",
      "type": 3,
      "path": "150000,150100,150104",
      "parentCode": "150100"
},
{
      "code": "150105",
      "name": "赛罕区",
      "type": 3,
      "path": "150000,150100,150105",
      "parentCode": "150100"
},
{
      "code": "150121",
      "name": "土默特左旗",
      "type": 3,
      "path": "150000,150100,150121",
      "parentCode": "150100"
},
{
      "code": "150122",
      "name": "托克托县",
      "type": 3,
      "path": "150000,150100,150122",
      "parentCode": "150100"
},
{
      "code": "150123",
      "name": "和林格尔县",
      "type": 3,
      "path": "150000,150100,150123",
      "parentCode": "150100"
},
{
      "code": "150124",
      "name": "清水河县",
      "type": 3,
      "path": "150000,150100,150124",
      "parentCode": "150100"
},
{
      "code": "150125",
      "name": "武川县",
      "type": 3,
      "path": "150000,150100,150125",
      "parentCode": "150100"
},
{
      "code": "150200",
      "name": "包头市",
      "type": 2,
      "path": "150000,150200",
      "parentCode": "150000"
},
{
      "code": "150202",
      "name": "东河区",
      "type": 3,
      "path": "150000,150200,150202",
      "parentCode": "150200"
},
{
      "code": "150203",
      "name": "昆都仑区",
      "type": 3,
      "path": "150000,150200,150203",
      "parentCode": "150200"
},
{
      "code": "150204",
      "name": "青山区",
      "type": 3,
      "path": "150000,150200,150204",
      "parentCode": "150200"
},
{
      "code": "150205",
      "name": "石拐区",
      "type": 3,
      "path": "150000,150200,150205",
      "parentCode": "150200"
},
{
      "code": "150206",
      "name": "白云鄂博矿区",
      "type": 3,
      "path": "150000,150200,150206",
      "parentCode": "150200"
},
{
      "code": "150207",
      "name": "九原区",
      "type": 3,
      "path": "150000,150200,150207",
      "parentCode": "150200"
},
{
      "code": "150221",
      "name": "土默特右旗",
      "type": 3,
      "path": "150000,150200,150221",
      "parentCode": "150200"
},
{
      "code": "150222",
      "name": "固阳县",
      "type": 3,
      "path": "150000,150200,150222",
      "parentCode": "150200"
},
{
      "code": "150223",
      "name": "达尔罕茂明安联合旗",
      "type": 3,
      "path": "150000,150200,150223",
      "parentCode": "150200"
},
{
      "code": "150300",
      "name": "乌海市",
      "type": 2,
      "path": "150000,150300",
      "parentCode": "150000"
},
{
      "code": "150302",
      "name": "海勃湾区",
      "type": 3,
      "path": "150000,150300,150302",
      "parentCode": "150300"
},
{
      "code": "150303",
      "name": "海南区",
      "type": 3,
      "path": "150000,150300,150303",
      "parentCode": "150300"
},
{
      "code": "150304",
      "name": "乌达区",
      "type": 3,
      "path": "150000,150300,150304",
      "parentCode": "150300"
},
{
      "code": "150400",
      "name": "赤峰市",
      "type": 2,
      "path": "150000,150400",
      "parentCode": "150000"
},
{
      "code": "150402",
      "name": "红山区",
      "type": 3,
      "path": "150000,150400,150402",
      "parentCode": "150400"
},
{
      "code": "150403",
      "name": "元宝山区",
      "type": 3,
      "path": "150000,150400,150403",
      "parentCode": "150400"
},
{
      "code": "150404",
      "name": "松山区",
      "type": 3,
      "path": "150000,150400,150404",
      "parentCode": "150400"
},
{
      "code": "150421",
      "name": "阿鲁科尔沁旗",
      "type": 3,
      "path": "150000,150400,150421",
      "parentCode": "150400"
},
{
      "code": "150422",
      "name": "巴林左旗",
      "type": 3,
      "path": "150000,150400,150422",
      "parentCode": "150400"
},
{
      "code": "150423",
      "name": "巴林右旗",
      "type": 3,
      "path": "150000,150400,150423",
      "parentCode": "150400"
},
{
      "code": "150424",
      "name": "林西县",
      "type": 3,
      "path": "150000,150400,150424",
      "parentCode": "150400"
},
{
      "code": "150425",
      "name": "克什克腾旗",
      "type": 3,
      "path": "150000,150400,150425",
      "parentCode": "150400"
},
{
      "code": "150426",
      "name": "翁牛特旗",
      "type": 3,
      "path": "150000,150400,150426",
      "parentCode": "150400"
},
{
      "code": "150428",
      "name": "喀喇沁旗",
      "type": 3,
      "path": "150000,150400,150428",
      "parentCode": "150400"
},
{
      "code": "150429",
      "name": "宁城县",
      "type": 3,
      "path": "150000,150400,150429",
      "parentCode": "150400"
},
{
      "code": "150430",
      "name": "敖汉旗",
      "type": 3,
      "path": "150000,150400,150430",
      "parentCode": "150400"
},
{
      "code": "150500",
      "name": "通辽市",
      "type": 2,
      "path": "150000,150500",
      "parentCode": "150000"
},
{
      "code": "150502",
      "name": "科尔沁区",
      "type": 3,
      "path": "150000,150500,150502",
      "parentCode": "150500"
},
{
      "code": "150521",
      "name": "科尔沁左翼中旗",
      "type": 3,
      "path": "150000,150500,150521",
      "parentCode": "150500"
},
{
      "code": "150522",
      "name": "科尔沁左翼后旗",
      "type": 3,
      "path": "150000,150500,150522",
      "parentCode": "150500"
},
{
      "code": "150523",
      "name": "开鲁县",
      "type": 3,
      "path": "150000,150500,150523",
      "parentCode": "150500"
},
{
      "code": "150524",
      "name": "库伦旗",
      "type": 3,
      "path": "150000,150500,150524",
      "parentCode": "150500"
},
{
      "code": "150525",
      "name": "奈曼旗",
      "type": 3,
      "path": "150000,150500,150525",
      "parentCode": "150500"
},
{
      "code": "150526",
      "name": "扎鲁特旗",
      "type": 3,
      "path": "150000,150500,150526",
      "parentCode": "150500"
},
{
      "code": "150581",
      "name": "霍林郭勒市",
      "type": 3,
      "path": "150000,150500,150581",
      "parentCode": "150500"
},
{
      "code": "150600",
      "name": "鄂尔多斯市",
      "type": 2,
      "path": "150000,150600",
      "parentCode": "150000"
},
{
      "code": "150602",
      "name": "东胜区",
      "type": 3,
      "path": "150000,150600,150602",
      "parentCode": "150600"
},
{
      "code": "150621",
      "name": "达拉特旗",
      "type": 3,
      "path": "150000,150600,150621",
      "parentCode": "150600"
},
{
      "code": "150622",
      "name": "准格尔旗",
      "type": 3,
      "path": "150000,150600,150622",
      "parentCode": "150600"
},
{
      "code": "150623",
      "name": "鄂托克前旗",
      "type": 3,
      "path": "150000,150600,150623",
      "parentCode": "150600"
},
{
      "code": "150624",
      "name": "鄂托克旗",
      "type": 3,
      "path": "150000,150600,150624",
      "parentCode": "150600"
},
{
      "code": "150625",
      "name": "杭锦旗",
      "type": 3,
      "path": "150000,150600,150625",
      "parentCode": "150600"
},
{
      "code": "150626",
      "name": "乌审旗",
      "type": 3,
      "path": "150000,150600,150626",
      "parentCode": "150600"
},
{
      "code": "150627",
      "name": "伊金霍洛旗",
      "type": 3,
      "path": "150000,150600,150627",
      "parentCode": "150600"
},
{
      "code": "150700",
      "name": "呼伦贝尔市",
      "type": 2,
      "path": "150000,150700",
      "parentCode": "150000"
},
{
      "code": "150702",
      "name": "海拉尔区",
      "type": 3,
      "path": "150000,150700,150702",
      "parentCode": "150700"
},
{
      "code": "150703",
      "name": "扎赉诺尔区",
      "type": 3,
      "path": "150000,150700,150703",
      "parentCode": "150700"
},
{
      "code": "150721",
      "name": "阿荣旗",
      "type": 3,
      "path": "150000,150700,150721",
      "parentCode": "150700"
},
{
      "code": "150722",
      "name": "莫力达瓦达斡尔族自治旗",
      "type": 3,
      "path": "150000,150700,150722",
      "parentCode": "150700"
},
{
      "code": "150723",
      "name": "鄂伦春自治旗",
      "type": 3,
      "path": "150000,150700,150723",
      "parentCode": "150700"
},
{
      "code": "150724",
      "name": "鄂温克族自治旗",
      "type": 3,
      "path": "150000,150700,150724",
      "parentCode": "150700"
},
{
      "code": "150725",
      "name": "陈巴尔虎旗",
      "type": 3,
      "path": "150000,150700,150725",
      "parentCode": "150700"
},
{
      "code": "150726",
      "name": "新巴尔虎左旗",
      "type": 3,
      "path": "150000,150700,150726",
      "parentCode": "150700"
},
{
      "code": "150727",
      "name": "新巴尔虎右旗",
      "type": 3,
      "path": "150000,150700,150727",
      "parentCode": "150700"
},
{
      "code": "150781",
      "name": "满洲里市",
      "type": 3,
      "path": "150000,150700,150781",
      "parentCode": "150700"
},
{
      "code": "150782",
      "name": "牙克石市",
      "type": 3,
      "path": "150000,150700,150782",
      "parentCode": "150700"
},
{
      "code": "150783",
      "name": "扎兰屯市",
      "type": 3,
      "path": "150000,150700,150783",
      "parentCode": "150700"
},
{
      "code": "150784",
      "name": "额尔古纳市",
      "type": 3,
      "path": "150000,150700,150784",
      "parentCode": "150700"
},
{
      "code": "150785",
      "name": "根河市",
      "type": 3,
      "path": "150000,150700,150785",
      "parentCode": "150700"
},
{
      "code": "150800",
      "name": "巴彦淖尔市",
      "type": 2,
      "path": "150000,150800",
      "parentCode": "150000"
},
{
      "code": "150802",
      "name": "临河区",
      "type": 3,
      "path": "150000,150800,150802",
      "parentCode": "150800"
},
{
      "code": "150821",
      "name": "五原县",
      "type": 3,
      "path": "150000,150800,150821",
      "parentCode": "150800"
},
{
      "code": "150822",
      "name": "磴口县",
      "type": 3,
      "path": "150000,150800,150822",
      "parentCode": "150800"
},
{
      "code": "150823",
      "name": "乌拉特前旗",
      "type": 3,
      "path": "150000,150800,150823",
      "parentCode": "150800"
},
{
      "code": "150824",
      "name": "乌拉特中旗",
      "type": 3,
      "path": "150000,150800,150824",
      "parentCode": "150800"
},
{
      "code": "150825",
      "name": "乌拉特后旗",
      "type": 3,
      "path": "150000,150800,150825",
      "parentCode": "150800"
},
{
      "code": "150826",
      "name": "杭锦后旗",
      "type": 3,
      "path": "150000,150800,150826",
      "parentCode": "150800"
},
{
      "code": "150900",
      "name": "乌兰察布市",
      "type": 2,
      "path": "150000,150900",
      "parentCode": "150000"
},
{
      "code": "150902",
      "name": "集宁区",
      "type": 3,
      "path": "150000,150900,150902",
      "parentCode": "150900"
},
{
      "code": "150921",
      "name": "卓资县",
      "type": 3,
      "path": "150000,150900,150921",
      "parentCode": "150900"
},
{
      "code": "150922",
      "name": "化德县",
      "type": 3,
      "path": "150000,150900,150922",
      "parentCode": "150900"
},
{
      "code": "150923",
      "name": "商都县",
      "type": 3,
      "path": "150000,150900,150923",
      "parentCode": "150900"
},
{
      "code": "150924",
      "name": "兴和县",
      "type": 3,
      "path": "150000,150900,150924",
      "parentCode": "150900"
},
{
      "code": "150925",
      "name": "凉城县",
      "type": 3,
      "path": "150000,150900,150925",
      "parentCode": "150900"
},
{
      "code": "150926",
      "name": "察哈尔右翼前旗",
      "type": 3,
      "path": "150000,150900,150926",
      "parentCode": "150900"
},
{
      "code": "150927",
      "name": "察哈尔右翼中旗",
      "type": 3,
      "path": "150000,150900,150927",
      "parentCode": "150900"
},
{
      "code": "150928",
      "name": "察哈尔右翼后旗",
      "type": 3,
      "path": "150000,150900,150928",
      "parentCode": "150900"
},
{
      "code": "150929",
      "name": "四子王旗",
      "type": 3,
      "path": "150000,150900,150929",
      "parentCode": "150900"
},
{
      "code": "150981",
      "name": "丰镇市",
      "type": 3,
      "path": "150000,150900,150981",
      "parentCode": "150900"
},
{
      "code": "152200",
      "name": "兴安盟",
      "type": 2,
      "path": "150000,152200",
      "parentCode": "150000"
},
{
      "code": "152201",
      "name": "乌兰浩特市",
      "type": 3,
      "path": "150000,152200,152201",
      "parentCode": "152200"
},
{
      "code": "152202",
      "name": "阿尔山市",
      "type": 3,
      "path": "150000,152200,152202",
      "parentCode": "152200"
},
{
      "code": "152221",
      "name": "科尔沁右翼前旗",
      "type": 3,
      "path": "150000,152200,152221",
      "parentCode": "152200"
},
{
      "code": "152222",
      "name": "科尔沁右翼中旗",
      "type": 3,
      "path": "150000,152200,152222",
      "parentCode": "152200"
},
{
      "code": "152223",
      "name": "扎赉特旗",
      "type": 3,
      "path": "150000,152200,152223",
      "parentCode": "152200"
},
{
      "code": "152224",
      "name": "突泉县",
      "type": 3,
      "path": "150000,152200,152224",
      "parentCode": "152200"
},
{
      "code": "152500",
      "name": "锡林郭勒盟",
      "type": 2,
      "path": "150000,152500",
      "parentCode": "150000"
},
{
      "code": "152501",
      "name": "二连浩特市",
      "type": 3,
      "path": "150000,152500,152501",
      "parentCode": "152500"
},
{
      "code": "152502",
      "name": "锡林浩特市",
      "type": 3,
      "path": "150000,152500,152502",
      "parentCode": "152500"
},
{
      "code": "152522",
      "name": "阿巴嘎旗",
      "type": 3,
      "path": "150000,152500,152522",
      "parentCode": "152500"
},
{
      "code": "152523",
      "name": "苏尼特左旗",
      "type": 3,
      "path": "150000,152500,152523",
      "parentCode": "152500"
},
{
      "code": "152524",
      "name": "苏尼特右旗",
      "type": 3,
      "path": "150000,152500,152524",
      "parentCode": "152500"
},
{
      "code": "152525",
      "name": "东乌珠穆沁旗",
      "type": 3,
      "path": "150000,152500,152525",
      "parentCode": "152500"
},
{
      "code": "152526",
      "name": "西乌珠穆沁旗",
      "type": 3,
      "path": "150000,152500,152526",
      "parentCode": "152500"
},
{
      "code": "152527",
      "name": "太仆寺旗",
      "type": 3,
      "path": "150000,152500,152527",
      "parentCode": "152500"
},
{
      "code": "152528",
      "name": "镶黄旗",
      "type": 3,
      "path": "150000,152500,152528",
      "parentCode": "152500"
},
{
      "code": "152529",
      "name": "正镶白旗",
      "type": 3,
      "path": "150000,152500,152529",
      "parentCode": "152500"
},
{
      "code": "152530",
      "name": "正蓝旗",
      "type": 3,
      "path": "150000,152500,152530",
      "parentCode": "152500"
},
{
      "code": "152531",
      "name": "多伦县",
      "type": 3,
      "path": "150000,152500,152531",
      "parentCode": "152500"
},
{
      "code": "152900",
      "name": "阿拉善盟",
      "type": 2,
      "path": "150000,152900",
      "parentCode": "150000"
},
{
      "code": "152921",
      "name": "阿拉善左旗",
      "type": 3,
      "path": "150000,152900,152921",
      "parentCode": "152900"
},
{
      "code": "152922",
      "name": "阿拉善右旗",
      "type": 3,
      "path": "150000,152900,152922",
      "parentCode": "152900"
},
{
      "code": "152923",
      "name": "额济纳旗",
      "type": 3,
      "path": "150000,152900,152923",
      "parentCode": "152900"
},
{
      "code": "210000",
      "name": "辽宁省",
      "type": 1,
      "path": "210000",
      "parentCode": null
},
{
      "code": "210100",
      "name": "沈阳市",
      "type": 2,
      "path": "210000,210100",
      "parentCode": "210000"
},
{
      "code": "210102",
      "name": "和平区",
      "type": 3,
      "path": "210000,210100,210102",
      "parentCode": "210100"
},
{
      "code": "210103",
      "name": "沈河区",
      "type": 3,
      "path": "210000,210100,210103",
      "parentCode": "210100"
},
{
      "code": "210104",
      "name": "大东区",
      "type": 3,
      "path": "210000,210100,210104",
      "parentCode": "210100"
},
{
      "code": "210105",
      "name": "皇姑区",
      "type": 3,
      "path": "210000,210100,210105",
      "parentCode": "210100"
},
{
      "code": "210106",
      "name": "铁西区",
      "type": 3,
      "path": "210000,210100,210106",
      "parentCode": "210100"
},
{
      "code": "210111",
      "name": "苏家屯区",
      "type": 3,
      "path": "210000,210100,210111",
      "parentCode": "210100"
},
{
      "code": "210112",
      "name": "浑南区",
      "type": 3,
      "path": "210000,210100,210112",
      "parentCode": "210100"
},
{
      "code": "210113",
      "name": "沈北新区",
      "type": 3,
      "path": "210000,210100,210113",
      "parentCode": "210100"
},
{
      "code": "210114",
      "name": "于洪区",
      "type": 3,
      "path": "210000,210100,210114",
      "parentCode": "210100"
},
{
      "code": "210122",
      "name": "辽中县",
      "type": 3,
      "path": "210000,210100,210122",
      "parentCode": "210100"
},
{
      "code": "210123",
      "name": "康平县",
      "type": 3,
      "path": "210000,210100,210123",
      "parentCode": "210100"
},
{
      "code": "210124",
      "name": "法库县",
      "type": 3,
      "path": "210000,210100,210124",
      "parentCode": "210100"
},
{
      "code": "210181",
      "name": "新民市",
      "type": 3,
      "path": "210000,210100,210181",
      "parentCode": "210100"
},
{
      "code": "210200",
      "name": "大连市",
      "type": 2,
      "path": "210000,210200",
      "parentCode": "210000"
},
{
      "code": "210202",
      "name": "中山区",
      "type": 3,
      "path": "210000,210200,210202",
      "parentCode": "210200"
},
{
      "code": "210203",
      "name": "西岗区",
      "type": 3,
      "path": "210000,210200,210203",
      "parentCode": "210200"
},
{
      "code": "210204",
      "name": "沙河口区",
      "type": 3,
      "path": "210000,210200,210204",
      "parentCode": "210200"
},
{
      "code": "210211",
      "name": "甘井子区",
      "type": 3,
      "path": "210000,210200,210211",
      "parentCode": "210200"
},
{
      "code": "210212",
      "name": "旅顺口区",
      "type": 3,
      "path": "210000,210200,210212",
      "parentCode": "210200"
},
{
      "code": "210213",
      "name": "金州区",
      "type": 3,
      "path": "210000,210200,210213",
      "parentCode": "210200"
},
{
      "code": "210224",
      "name": "长海县",
      "type": 3,
      "path": "210000,210200,210224",
      "parentCode": "210200"
},
{
      "code": "210281",
      "name": "瓦房店市",
      "type": 3,
      "path": "210000,210200,210281",
      "parentCode": "210200"
},
{
      "code": "210282",
      "name": "普兰店市",
      "type": 3,
      "path": "210000,210200,210282",
      "parentCode": "210200"
},
{
      "code": "210283",
      "name": "庄河市",
      "type": 3,
      "path": "210000,210200,210283",
      "parentCode": "210200"
},
{
      "code": "210300",
      "name": "鞍山市",
      "type": 2,
      "path": "210000,210300",
      "parentCode": "210000"
},
{
      "code": "210302",
      "name": "铁东区",
      "type": 3,
      "path": "210000,210300,210302",
      "parentCode": "210300"
},
{
      "code": "210303",
      "name": "铁西区",
      "type": 3,
      "path": "210000,210300,210303",
      "parentCode": "210300"
},
{
      "code": "210304",
      "name": "立山区",
      "type": 3,
      "path": "210000,210300,210304",
      "parentCode": "210300"
},
{
      "code": "210311",
      "name": "千山区",
      "type": 3,
      "path": "210000,210300,210311",
      "parentCode": "210300"
},
{
      "code": "210321",
      "name": "台安县",
      "type": 3,
      "path": "210000,210300,210321",
      "parentCode": "210300"
},
{
      "code": "210323",
      "name": "岫岩满族自治县",
      "type": 3,
      "path": "210000,210300,210323",
      "parentCode": "210300"
},
{
      "code": "210381",
      "name": "海城市",
      "type": 3,
      "path": "210000,210300,210381",
      "parentCode": "210300"
},
{
      "code": "210400",
      "name": "抚顺市",
      "type": 2,
      "path": "210000,210400",
      "parentCode": "210000"
},
{
      "code": "210402",
      "name": "新抚区",
      "type": 3,
      "path": "210000,210400,210402",
      "parentCode": "210400"
},
{
      "code": "210403",
      "name": "东洲区",
      "type": 3,
      "path": "210000,210400,210403",
      "parentCode": "210400"
},
{
      "code": "210404",
      "name": "望花区",
      "type": 3,
      "path": "210000,210400,210404",
      "parentCode": "210400"
},
{
      "code": "210411",
      "name": "顺城区",
      "type": 3,
      "path": "210000,210400,210411",
      "parentCode": "210400"
},
{
      "code": "210421",
      "name": "抚顺县",
      "type": 3,
      "path": "210000,210400,210421",
      "parentCode": "210400"
},
{
      "code": "210422",
      "name": "新宾满族自治县",
      "type": 3,
      "path": "210000,210400,210422",
      "parentCode": "210400"
},
{
      "code": "210423",
      "name": "清原满族自治县",
      "type": 3,
      "path": "210000,210400,210423",
      "parentCode": "210400"
},
{
      "code": "210500",
      "name": "本溪市",
      "type": 2,
      "path": "210000,210500",
      "parentCode": "210000"
},
{
      "code": "210502",
      "name": "平山区",
      "type": 3,
      "path": "210000,210500,210502",
      "parentCode": "210500"
},
{
      "code": "210503",
      "name": "溪湖区",
      "type": 3,
      "path": "210000,210500,210503",
      "parentCode": "210500"
},
{
      "code": "210504",
      "name": "明山区",
      "type": 3,
      "path": "210000,210500,210504",
      "parentCode": "210500"
},
{
      "code": "210505",
      "name": "南芬区",
      "type": 3,
      "path": "210000,210500,210505",
      "parentCode": "210500"
},
{
      "code": "210521",
      "name": "本溪满族自治县",
      "type": 3,
      "path": "210000,210500,210521",
      "parentCode": "210500"
},
{
      "code": "210522",
      "name": "桓仁满族自治县",
      "type": 3,
      "path": "210000,210500,210522",
      "parentCode": "210500"
},
{
      "code": "210600",
      "name": "丹东市",
      "type": 2,
      "path": "210000,210600",
      "parentCode": "210000"
},
{
      "code": "210602",
      "name": "元宝区",
      "type": 3,
      "path": "210000,210600,210602",
      "parentCode": "210600"
},
{
      "code": "210603",
      "name": "振兴区",
      "type": 3,
      "path": "210000,210600,210603",
      "parentCode": "210600"
},
{
      "code": "210604",
      "name": "振安区",
      "type": 3,
      "path": "210000,210600,210604",
      "parentCode": "210600"
},
{
      "code": "210624",
      "name": "宽甸满族自治县",
      "type": 3,
      "path": "210000,210600,210624",
      "parentCode": "210600"
},
{
      "code": "210681",
      "name": "东港市",
      "type": 3,
      "path": "210000,210600,210681",
      "parentCode": "210600"
},
{
      "code": "210682",
      "name": "凤城市",
      "type": 3,
      "path": "210000,210600,210682",
      "parentCode": "210600"
},
{
      "code": "210700",
      "name": "锦州市",
      "type": 2,
      "path": "210000,210700",
      "parentCode": "210000"
},
{
      "code": "210702",
      "name": "古塔区",
      "type": 3,
      "path": "210000,210700,210702",
      "parentCode": "210700"
},
{
      "code": "210703",
      "name": "凌河区",
      "type": 3,
      "path": "210000,210700,210703",
      "parentCode": "210700"
},
{
      "code": "210711",
      "name": "太和区",
      "type": 3,
      "path": "210000,210700,210711",
      "parentCode": "210700"
},
{
      "code": "210726",
      "name": "黑山县",
      "type": 3,
      "path": "210000,210700,210726",
      "parentCode": "210700"
},
{
      "code": "210727",
      "name": "义县",
      "type": 3,
      "path": "210000,210700,210727",
      "parentCode": "210700"
},
{
      "code": "210781",
      "name": "凌海市",
      "type": 3,
      "path": "210000,210700,210781",
      "parentCode": "210700"
},
{
      "code": "210782",
      "name": "北镇市",
      "type": 3,
      "path": "210000,210700,210782",
      "parentCode": "210700"
},
{
      "code": "210800",
      "name": "营口市",
      "type": 2,
      "path": "210000,210800",
      "parentCode": "210000"
},
{
      "code": "210802",
      "name": "站前区",
      "type": 3,
      "path": "210000,210800,210802",
      "parentCode": "210800"
},
{
      "code": "210803",
      "name": "西市区",
      "type": 3,
      "path": "210000,210800,210803",
      "parentCode": "210800"
},
{
      "code": "210804",
      "name": "鲅鱼圈区",
      "type": 3,
      "path": "210000,210800,210804",
      "parentCode": "210800"
},
{
      "code": "210811",
      "name": "老边区",
      "type": 3,
      "path": "210000,210800,210811",
      "parentCode": "210800"
},
{
      "code": "210881",
      "name": "盖州市",
      "type": 3,
      "path": "210000,210800,210881",
      "parentCode": "210800"
},
{
      "code": "210882",
      "name": "大石桥市",
      "type": 3,
      "path": "210000,210800,210882",
      "parentCode": "210800"
},
{
      "code": "210900",
      "name": "阜新市",
      "type": 2,
      "path": "210000,210900",
      "parentCode": "210000"
},
{
      "code": "210902",
      "name": "海州区",
      "type": 3,
      "path": "210000,210900,210902",
      "parentCode": "210900"
},
{
      "code": "210903",
      "name": "新邱区",
      "type": 3,
      "path": "210000,210900,210903",
      "parentCode": "210900"
},
{
      "code": "210904",
      "name": "太平区",
      "type": 3,
      "path": "210000,210900,210904",
      "parentCode": "210900"
},
{
      "code": "210905",
      "name": "清河门区",
      "type": 3,
      "path": "210000,210900,210905",
      "parentCode": "210900"
},
{
      "code": "210911",
      "name": "细河区",
      "type": 3,
      "path": "210000,210900,210911",
      "parentCode": "210900"
},
{
      "code": "210921",
      "name": "阜新蒙古族自治县",
      "type": 3,
      "path": "210000,210900,210921",
      "parentCode": "210900"
},
{
      "code": "210922",
      "name": "彰武县",
      "type": 3,
      "path": "210000,210900,210922",
      "parentCode": "210900"
},
{
      "code": "211000",
      "name": "辽阳市",
      "type": 2,
      "path": "210000,211000",
      "parentCode": "210000"
},
{
      "code": "211002",
      "name": "白塔区",
      "type": 3,
      "path": "210000,211000,211002",
      "parentCode": "211000"
},
{
      "code": "211003",
      "name": "文圣区",
      "type": 3,
      "path": "210000,211000,211003",
      "parentCode": "211000"
},
{
      "code": "211004",
      "name": "宏伟区",
      "type": 3,
      "path": "210000,211000,211004",
      "parentCode": "211000"
},
{
      "code": "211005",
      "name": "弓长岭区",
      "type": 3,
      "path": "210000,211000,211005",
      "parentCode": "211000"
},
{
      "code": "211011",
      "name": "太子河区",
      "type": 3,
      "path": "210000,211000,211011",
      "parentCode": "211000"
},
{
      "code": "211021",
      "name": "辽阳县",
      "type": 3,
      "path": "210000,211000,211021",
      "parentCode": "211000"
},
{
      "code": "211081",
      "name": "灯塔市",
      "type": 3,
      "path": "210000,211000,211081",
      "parentCode": "211000"
},
{
      "code": "211100",
      "name": "盘锦市",
      "type": 2,
      "path": "210000,211100",
      "parentCode": "210000"
},
{
      "code": "211102",
      "name": "双台子区",
      "type": 3,
      "path": "210000,211100,211102",
      "parentCode": "211100"
},
{
      "code": "211103",
      "name": "兴隆台区",
      "type": 3,
      "path": "210000,211100,211103",
      "parentCode": "211100"
},
{
      "code": "211121",
      "name": "大洼县",
      "type": 3,
      "path": "210000,211100,211121",
      "parentCode": "211100"
},
{
      "code": "211122",
      "name": "盘山县",
      "type": 3,
      "path": "210000,211100,211122",
      "parentCode": "211100"
},
{
      "code": "211200",
      "name": "铁岭市",
      "type": 2,
      "path": "210000,211200",
      "parentCode": "210000"
},
{
      "code": "211202",
      "name": "银州区",
      "type": 3,
      "path": "210000,211200,211202",
      "parentCode": "211200"
},
{
      "code": "211204",
      "name": "清河区",
      "type": 3,
      "path": "210000,211200,211204",
      "parentCode": "211200"
},
{
      "code": "211221",
      "name": "铁岭县",
      "type": 3,
      "path": "210000,211200,211221",
      "parentCode": "211200"
},
{
      "code": "211223",
      "name": "西丰县",
      "type": 3,
      "path": "210000,211200,211223",
      "parentCode": "211200"
},
{
      "code": "211224",
      "name": "昌图县",
      "type": 3,
      "path": "210000,211200,211224",
      "parentCode": "211200"
},
{
      "code": "211281",
      "name": "调兵山市",
      "type": 3,
      "path": "210000,211200,211281",
      "parentCode": "211200"
},
{
      "code": "211282",
      "name": "开原市",
      "type": 3,
      "path": "210000,211200,211282",
      "parentCode": "211200"
},
{
      "code": "211300",
      "name": "朝阳市",
      "type": 2,
      "path": "210000,211300",
      "parentCode": "210000"
},
{
      "code": "211302",
      "name": "双塔区",
      "type": 3,
      "path": "210000,211300,211302",
      "parentCode": "211300"
},
{
      "code": "211303",
      "name": "龙城区",
      "type": 3,
      "path": "210000,211300,211303",
      "parentCode": "211300"
},
{
      "code": "211321",
      "name": "朝阳县",
      "type": 3,
      "path": "210000,211300,211321",
      "parentCode": "211300"
},
{
      "code": "211322",
      "name": "建平县",
      "type": 3,
      "path": "210000,211300,211322",
      "parentCode": "211300"
},
{
      "code": "211324",
      "name": "喀喇沁左翼蒙古族自治县",
      "type": 3,
      "path": "210000,211300,211324",
      "parentCode": "211300"
},
{
      "code": "211381",
      "name": "北票市",
      "type": 3,
      "path": "210000,211300,211381",
      "parentCode": "211300"
},
{
      "code": "211382",
      "name": "凌源市",
      "type": 3,
      "path": "210000,211300,211382",
      "parentCode": "211300"
},
{
      "code": "211400",
      "name": "葫芦岛市",
      "type": 2,
      "path": "210000,211400",
      "parentCode": "210000"
},
{
      "code": "211402",
      "name": "连山区",
      "type": 3,
      "path": "210000,211400,211402",
      "parentCode": "211400"
},
{
      "code": "211403",
      "name": "龙港区",
      "type": 3,
      "path": "210000,211400,211403",
      "parentCode": "211400"
},
{
      "code": "211404",
      "name": "南票区",
      "type": 3,
      "path": "210000,211400,211404",
      "parentCode": "211400"
},
{
      "code": "211421",
      "name": "绥中县",
      "type": 3,
      "path": "210000,211400,211421",
      "parentCode": "211400"
},
{
      "code": "211422",
      "name": "建昌县",
      "type": 3,
      "path": "210000,211400,211422",
      "parentCode": "211400"
},
{
      "code": "211481",
      "name": "兴城市",
      "type": 3,
      "path": "210000,211400,211481",
      "parentCode": "211400"
},
{
      "code": "220000",
      "name": "吉林省",
      "type": 1,
      "path": "220000",
      "parentCode": null
},
{
      "code": "220100",
      "name": "长春市",
      "type": 2,
      "path": "220000,220100",
      "parentCode": "220000"
},
{
      "code": "220102",
      "name": "南关区",
      "type": 3,
      "path": "220000,220100,220102",
      "parentCode": "220100"
},
{
      "code": "220103",
      "name": "宽城区",
      "type": 3,
      "path": "220000,220100,220103",
      "parentCode": "220100"
},
{
      "code": "220104",
      "name": "朝阳区",
      "type": 3,
      "path": "220000,220100,220104",
      "parentCode": "220100"
},
{
      "code": "220105",
      "name": "二道区",
      "type": 3,
      "path": "220000,220100,220105",
      "parentCode": "220100"
},
{
      "code": "220106",
      "name": "绿园区",
      "type": 3,
      "path": "220000,220100,220106",
      "parentCode": "220100"
},
{
      "code": "220112",
      "name": "双阳区",
      "type": 3,
      "path": "220000,220100,220112",
      "parentCode": "220100"
},
{
      "code": "220113",
      "name": "九台区",
      "type": 3,
      "path": "220000,220100,220113",
      "parentCode": "220100"
},
{
      "code": "220122",
      "name": "农安县",
      "type": 3,
      "path": "220000,220100,220122",
      "parentCode": "220100"
},
{
      "code": "220182",
      "name": "榆树市",
      "type": 3,
      "path": "220000,220100,220182",
      "parentCode": "220100"
},
{
      "code": "220183",
      "name": "德惠市",
      "type": 3,
      "path": "220000,220100,220183",
      "parentCode": "220100"
},
{
      "code": "220200",
      "name": "吉林市",
      "type": 2,
      "path": "220000,220200",
      "parentCode": "220000"
},
{
      "code": "220202",
      "name": "昌邑区",
      "type": 3,
      "path": "220000,220200,220202",
      "parentCode": "220200"
},
{
      "code": "220203",
      "name": "龙潭区",
      "type": 3,
      "path": "220000,220200,220203",
      "parentCode": "220200"
},
{
      "code": "220204",
      "name": "船营区",
      "type": 3,
      "path": "220000,220200,220204",
      "parentCode": "220200"
},
{
      "code": "220211",
      "name": "丰满区",
      "type": 3,
      "path": "220000,220200,220211",
      "parentCode": "220200"
},
{
      "code": "220221",
      "name": "永吉县",
      "type": 3,
      "path": "220000,220200,220221",
      "parentCode": "220200"
},
{
      "code": "220281",
      "name": "蛟河市",
      "type": 3,
      "path": "220000,220200,220281",
      "parentCode": "220200"
},
{
      "code": "220282",
      "name": "桦甸市",
      "type": 3,
      "path": "220000,220200,220282",
      "parentCode": "220200"
},
{
      "code": "220283",
      "name": "舒兰市",
      "type": 3,
      "path": "220000,220200,220283",
      "parentCode": "220200"
},
{
      "code": "220284",
      "name": "磐石市",
      "type": 3,
      "path": "220000,220200,220284",
      "parentCode": "220200"
},
{
      "code": "220300",
      "name": "四平市",
      "type": 2,
      "path": "220000,220300",
      "parentCode": "220000"
},
{
      "code": "220302",
      "name": "铁西区",
      "type": 3,
      "path": "220000,220300,220302",
      "parentCode": "220300"
},
{
      "code": "220303",
      "name": "铁东区",
      "type": 3,
      "path": "220000,220300,220303",
      "parentCode": "220300"
},
{
      "code": "220322",
      "name": "梨树县",
      "type": 3,
      "path": "220000,220300,220322",
      "parentCode": "220300"
},
{
      "code": "220323",
      "name": "伊通满族自治县",
      "type": 3,
      "path": "220000,220300,220323",
      "parentCode": "220300"
},
{
      "code": "220381",
      "name": "公主岭市",
      "type": 3,
      "path": "220000,220300,220381",
      "parentCode": "220300"
},
{
      "code": "220382",
      "name": "双辽市",
      "type": 3,
      "path": "220000,220300,220382",
      "parentCode": "220300"
},
{
      "code": "220400",
      "name": "辽源市",
      "type": 2,
      "path": "220000,220400",
      "parentCode": "220000"
},
{
      "code": "220402",
      "name": "龙山区",
      "type": 3,
      "path": "220000,220400,220402",
      "parentCode": "220400"
},
{
      "code": "220403",
      "name": "西安区",
      "type": 3,
      "path": "220000,220400,220403",
      "parentCode": "220400"
},
{
      "code": "220421",
      "name": "东丰县",
      "type": 3,
      "path": "220000,220400,220421",
      "parentCode": "220400"
},
{
      "code": "220422",
      "name": "东辽县",
      "type": 3,
      "path": "220000,220400,220422",
      "parentCode": "220400"
},
{
      "code": "220500",
      "name": "通化市",
      "type": 2,
      "path": "220000,220500",
      "parentCode": "220000"
},
{
      "code": "220502",
      "name": "东昌区",
      "type": 3,
      "path": "220000,220500,220502",
      "parentCode": "220500"
},
{
      "code": "220503",
      "name": "二道江区",
      "type": 3,
      "path": "220000,220500,220503",
      "parentCode": "220500"
},
{
      "code": "220521",
      "name": "通化县",
      "type": 3,
      "path": "220000,220500,220521",
      "parentCode": "220500"
},
{
      "code": "220523",
      "name": "辉南县",
      "type": 3,
      "path": "220000,220500,220523",
      "parentCode": "220500"
},
{
      "code": "220524",
      "name": "柳河县",
      "type": 3,
      "path": "220000,220500,220524",
      "parentCode": "220500"
},
{
      "code": "220581",
      "name": "梅河口市",
      "type": 3,
      "path": "220000,220500,220581",
      "parentCode": "220500"
},
{
      "code": "220582",
      "name": "集安市",
      "type": 3,
      "path": "220000,220500,220582",
      "parentCode": "220500"
},
{
      "code": "220600",
      "name": "白山市",
      "type": 2,
      "path": "220000,220600",
      "parentCode": "220000"
},
{
      "code": "220602",
      "name": "浑江区",
      "type": 3,
      "path": "220000,220600,220602",
      "parentCode": "220600"
},
{
      "code": "220605",
      "name": "江源区",
      "type": 3,
      "path": "220000,220600,220605",
      "parentCode": "220600"
},
{
      "code": "220621",
      "name": "抚松县",
      "type": 3,
      "path": "220000,220600,220621",
      "parentCode": "220600"
},
{
      "code": "220622",
      "name": "靖宇县",
      "type": 3,
      "path": "220000,220600,220622",
      "parentCode": "220600"
},
{
      "code": "220623",
      "name": "长白朝鲜族自治县",
      "type": 3,
      "path": "220000,220600,220623",
      "parentCode": "220600"
},
{
      "code": "220681",
      "name": "临江市",
      "type": 3,
      "path": "220000,220600,220681",
      "parentCode": "220600"
},
{
      "code": "220700",
      "name": "松原市",
      "type": 2,
      "path": "220000,220700",
      "parentCode": "220000"
},
{
      "code": "220702",
      "name": "宁江区",
      "type": 3,
      "path": "220000,220700,220702",
      "parentCode": "220700"
},
{
      "code": "220721",
      "name": "前郭尔罗斯蒙古族自治县",
      "type": 3,
      "path": "220000,220700,220721",
      "parentCode": "220700"
},
{
      "code": "220722",
      "name": "长岭县",
      "type": 3,
      "path": "220000,220700,220722",
      "parentCode": "220700"
},
{
      "code": "220723",
      "name": "乾安县",
      "type": 3,
      "path": "220000,220700,220723",
      "parentCode": "220700"
},
{
      "code": "220781",
      "name": "扶余市",
      "type": 3,
      "path": "220000,220700,220781",
      "parentCode": "220700"
},
{
      "code": "220800",
      "name": "白城市",
      "type": 2,
      "path": "220000,220800",
      "parentCode": "220000"
},
{
      "code": "220802",
      "name": "洮北区",
      "type": 3,
      "path": "220000,220800,220802",
      "parentCode": "220800"
},
{
      "code": "220821",
      "name": "镇赉县",
      "type": 3,
      "path": "220000,220800,220821",
      "parentCode": "220800"
},
{
      "code": "220822",
      "name": "通榆县",
      "type": 3,
      "path": "220000,220800,220822",
      "parentCode": "220800"
},
{
      "code": "220881",
      "name": "洮南市",
      "type": 3,
      "path": "220000,220800,220881",
      "parentCode": "220800"
},
{
      "code": "220882",
      "name": "大安市",
      "type": 3,
      "path": "220000,220800,220882",
      "parentCode": "220800"
},
{
      "code": "222400",
      "name": "延边朝鲜族自治州",
      "type": 2,
      "path": "220000,222400",
      "parentCode": "220000"
},
{
      "code": "222401",
      "name": "延吉市",
      "type": 3,
      "path": "220000,222400,222401",
      "parentCode": "222400"
},
{
      "code": "222402",
      "name": "图们市",
      "type": 3,
      "path": "220000,222400,222402",
      "parentCode": "222400"
},
{
      "code": "222403",
      "name": "敦化市",
      "type": 3,
      "path": "220000,222400,222403",
      "parentCode": "222400"
},
{
      "code": "222404",
      "name": "珲春市",
      "type": 3,
      "path": "220000,222400,222404",
      "parentCode": "222400"
},
{
      "code": "222405",
      "name": "龙井市",
      "type": 3,
      "path": "220000,222400,222405",
      "parentCode": "222400"
},
{
      "code": "222406",
      "name": "和龙市",
      "type": 3,
      "path": "220000,222400,222406",
      "parentCode": "222400"
},
{
      "code": "222424",
      "name": "汪清县",
      "type": 3,
      "path": "220000,222400,222424",
      "parentCode": "222400"
},
{
      "code": "222426",
      "name": "安图县",
      "type": 3,
      "path": "220000,222400,222426",
      "parentCode": "222400"
},
{
      "code": "230000",
      "name": "黑龙江省",
      "type": 1,
      "path": "230000",
      "parentCode": null
},
{
      "code": "230100",
      "name": "哈尔滨市",
      "type": 2,
      "path": "230000,230100",
      "parentCode": "230000"
},
{
      "code": "230102",
      "name": "道里区",
      "type": 3,
      "path": "230000,230100,230102",
      "parentCode": "230100"
},
{
      "code": "230103",
      "name": "南岗区",
      "type": 3,
      "path": "230000,230100,230103",
      "parentCode": "230100"
},
{
      "code": "230104",
      "name": "道外区",
      "type": 3,
      "path": "230000,230100,230104",
      "parentCode": "230100"
},
{
      "code": "230108",
      "name": "平房区",
      "type": 3,
      "path": "230000,230100,230108",
      "parentCode": "230100"
},
{
      "code": "230109",
      "name": "松北区",
      "type": 3,
      "path": "230000,230100,230109",
      "parentCode": "230100"
},
{
      "code": "230110",
      "name": "香坊区",
      "type": 3,
      "path": "230000,230100,230110",
      "parentCode": "230100"
},
{
      "code": "230111",
      "name": "呼兰区",
      "type": 3,
      "path": "230000,230100,230111",
      "parentCode": "230100"
},
{
      "code": "230112",
      "name": "阿城区",
      "type": 3,
      "path": "230000,230100,230112",
      "parentCode": "230100"
},
{
      "code": "230123",
      "name": "依兰县",
      "type": 3,
      "path": "230000,230100,230123",
      "parentCode": "230100"
},
{
      "code": "230124",
      "name": "方正县",
      "type": 3,
      "path": "230000,230100,230124",
      "parentCode": "230100"
},
{
      "code": "230125",
      "name": "宾县",
      "type": 3,
      "path": "230000,230100,230125",
      "parentCode": "230100"
},
{
      "code": "230126",
      "name": "巴彦县",
      "type": 3,
      "path": "230000,230100,230126",
      "parentCode": "230100"
},
{
      "code": "230127",
      "name": "木兰县",
      "type": 3,
      "path": "230000,230100,230127",
      "parentCode": "230100"
},
{
      "code": "230128",
      "name": "通河县",
      "type": 3,
      "path": "230000,230100,230128",
      "parentCode": "230100"
},
{
      "code": "230129",
      "name": "延寿县",
      "type": 3,
      "path": "230000,230100,230129",
      "parentCode": "230100"
},
{
      "code": "230182",
      "name": "双城市",
      "type": 3,
      "path": "230000,230100,230182",
      "parentCode": "230100"
},
{
      "code": "230183",
      "name": "尚志市",
      "type": 3,
      "path": "230000,230100,230183",
      "parentCode": "230100"
},
{
      "code": "230184",
      "name": "五常市",
      "type": 3,
      "path": "230000,230100,230184",
      "parentCode": "230100"
},
{
      "code": "230200",
      "name": "齐齐哈尔市",
      "type": 2,
      "path": "230000,230200",
      "parentCode": "230000"
},
{
      "code": "230202",
      "name": "龙沙区",
      "type": 3,
      "path": "230000,230200,230202",
      "parentCode": "230200"
},
{
      "code": "230203",
      "name": "建华区",
      "type": 3,
      "path": "230000,230200,230203",
      "parentCode": "230200"
},
{
      "code": "230204",
      "name": "铁锋区",
      "type": 3,
      "path": "230000,230200,230204",
      "parentCode": "230200"
},
{
      "code": "230205",
      "name": "昂昂溪区",
      "type": 3,
      "path": "230000,230200,230205",
      "parentCode": "230200"
},
{
      "code": "230206",
      "name": "富拉尔基区",
      "type": 3,
      "path": "230000,230200,230206",
      "parentCode": "230200"
},
{
      "code": "230207",
      "name": "碾子山区",
      "type": 3,
      "path": "230000,230200,230207",
      "parentCode": "230200"
},
{
      "code": "230208",
      "name": "梅里斯达斡尔族区",
      "type": 3,
      "path": "230000,230200,230208",
      "parentCode": "230200"
},
{
      "code": "230221",
      "name": "龙江县",
      "type": 3,
      "path": "230000,230200,230221",
      "parentCode": "230200"
},
{
      "code": "230223",
      "name": "依安县",
      "type": 3,
      "path": "230000,230200,230223",
      "parentCode": "230200"
},
{
      "code": "230224",
      "name": "泰来县",
      "type": 3,
      "path": "230000,230200,230224",
      "parentCode": "230200"
},
{
      "code": "230225",
      "name": "甘南县",
      "type": 3,
      "path": "230000,230200,230225",
      "parentCode": "230200"
},
{
      "code": "230227",
      "name": "富裕县",
      "type": 3,
      "path": "230000,230200,230227",
      "parentCode": "230200"
},
{
      "code": "230229",
      "name": "克山县",
      "type": 3,
      "path": "230000,230200,230229",
      "parentCode": "230200"
},
{
      "code": "230230",
      "name": "克东县",
      "type": 3,
      "path": "230000,230200,230230",
      "parentCode": "230200"
},
{
      "code": "230231",
      "name": "拜泉县",
      "type": 3,
      "path": "230000,230200,230231",
      "parentCode": "230200"
},
{
      "code": "230281",
      "name": "讷河市",
      "type": 3,
      "path": "230000,230200,230281",
      "parentCode": "230200"
},
{
      "code": "230300",
      "name": "鸡西市",
      "type": 2,
      "path": "230000,230300",
      "parentCode": "230000"
},
{
      "code": "230302",
      "name": "鸡冠区",
      "type": 3,
      "path": "230000,230300,230302",
      "parentCode": "230300"
},
{
      "code": "230303",
      "name": "恒山区",
      "type": 3,
      "path": "230000,230300,230303",
      "parentCode": "230300"
},
{
      "code": "230304",
      "name": "滴道区",
      "type": 3,
      "path": "230000,230300,230304",
      "parentCode": "230300"
},
{
      "code": "230305",
      "name": "梨树区",
      "type": 3,
      "path": "230000,230300,230305",
      "parentCode": "230300"
},
{
      "code": "230306",
      "name": "城子河区",
      "type": 3,
      "path": "230000,230300,230306",
      "parentCode": "230300"
},
{
      "code": "230307",
      "name": "麻山区",
      "type": 3,
      "path": "230000,230300,230307",
      "parentCode": "230300"
},
{
      "code": "230321",
      "name": "鸡东县",
      "type": 3,
      "path": "230000,230300,230321",
      "parentCode": "230300"
},
{
      "code": "230381",
      "name": "虎林市",
      "type": 3,
      "path": "230000,230300,230381",
      "parentCode": "230300"
},
{
      "code": "230382",
      "name": "密山市",
      "type": 3,
      "path": "230000,230300,230382",
      "parentCode": "230300"
},
{
      "code": "230400",
      "name": "鹤岗市",
      "type": 2,
      "path": "230000,230400",
      "parentCode": "230000"
},
{
      "code": "230402",
      "name": "向阳区",
      "type": 3,
      "path": "230000,230400,230402",
      "parentCode": "230400"
},
{
      "code": "230403",
      "name": "工农区",
      "type": 3,
      "path": "230000,230400,230403",
      "parentCode": "230400"
},
{
      "code": "230404",
      "name": "南山区",
      "type": 3,
      "path": "230000,230400,230404",
      "parentCode": "230400"
},
{
      "code": "230405",
      "name": "兴安区",
      "type": 3,
      "path": "230000,230400,230405",
      "parentCode": "230400"
},
{
      "code": "230406",
      "name": "东山区",
      "type": 3,
      "path": "230000,230400,230406",
      "parentCode": "230400"
},
{
      "code": "230407",
      "name": "兴山区",
      "type": 3,
      "path": "230000,230400,230407",
      "parentCode": "230400"
},
{
      "code": "230421",
      "name": "萝北县",
      "type": 3,
      "path": "230000,230400,230421",
      "parentCode": "230400"
},
{
      "code": "230422",
      "name": "绥滨县",
      "type": 3,
      "path": "230000,230400,230422",
      "parentCode": "230400"
},
{
      "code": "230500",
      "name": "双鸭山市",
      "type": 2,
      "path": "230000,230500",
      "parentCode": "230000"
},
{
      "code": "230502",
      "name": "尖山区",
      "type": 3,
      "path": "230000,230500,230502",
      "parentCode": "230500"
},
{
      "code": "230503",
      "name": "岭东区",
      "type": 3,
      "path": "230000,230500,230503",
      "parentCode": "230500"
},
{
      "code": "230505",
      "name": "四方台区",
      "type": 3,
      "path": "230000,230500,230505",
      "parentCode": "230500"
},
{
      "code": "230506",
      "name": "宝山区",
      "type": 3,
      "path": "230000,230500,230506",
      "parentCode": "230500"
},
{
      "code": "230521",
      "name": "集贤县",
      "type": 3,
      "path": "230000,230500,230521",
      "parentCode": "230500"
},
{
      "code": "230522",
      "name": "友谊县",
      "type": 3,
      "path": "230000,230500,230522",
      "parentCode": "230500"
},
{
      "code": "230523",
      "name": "宝清县",
      "type": 3,
      "path": "230000,230500,230523",
      "parentCode": "230500"
},
{
      "code": "230524",
      "name": "饶河县",
      "type": 3,
      "path": "230000,230500,230524",
      "parentCode": "230500"
},
{
      "code": "230600",
      "name": "大庆市",
      "type": 2,
      "path": "230000,230600",
      "parentCode": "230000"
},
{
      "code": "230602",
      "name": "萨尔图区",
      "type": 3,
      "path": "230000,230600,230602",
      "parentCode": "230600"
},
{
      "code": "230603",
      "name": "龙凤区",
      "type": 3,
      "path": "230000,230600,230603",
      "parentCode": "230600"
},
{
      "code": "230604",
      "name": "让胡路区",
      "type": 3,
      "path": "230000,230600,230604",
      "parentCode": "230600"
},
{
      "code": "230605",
      "name": "红岗区",
      "type": 3,
      "path": "230000,230600,230605",
      "parentCode": "230600"
},
{
      "code": "230606",
      "name": "大同区",
      "type": 3,
      "path": "230000,230600,230606",
      "parentCode": "230600"
},
{
      "code": "230621",
      "name": "肇州县",
      "type": 3,
      "path": "230000,230600,230621",
      "parentCode": "230600"
},
{
      "code": "230622",
      "name": "肇源县",
      "type": 3,
      "path": "230000,230600,230622",
      "parentCode": "230600"
},
{
      "code": "230623",
      "name": "林甸县",
      "type": 3,
      "path": "230000,230600,230623",
      "parentCode": "230600"
},
{
      "code": "230624",
      "name": "杜尔伯特蒙古族自治县",
      "type": 3,
      "path": "230000,230600,230624",
      "parentCode": "230600"
},
{
      "code": "230700",
      "name": "伊春市",
      "type": 2,
      "path": "230000,230700",
      "parentCode": "230000"
},
{
      "code": "230702",
      "name": "伊春区",
      "type": 3,
      "path": "230000,230700,230702",
      "parentCode": "230700"
},
{
      "code": "230703",
      "name": "南岔区",
      "type": 3,
      "path": "230000,230700,230703",
      "parentCode": "230700"
},
{
      "code": "230704",
      "name": "友好区",
      "type": 3,
      "path": "230000,230700,230704",
      "parentCode": "230700"
},
{
      "code": "230705",
      "name": "西林区",
      "type": 3,
      "path": "230000,230700,230705",
      "parentCode": "230700"
},
{
      "code": "230706",
      "name": "翠峦区",
      "type": 3,
      "path": "230000,230700,230706",
      "parentCode": "230700"
},
{
      "code": "230707",
      "name": "新青区",
      "type": 3,
      "path": "230000,230700,230707",
      "parentCode": "230700"
},
{
      "code": "230708",
      "name": "美溪区",
      "type": 3,
      "path": "230000,230700,230708",
      "parentCode": "230700"
},
{
      "code": "230709",
      "name": "金山屯区",
      "type": 3,
      "path": "230000,230700,230709",
      "parentCode": "230700"
},
{
      "code": "230710",
      "name": "五营区",
      "type": 3,
      "path": "230000,230700,230710",
      "parentCode": "230700"
},
{
      "code": "230711",
      "name": "乌马河区",
      "type": 3,
      "path": "230000,230700,230711",
      "parentCode": "230700"
},
{
      "code": "230712",
      "name": "汤旺河区",
      "type": 3,
      "path": "230000,230700,230712",
      "parentCode": "230700"
},
{
      "code": "230713",
      "name": "带岭区",
      "type": 3,
      "path": "230000,230700,230713",
      "parentCode": "230700"
},
{
      "code": "230714",
      "name": "乌伊岭区",
      "type": 3,
      "path": "230000,230700,230714",
      "parentCode": "230700"
},
{
      "code": "230715",
      "name": "红星区",
      "type": 3,
      "path": "230000,230700,230715",
      "parentCode": "230700"
},
{
      "code": "230716",
      "name": "上甘岭区",
      "type": 3,
      "path": "230000,230700,230716",
      "parentCode": "230700"
},
{
      "code": "230722",
      "name": "嘉荫县",
      "type": 3,
      "path": "230000,230700,230722",
      "parentCode": "230700"
},
{
      "code": "230781",
      "name": "铁力市",
      "type": 3,
      "path": "230000,230700,230781",
      "parentCode": "230700"
},
{
      "code": "230800",
      "name": "佳木斯市",
      "type": 2,
      "path": "230000,230800",
      "parentCode": "230000"
},
{
      "code": "230803",
      "name": "向阳区",
      "type": 3,
      "path": "230000,230800,230803",
      "parentCode": "230800"
},
{
      "code": "230804",
      "name": "前进区",
      "type": 3,
      "path": "230000,230800,230804",
      "parentCode": "230800"
},
{
      "code": "230805",
      "name": "东风区",
      "type": 3,
      "path": "230000,230800,230805",
      "parentCode": "230800"
},
{
      "code": "230811",
      "name": "郊区",
      "type": 3,
      "path": "230000,230800,230811",
      "parentCode": "230800"
},
{
      "code": "230822",
      "name": "桦南县",
      "type": 3,
      "path": "230000,230800,230822",
      "parentCode": "230800"
},
{
      "code": "230826",
      "name": "桦川县",
      "type": 3,
      "path": "230000,230800,230826",
      "parentCode": "230800"
},
{
      "code": "230828",
      "name": "汤原县",
      "type": 3,
      "path": "230000,230800,230828",
      "parentCode": "230800"
},
{
      "code": "230833",
      "name": "抚远县",
      "type": 3,
      "path": "230000,230800,230833",
      "parentCode": "230800"
},
{
      "code": "230881",
      "name": "同江市",
      "type": 3,
      "path": "230000,230800,230881",
      "parentCode": "230800"
},
{
      "code": "230882",
      "name": "富锦市",
      "type": 3,
      "path": "230000,230800,230882",
      "parentCode": "230800"
},
{
      "code": "230900",
      "name": "七台河市",
      "type": 2,
      "path": "230000,230900",
      "parentCode": "230000"
},
{
      "code": "230902",
      "name": "新兴区",
      "type": 3,
      "path": "230000,230900,230902",
      "parentCode": "230900"
},
{
      "code": "230903",
      "name": "桃山区",
      "type": 3,
      "path": "230000,230900,230903",
      "parentCode": "230900"
},
{
      "code": "230904",
      "name": "茄子河区",
      "type": 3,
      "path": "230000,230900,230904",
      "parentCode": "230900"
},
{
      "code": "230921",
      "name": "勃利县",
      "type": 3,
      "path": "230000,230900,230921",
      "parentCode": "230900"
},
{
      "code": "231000",
      "name": "牡丹江市",
      "type": 2,
      "path": "230000,231000",
      "parentCode": "230000"
},
{
      "code": "231002",
      "name": "东安区",
      "type": 3,
      "path": "230000,231000,231002",
      "parentCode": "231000"
},
{
      "code": "231003",
      "name": "阳明区",
      "type": 3,
      "path": "230000,231000,231003",
      "parentCode": "231000"
},
{
      "code": "231004",
      "name": "爱民区",
      "type": 3,
      "path": "230000,231000,231004",
      "parentCode": "231000"
},
{
      "code": "231005",
      "name": "西安区",
      "type": 3,
      "path": "230000,231000,231005",
      "parentCode": "231000"
},
{
      "code": "231024",
      "name": "东宁县",
      "type": 3,
      "path": "230000,231000,231024",
      "parentCode": "231000"
},
{
      "code": "231025",
      "name": "林口县",
      "type": 3,
      "path": "230000,231000,231025",
      "parentCode": "231000"
},
{
      "code": "231081",
      "name": "绥芬河市",
      "type": 3,
      "path": "230000,231000,231081",
      "parentCode": "231000"
},
{
      "code": "231083",
      "name": "海林市",
      "type": 3,
      "path": "230000,231000,231083",
      "parentCode": "231000"
},
{
      "code": "231084",
      "name": "宁安市",
      "type": 3,
      "path": "230000,231000,231084",
      "parentCode": "231000"
},
{
      "code": "231085",
      "name": "穆棱市",
      "type": 3,
      "path": "230000,231000,231085",
      "parentCode": "231000"
},
{
      "code": "231100",
      "name": "黑河市",
      "type": 2,
      "path": "230000,231100",
      "parentCode": "230000"
},
{
      "code": "231102",
      "name": "爱辉区",
      "type": 3,
      "path": "230000,231100,231102",
      "parentCode": "231100"
},
{
      "code": "231121",
      "name": "嫩江县",
      "type": 3,
      "path": "230000,231100,231121",
      "parentCode": "231100"
},
{
      "code": "231123",
      "name": "逊克县",
      "type": 3,
      "path": "230000,231100,231123",
      "parentCode": "231100"
},
{
      "code": "231124",
      "name": "孙吴县",
      "type": 3,
      "path": "230000,231100,231124",
      "parentCode": "231100"
},
{
      "code": "231181",
      "name": "北安市",
      "type": 3,
      "path": "230000,231100,231181",
      "parentCode": "231100"
},
{
      "code": "231182",
      "name": "五大连池市",
      "type": 3,
      "path": "230000,231100,231182",
      "parentCode": "231100"
},
{
      "code": "231200",
      "name": "绥化市",
      "type": 2,
      "path": "230000,231200",
      "parentCode": "230000"
},
{
      "code": "231202",
      "name": "北林区",
      "type": 3,
      "path": "230000,231200,231202",
      "parentCode": "231200"
},
{
      "code": "231221",
      "name": "望奎县",
      "type": 3,
      "path": "230000,231200,231221",
      "parentCode": "231200"
},
{
      "code": "231222",
      "name": "兰西县",
      "type": 3,
      "path": "230000,231200,231222",
      "parentCode": "231200"
},
{
      "code": "231223",
      "name": "青冈县",
      "type": 3,
      "path": "230000,231200,231223",
      "parentCode": "231200"
},
{
      "code": "231224",
      "name": "庆安县",
      "type": 3,
      "path": "230000,231200,231224",
      "parentCode": "231200"
},
{
      "code": "231225",
      "name": "明水县",
      "type": 3,
      "path": "230000,231200,231225",
      "parentCode": "231200"
},
{
      "code": "231226",
      "name": "绥棱县",
      "type": 3,
      "path": "230000,231200,231226",
      "parentCode": "231200"
},
{
      "code": "231281",
      "name": "安达市",
      "type": 3,
      "path": "230000,231200,231281",
      "parentCode": "231200"
},
{
      "code": "231282",
      "name": "肇东市",
      "type": 3,
      "path": "230000,231200,231282",
      "parentCode": "231200"
},
{
      "code": "231283",
      "name": "海伦市",
      "type": 3,
      "path": "230000,231200,231283",
      "parentCode": "231200"
},
{
      "code": "232700",
      "name": "大兴安岭地区",
      "type": 2,
      "path": "230000,232700",
      "parentCode": "230000"
},
{
      "code": "232721",
      "name": "呼玛县",
      "type": 3,
      "path": "230000,232700,232721",
      "parentCode": "232700"
},
{
      "code": "232722",
      "name": "塔河县",
      "type": 3,
      "path": "230000,232700,232722",
      "parentCode": "232700"
},
{
      "code": "232723",
      "name": "漠河县",
      "type": 3,
      "path": "230000,232700,232723",
      "parentCode": "232700"
},
{
      "code": "310000",
      "name": "上海市",
      "type": 1,
      "path": "310000",
      "parentCode": null
},
{
      "code": "310100",
      "name": "上海市",
      "type": 2,
      "path": "310000,310100",
      "parentCode": "310000"
},
{
      "code": "310101",
      "name": "黄浦区",
      "type": 3,
      "path": "310000,310100,310101",
      "parentCode": "310100"
},
{
      "code": "310104",
      "name": "徐汇区",
      "type": 3,
      "path": "310000,310100,310104",
      "parentCode": "310100"
},
{
      "code": "310105",
      "name": "长宁区",
      "type": 3,
      "path": "310000,310100,310105",
      "parentCode": "310100"
},
{
      "code": "310106",
      "name": "静安区",
      "type": 3,
      "path": "310000,310100,310106",
      "parentCode": "310100"
},
{
      "code": "310107",
      "name": "普陀区",
      "type": 3,
      "path": "310000,310100,310107",
      "parentCode": "310100"
},
{
      "code": "310108",
      "name": "闸北区",
      "type": 3,
      "path": "310000,310100,310108",
      "parentCode": "310100"
},
{
      "code": "310109",
      "name": "虹口区",
      "type": 3,
      "path": "310000,310100,310109",
      "parentCode": "310100"
},
{
      "code": "310110",
      "name": "杨浦区",
      "type": 3,
      "path": "310000,310100,310110",
      "parentCode": "310100"
},
{
      "code": "310112",
      "name": "闵行区",
      "type": 3,
      "path": "310000,310100,310112",
      "parentCode": "310100"
},
{
      "code": "310113",
      "name": "宝山区",
      "type": 3,
      "path": "310000,310100,310113",
      "parentCode": "310100"
},
{
      "code": "310114",
      "name": "嘉定区",
      "type": 3,
      "path": "310000,310100,310114",
      "parentCode": "310100"
},
{
      "code": "310115",
      "name": "浦东新区",
      "type": 3,
      "path": "310000,310100,310115",
      "parentCode": "310100"
},
{
      "code": "310116",
      "name": "金山区",
      "type": 3,
      "path": "310000,310100,310116",
      "parentCode": "310100"
},
{
      "code": "310117",
      "name": "松江区",
      "type": 3,
      "path": "310000,310100,310117",
      "parentCode": "310100"
},
{
      "code": "310118",
      "name": "青浦区",
      "type": 3,
      "path": "310000,310100,310118",
      "parentCode": "310100"
},
{
      "code": "310120",
      "name": "奉贤区",
      "type": 3,
      "path": "310000,310100,310120",
      "parentCode": "310100"
},
{
      "code": "310200",
      "name": "上海市辖县",
      "type": 2,
      "path": "310000,310200",
      "parentCode": "310000"
},
{
      "code": "310230",
      "name": "崇明县",
      "type": 3,
      "path": "310000,310200,310230",
      "parentCode": "310200"
},
{
      "code": "320000",
      "name": "江苏省",
      "type": 1,
      "path": "320000",
      "parentCode": null
},
{
      "code": "320100",
      "name": "南京市",
      "type": 2,
      "path": "320000,320100",
      "parentCode": "320000"
},
{
      "code": "320102",
      "name": "玄武区",
      "type": 3,
      "path": "320000,320100,320102",
      "parentCode": "320100"
},
{
      "code": "320104",
      "name": "秦淮区",
      "type": 3,
      "path": "320000,320100,320104",
      "parentCode": "320100"
},
{
      "code": "320105",
      "name": "建邺区",
      "type": 3,
      "path": "320000,320100,320105",
      "parentCode": "320100"
},
{
      "code": "320106",
      "name": "鼓楼区",
      "type": 3,
      "path": "320000,320100,320106",
      "parentCode": "320100"
},
{
      "code": "320111",
      "name": "浦口区",
      "type": 3,
      "path": "320000,320100,320111",
      "parentCode": "320100"
},
{
      "code": "320113",
      "name": "栖霞区",
      "type": 3,
      "path": "320000,320100,320113",
      "parentCode": "320100"
},
{
      "code": "320114",
      "name": "雨花台区",
      "type": 3,
      "path": "320000,320100,320114",
      "parentCode": "320100"
},
{
      "code": "320115",
      "name": "江宁区",
      "type": 3,
      "path": "320000,320100,320115",
      "parentCode": "320100"
},
{
      "code": "320116",
      "name": "六合区",
      "type": 3,
      "path": "320000,320100,320116",
      "parentCode": "320100"
},
{
      "code": "320117",
      "name": "溧水区",
      "type": 3,
      "path": "320000,320100,320117",
      "parentCode": "320100"
},
{
      "code": "320118",
      "name": "高淳区",
      "type": 3,
      "path": "320000,320100,320118",
      "parentCode": "320100"
},
{
      "code": "320200",
      "name": "无锡市",
      "type": 2,
      "path": "320000,320200",
      "parentCode": "320000"
},
{
      "code": "320202",
      "name": "崇安区",
      "type": 3,
      "path": "320000,320200,320202",
      "parentCode": "320200"
},
{
      "code": "320203",
      "name": "南长区",
      "type": 3,
      "path": "320000,320200,320203",
      "parentCode": "320200"
},
{
      "code": "320204",
      "name": "北塘区",
      "type": 3,
      "path": "320000,320200,320204",
      "parentCode": "320200"
},
{
      "code": "320205",
      "name": "锡山区",
      "type": 3,
      "path": "320000,320200,320205",
      "parentCode": "320200"
},
{
      "code": "320206",
      "name": "惠山区",
      "type": 3,
      "path": "320000,320200,320206",
      "parentCode": "320200"
},
{
      "code": "320211",
      "name": "滨湖区",
      "type": 3,
      "path": "320000,320200,320211",
      "parentCode": "320200"
},
{
      "code": "320281",
      "name": "江阴市",
      "type": 3,
      "path": "320000,320200,320281",
      "parentCode": "320200"
},
{
      "code": "320282",
      "name": "宜兴市",
      "type": 3,
      "path": "320000,320200,320282",
      "parentCode": "320200"
},
{
      "code": "320300",
      "name": "徐州市",
      "type": 2,
      "path": "320000,320300",
      "parentCode": "320000"
},
{
      "code": "320302",
      "name": "鼓楼区",
      "type": 3,
      "path": "320000,320300,320302",
      "parentCode": "320300"
},
{
      "code": "320303",
      "name": "云龙区",
      "type": 3,
      "path": "320000,320300,320303",
      "parentCode": "320300"
},
{
      "code": "320305",
      "name": "贾汪区",
      "type": 3,
      "path": "320000,320300,320305",
      "parentCode": "320300"
},
{
      "code": "320311",
      "name": "泉山区",
      "type": 3,
      "path": "320000,320300,320311",
      "parentCode": "320300"
},
{
      "code": "320312",
      "name": "铜山区",
      "type": 3,
      "path": "320000,320300,320312",
      "parentCode": "320300"
},
{
      "code": "320321",
      "name": "丰县",
      "type": 3,
      "path": "320000,320300,320321",
      "parentCode": "320300"
},
{
      "code": "320322",
      "name": "沛县",
      "type": 3,
      "path": "320000,320300,320322",
      "parentCode": "320300"
},
{
      "code": "320324",
      "name": "睢宁县",
      "type": 3,
      "path": "320000,320300,320324",
      "parentCode": "320300"
},
{
      "code": "320381",
      "name": "新沂市",
      "type": 3,
      "path": "320000,320300,320381",
      "parentCode": "320300"
},
{
      "code": "320382",
      "name": "邳州市",
      "type": 3,
      "path": "320000,320300,320382",
      "parentCode": "320300"
},
{
      "code": "320400",
      "name": "常州市",
      "type": 2,
      "path": "320000,320400",
      "parentCode": "320000"
},
{
      "code": "320402",
      "name": "天宁区",
      "type": 3,
      "path": "320000,320400,320402",
      "parentCode": "320400"
},
{
      "code": "320404",
      "name": "钟楼区",
      "type": 3,
      "path": "320000,320400,320404",
      "parentCode": "320400"
},
{
      "code": "320405",
      "name": "戚墅堰区",
      "type": 3,
      "path": "320000,320400,320405",
      "parentCode": "320400"
},
{
      "code": "320411",
      "name": "新北区",
      "type": 3,
      "path": "320000,320400,320411",
      "parentCode": "320400"
},
{
      "code": "320412",
      "name": "武进区",
      "type": 3,
      "path": "320000,320400,320412",
      "parentCode": "320400"
},
{
      "code": "320481",
      "name": "溧阳市",
      "type": 3,
      "path": "320000,320400,320481",
      "parentCode": "320400"
},
{
      "code": "320482",
      "name": "金坛市",
      "type": 3,
      "path": "320000,320400,320482",
      "parentCode": "320400"
},
{
      "code": "320500",
      "name": "苏州市",
      "type": 2,
      "path": "320000,320500",
      "parentCode": "320000"
},
{
      "code": "320505",
      "name": "虎丘区",
      "type": 3,
      "path": "320000,320500,320505",
      "parentCode": "320500"
},
{
      "code": "320506",
      "name": "吴中区",
      "type": 3,
      "path": "320000,320500,320506",
      "parentCode": "320500"
},
{
      "code": "320507",
      "name": "相城区",
      "type": 3,
      "path": "320000,320500,320507",
      "parentCode": "320500"
},
{
      "code": "320508",
      "name": "姑苏区",
      "type": 3,
      "path": "320000,320500,320508",
      "parentCode": "320500"
},
{
      "code": "320509",
      "name": "吴江区",
      "type": 3,
      "path": "320000,320500,320509",
      "parentCode": "320500"
},
{
      "code": "320581",
      "name": "常熟市",
      "type": 3,
      "path": "320000,320500,320581",
      "parentCode": "320500"
},
{
      "code": "320582",
      "name": "张家港市",
      "type": 3,
      "path": "320000,320500,320582",
      "parentCode": "320500"
},
{
      "code": "320583",
      "name": "昆山市",
      "type": 3,
      "path": "320000,320500,320583",
      "parentCode": "320500"
},
{
      "code": "320585",
      "name": "太仓市",
      "type": 3,
      "path": "320000,320500,320585",
      "parentCode": "320500"
},
{
      "code": "320600",
      "name": "南通市",
      "type": 2,
      "path": "320000,320600",
      "parentCode": "320000"
},
{
      "code": "320602",
      "name": "崇川区",
      "type": 3,
      "path": "320000,320600,320602",
      "parentCode": "320600"
},
{
      "code": "320611",
      "name": "港闸区",
      "type": 3,
      "path": "320000,320600,320611",
      "parentCode": "320600"
},
{
      "code": "320612",
      "name": "通州区",
      "type": 3,
      "path": "320000,320600,320612",
      "parentCode": "320600"
},
{
      "code": "320621",
      "name": "海安县",
      "type": 3,
      "path": "320000,320600,320621",
      "parentCode": "320600"
},
{
      "code": "320623",
      "name": "如东县",
      "type": 3,
      "path": "320000,320600,320623",
      "parentCode": "320600"
},
{
      "code": "320681",
      "name": "启东市",
      "type": 3,
      "path": "320000,320600,320681",
      "parentCode": "320600"
},
{
      "code": "320682",
      "name": "如皋市",
      "type": 3,
      "path": "320000,320600,320682",
      "parentCode": "320600"
},
{
      "code": "320684",
      "name": "海门市",
      "type": 3,
      "path": "320000,320600,320684",
      "parentCode": "320600"
},
{
      "code": "320700",
      "name": "连云港市",
      "type": 2,
      "path": "320000,320700",
      "parentCode": "320000"
},
{
      "code": "320703",
      "name": "连云区",
      "type": 3,
      "path": "320000,320700,320703",
      "parentCode": "320700"
},
{
      "code": "320705",
      "name": "新浦",
      "type": 3,
      "path": "320000,320700,320705",
      "parentCode": "320700"
},
{
      "code": "320706",
      "name": "海州区",
      "type": 3,
      "path": "320000,320700,320706",
      "parentCode": "320700"
},
{
      "code": "320707",
      "name": "赣榆区",
      "type": 3,
      "path": "320000,320700,320707",
      "parentCode": "320700"
},
{
      "code": "320722",
      "name": "东海县",
      "type": 3,
      "path": "320000,320700,320722",
      "parentCode": "320700"
},
{
      "code": "320723",
      "name": "灌云县",
      "type": 3,
      "path": "320000,320700,320723",
      "parentCode": "320700"
},
{
      "code": "320724",
      "name": "灌南县",
      "type": 3,
      "path": "320000,320700,320724",
      "parentCode": "320700"
},
{
      "code": "320800",
      "name": "淮安市",
      "type": 2,
      "path": "320000,320800",
      "parentCode": "320000"
},
{
      "code": "320802",
      "name": "清河区",
      "type": 3,
      "path": "320000,320800,320802",
      "parentCode": "320800"
},
{
      "code": "320803",
      "name": "淮安区",
      "type": 3,
      "path": "320000,320800,320803",
      "parentCode": "320800"
},
{
      "code": "320804",
      "name": "淮阴区",
      "type": 3,
      "path": "320000,320800,320804",
      "parentCode": "320800"
},
{
      "code": "320811",
      "name": "清浦区",
      "type": 3,
      "path": "320000,320800,320811",
      "parentCode": "320800"
},
{
      "code": "320826",
      "name": "涟水县",
      "type": 3,
      "path": "320000,320800,320826",
      "parentCode": "320800"
},
{
      "code": "320829",
      "name": "洪泽县",
      "type": 3,
      "path": "320000,320800,320829",
      "parentCode": "320800"
},
{
      "code": "320830",
      "name": "盱眙县",
      "type": 3,
      "path": "320000,320800,320830",
      "parentCode": "320800"
},
{
      "code": "320831",
      "name": "金湖县",
      "type": 3,
      "path": "320000,320800,320831",
      "parentCode": "320800"
},
{
      "code": "320900",
      "name": "盐城市",
      "type": 2,
      "path": "320000,320900",
      "parentCode": "320000"
},
{
      "code": "320902",
      "name": "亭湖区",
      "type": 3,
      "path": "320000,320900,320902",
      "parentCode": "320900"
},
{
      "code": "320903",
      "name": "盐都区",
      "type": 3,
      "path": "320000,320900,320903",
      "parentCode": "320900"
},
{
      "code": "320921",
      "name": "响水县",
      "type": 3,
      "path": "320000,320900,320921",
      "parentCode": "320900"
},
{
      "code": "320922",
      "name": "滨海县",
      "type": 3,
      "path": "320000,320900,320922",
      "parentCode": "320900"
},
{
      "code": "320923",
      "name": "阜宁县",
      "type": 3,
      "path": "320000,320900,320923",
      "parentCode": "320900"
},
{
      "code": "320924",
      "name": "射阳县",
      "type": 3,
      "path": "320000,320900,320924",
      "parentCode": "320900"
},
{
      "code": "320925",
      "name": "建湖县",
      "type": 3,
      "path": "320000,320900,320925",
      "parentCode": "320900"
},
{
      "code": "320981",
      "name": "东台市",
      "type": 3,
      "path": "320000,320900,320981",
      "parentCode": "320900"
},
{
      "code": "320982",
      "name": "大丰市",
      "type": 3,
      "path": "320000,320900,320982",
      "parentCode": "320900"
},
{
      "code": "321000",
      "name": "扬州市",
      "type": 2,
      "path": "320000,321000",
      "parentCode": "320000"
},
{
      "code": "321002",
      "name": "广陵区",
      "type": 3,
      "path": "320000,321000,321002",
      "parentCode": "321000"
},
{
      "code": "321003",
      "name": "邗江区",
      "type": 3,
      "path": "320000,321000,321003",
      "parentCode": "321000"
},
{
      "code": "321012",
      "name": "江都区",
      "type": 3,
      "path": "320000,321000,321012",
      "parentCode": "321000"
},
{
      "code": "321023",
      "name": "宝应县",
      "type": 3,
      "path": "320000,321000,321023",
      "parentCode": "321000"
},
{
      "code": "321081",
      "name": "仪征市",
      "type": 3,
      "path": "320000,321000,321081",
      "parentCode": "321000"
},
{
      "code": "321084",
      "name": "高邮市",
      "type": 3,
      "path": "320000,321000,321084",
      "parentCode": "321000"
},
{
      "code": "321100",
      "name": "镇江市",
      "type": 2,
      "path": "320000,321100",
      "parentCode": "320000"
},
{
      "code": "321102",
      "name": "京口区",
      "type": 3,
      "path": "320000,321100,321102",
      "parentCode": "321100"
},
{
      "code": "321111",
      "name": "润州区",
      "type": 3,
      "path": "320000,321100,321111",
      "parentCode": "321100"
},
{
      "code": "321112",
      "name": "丹徒区",
      "type": 3,
      "path": "320000,321100,321112",
      "parentCode": "321100"
},
{
      "code": "321181",
      "name": "丹阳市",
      "type": 3,
      "path": "320000,321100,321181",
      "parentCode": "321100"
},
{
      "code": "321182",
      "name": "扬中市",
      "type": 3,
      "path": "320000,321100,321182",
      "parentCode": "321100"
},
{
      "code": "321183",
      "name": "句容市",
      "type": 3,
      "path": "320000,321100,321183",
      "parentCode": "321100"
},
{
      "code": "321200",
      "name": "泰州市",
      "type": 2,
      "path": "320000,321200",
      "parentCode": "320000"
},
{
      "code": "321202",
      "name": "海陵区",
      "type": 3,
      "path": "320000,321200,321202",
      "parentCode": "321200"
},
{
      "code": "321203",
      "name": "高港区",
      "type": 3,
      "path": "320000,321200,321203",
      "parentCode": "321200"
},
{
      "code": "321204",
      "name": "姜堰区",
      "type": 3,
      "path": "320000,321200,321204",
      "parentCode": "321200"
},
{
      "code": "321281",
      "name": "兴化市",
      "type": 3,
      "path": "320000,321200,321281",
      "parentCode": "321200"
},
{
      "code": "321282",
      "name": "靖江市",
      "type": 3,
      "path": "320000,321200,321282",
      "parentCode": "321200"
},
{
      "code": "321283",
      "name": "泰兴市",
      "type": 3,
      "path": "320000,321200,321283",
      "parentCode": "321200"
},
{
      "code": "321300",
      "name": "宿迁市",
      "type": 2,
      "path": "320000,321300",
      "parentCode": "320000"
},
{
      "code": "321302",
      "name": "宿城区",
      "type": 3,
      "path": "320000,321300,321302",
      "parentCode": "321300"
},
{
      "code": "321311",
      "name": "宿豫区",
      "type": 3,
      "path": "320000,321300,321311",
      "parentCode": "321300"
},
{
      "code": "321322",
      "name": "沭阳县",
      "type": 3,
      "path": "320000,321300,321322",
      "parentCode": "321300"
},
{
      "code": "321323",
      "name": "泗阳县",
      "type": 3,
      "path": "320000,321300,321323",
      "parentCode": "321300"
},
{
      "code": "321324",
      "name": "泗洪县",
      "type": 3,
      "path": "320000,321300,321324",
      "parentCode": "321300"
},
{
      "code": "330000",
      "name": "浙江省",
      "type": 1,
      "path": "330000",
      "parentCode": null
},
{
      "code": "330100",
      "name": "杭州市",
      "type": 2,
      "path": "330000,330100",
      "parentCode": "330000"
},
{
      "code": "330102",
      "name": "上城区",
      "type": 3,
      "path": "330000,330100,330102",
      "parentCode": "330100"
},
{
      "code": "330103",
      "name": "下城区",
      "type": 3,
      "path": "330000,330100,330103",
      "parentCode": "330100"
},
{
      "code": "330104",
      "name": "江干区",
      "type": 3,
      "path": "330000,330100,330104",
      "parentCode": "330100"
},
{
      "code": "330105",
      "name": "拱墅区",
      "type": 3,
      "path": "330000,330100,330105",
      "parentCode": "330100"
},
{
      "code": "330106",
      "name": "西湖区",
      "type": 3,
      "path": "330000,330100,330106",
      "parentCode": "330100"
},
{
      "code": "330108",
      "name": "滨江区",
      "type": 3,
      "path": "330000,330100,330108",
      "parentCode": "330100"
},
{
      "code": "330109",
      "name": "萧山区",
      "type": 3,
      "path": "330000,330100,330109",
      "parentCode": "330100"
},
{
      "code": "330110",
      "name": "余杭区",
      "type": 3,
      "path": "330000,330100,330110",
      "parentCode": "330100"
},
{
      "code": "330122",
      "name": "桐庐县",
      "type": 3,
      "path": "330000,330100,330122",
      "parentCode": "330100"
},
{
      "code": "330127",
      "name": "淳安县",
      "type": 3,
      "path": "330000,330100,330127",
      "parentCode": "330100"
},
{
      "code": "330182",
      "name": "建德市",
      "type": 3,
      "path": "330000,330100,330182",
      "parentCode": "330100"
},
{
      "code": "330183",
      "name": "富阳市",
      "type": 3,
      "path": "330000,330100,330183",
      "parentCode": "330100"
},
{
      "code": "330185",
      "name": "临安市",
      "type": 3,
      "path": "330000,330100,330185",
      "parentCode": "330100"
},
{
      "code": "330200",
      "name": "宁波市",
      "type": 2,
      "path": "330000,330200",
      "parentCode": "330000"
},
{
      "code": "330203",
      "name": "海曙区",
      "type": 3,
      "path": "330000,330200,330203",
      "parentCode": "330200"
},
{
      "code": "330204",
      "name": "江东区",
      "type": 3,
      "path": "330000,330200,330204",
      "parentCode": "330200"
},
{
      "code": "330205",
      "name": "江北区",
      "type": 3,
      "path": "330000,330200,330205",
      "parentCode": "330200"
},
{
      "code": "330206",
      "name": "北仑区",
      "type": 3,
      "path": "330000,330200,330206",
      "parentCode": "330200"
},
{
      "code": "330211",
      "name": "镇海区",
      "type": 3,
      "path": "330000,330200,330211",
      "parentCode": "330200"
},
{
      "code": "330212",
      "name": "鄞州区",
      "type": 3,
      "path": "330000,330200,330212",
      "parentCode": "330200"
},
{
      "code": "330225",
      "name": "象山县",
      "type": 3,
      "path": "330000,330200,330225",
      "parentCode": "330200"
},
{
      "code": "330226",
      "name": "宁海县",
      "type": 3,
      "path": "330000,330200,330226",
      "parentCode": "330200"
},
{
      "code": "330281",
      "name": "余姚市",
      "type": 3,
      "path": "330000,330200,330281",
      "parentCode": "330200"
},
{
      "code": "330282",
      "name": "慈溪市",
      "type": 3,
      "path": "330000,330200,330282",
      "parentCode": "330200"
},
{
      "code": "330283",
      "name": "奉化市",
      "type": 3,
      "path": "330000,330200,330283",
      "parentCode": "330200"
},
{
      "code": "330300",
      "name": "温州市",
      "type": 2,
      "path": "330000,330300",
      "parentCode": "330000"
},
{
      "code": "330302",
      "name": "鹿城区",
      "type": 3,
      "path": "330000,330300,330302",
      "parentCode": "330300"
},
{
      "code": "330303",
      "name": "龙湾区",
      "type": 3,
      "path": "330000,330300,330303",
      "parentCode": "330300"
},
{
      "code": "330304",
      "name": "瓯海区",
      "type": 3,
      "path": "330000,330300,330304",
      "parentCode": "330300"
},
{
      "code": "330322",
      "name": "洞头县",
      "type": 3,
      "path": "330000,330300,330322",
      "parentCode": "330300"
},
{
      "code": "330324",
      "name": "永嘉县",
      "type": 3,
      "path": "330000,330300,330324",
      "parentCode": "330300"
},
{
      "code": "330326",
      "name": "平阳县",
      "type": 3,
      "path": "330000,330300,330326",
      "parentCode": "330300"
},
{
      "code": "330327",
      "name": "苍南县",
      "type": 3,
      "path": "330000,330300,330327",
      "parentCode": "330300"
},
{
      "code": "330328",
      "name": "文成县",
      "type": 3,
      "path": "330000,330300,330328",
      "parentCode": "330300"
},
{
      "code": "330329",
      "name": "泰顺县",
      "type": 3,
      "path": "330000,330300,330329",
      "parentCode": "330300"
},
{
      "code": "330381",
      "name": "瑞安市",
      "type": 3,
      "path": "330000,330300,330381",
      "parentCode": "330300"
},
{
      "code": "330382",
      "name": "乐清市",
      "type": 3,
      "path": "330000,330300,330382",
      "parentCode": "330300"
},
{
      "code": "330400",
      "name": "嘉兴市",
      "type": 2,
      "path": "330000,330400",
      "parentCode": "330000"
},
{
      "code": "330402",
      "name": "南湖区",
      "type": 3,
      "path": "330000,330400,330402",
      "parentCode": "330400"
},
{
      "code": "330411",
      "name": "秀洲区",
      "type": 3,
      "path": "330000,330400,330411",
      "parentCode": "330400"
},
{
      "code": "330421",
      "name": "嘉善县",
      "type": 3,
      "path": "330000,330400,330421",
      "parentCode": "330400"
},
{
      "code": "330424",
      "name": "海盐县",
      "type": 3,
      "path": "330000,330400,330424",
      "parentCode": "330400"
},
{
      "code": "330481",
      "name": "海宁市",
      "type": 3,
      "path": "330000,330400,330481",
      "parentCode": "330400"
},
{
      "code": "330482",
      "name": "平湖市",
      "type": 3,
      "path": "330000,330400,330482",
      "parentCode": "330400"
},
{
      "code": "330483",
      "name": "桐乡市",
      "type": 3,
      "path": "330000,330400,330483",
      "parentCode": "330400"
},
{
      "code": "330500",
      "name": "湖州市",
      "type": 2,
      "path": "330000,330500",
      "parentCode": "330000"
},
{
      "code": "330502",
      "name": "吴兴区",
      "type": 3,
      "path": "330000,330500,330502",
      "parentCode": "330500"
},
{
      "code": "330503",
      "name": "南浔区",
      "type": 3,
      "path": "330000,330500,330503",
      "parentCode": "330500"
},
{
      "code": "330521",
      "name": "德清县",
      "type": 3,
      "path": "330000,330500,330521",
      "parentCode": "330500"
},
{
      "code": "330522",
      "name": "长兴县",
      "type": 3,
      "path": "330000,330500,330522",
      "parentCode": "330500"
},
{
      "code": "330523",
      "name": "安吉县",
      "type": 3,
      "path": "330000,330500,330523",
      "parentCode": "330500"
},
{
      "code": "330600",
      "name": "绍兴市",
      "type": 2,
      "path": "330000,330600",
      "parentCode": "330000"
},
{
      "code": "330602",
      "name": "越城区",
      "type": 3,
      "path": "330000,330600,330602",
      "parentCode": "330600"
},
{
      "code": "330603",
      "name": "柯桥区",
      "type": 3,
      "path": "330000,330600,330603",
      "parentCode": "330600"
},
{
      "code": "330604",
      "name": "上虞区",
      "type": 3,
      "path": "330000,330600,330604",
      "parentCode": "330600"
},
{
      "code": "330624",
      "name": "新昌县",
      "type": 3,
      "path": "330000,330600,330624",
      "parentCode": "330600"
},
{
      "code": "330681",
      "name": "诸暨市",
      "type": 3,
      "path": "330000,330600,330681",
      "parentCode": "330600"
},
{
      "code": "330683",
      "name": "嵊州市",
      "type": 3,
      "path": "330000,330600,330683",
      "parentCode": "330600"
},
{
      "code": "330700",
      "name": "金华市",
      "type": 2,
      "path": "330000,330700",
      "parentCode": "330000"
},
{
      "code": "330702",
      "name": "婺城区",
      "type": 3,
      "path": "330000,330700,330702",
      "parentCode": "330700"
},
{
      "code": "330703",
      "name": "金东区",
      "type": 3,
      "path": "330000,330700,330703",
      "parentCode": "330700"
},
{
      "code": "330723",
      "name": "武义县",
      "type": 3,
      "path": "330000,330700,330723",
      "parentCode": "330700"
},
{
      "code": "330726",
      "name": "浦江县",
      "type": 3,
      "path": "330000,330700,330726",
      "parentCode": "330700"
},
{
      "code": "330727",
      "name": "磐安县",
      "type": 3,
      "path": "330000,330700,330727",
      "parentCode": "330700"
},
{
      "code": "330781",
      "name": "兰溪市",
      "type": 3,
      "path": "330000,330700,330781",
      "parentCode": "330700"
},
{
      "code": "330782",
      "name": "义乌市",
      "type": 3,
      "path": "330000,330700,330782",
      "parentCode": "330700"
},
{
      "code": "330783",
      "name": "东阳市",
      "type": 3,
      "path": "330000,330700,330783",
      "parentCode": "330700"
},
{
      "code": "330784",
      "name": "永康市",
      "type": 3,
      "path": "330000,330700,330784",
      "parentCode": "330700"
},
{
      "code": "330800",
      "name": "衢州市",
      "type": 2,
      "path": "330000,330800",
      "parentCode": "330000"
},
{
      "code": "330802",
      "name": "柯城区",
      "type": 3,
      "path": "330000,330800,330802",
      "parentCode": "330800"
},
{
      "code": "330803",
      "name": "衢江区",
      "type": 3,
      "path": "330000,330800,330803",
      "parentCode": "330800"
},
{
      "code": "330822",
      "name": "常山县",
      "type": 3,
      "path": "330000,330800,330822",
      "parentCode": "330800"
},
{
      "code": "330824",
      "name": "开化县",
      "type": 3,
      "path": "330000,330800,330824",
      "parentCode": "330800"
},
{
      "code": "330825",
      "name": "龙游县",
      "type": 3,
      "path": "330000,330800,330825",
      "parentCode": "330800"
},
{
      "code": "330881",
      "name": "江山市",
      "type": 3,
      "path": "330000,330800,330881",
      "parentCode": "330800"
},
{
      "code": "330900",
      "name": "舟山市",
      "type": 2,
      "path": "330000,330900",
      "parentCode": "330000"
},
{
      "code": "330902",
      "name": "定海区",
      "type": 3,
      "path": "330000,330900,330902",
      "parentCode": "330900"
},
{
      "code": "330903",
      "name": "普陀区",
      "type": 3,
      "path": "330000,330900,330903",
      "parentCode": "330900"
},
{
      "code": "330921",
      "name": "岱山县",
      "type": 3,
      "path": "330000,330900,330921",
      "parentCode": "330900"
},
{
      "code": "330922",
      "name": "嵊泗县",
      "type": 3,
      "path": "330000,330900,330922",
      "parentCode": "330900"
},
{
      "code": "331000",
      "name": "台州市",
      "type": 2,
      "path": "330000,331000",
      "parentCode": "330000"
},
{
      "code": "331002",
      "name": "椒江区",
      "type": 3,
      "path": "330000,331000,331002",
      "parentCode": "331000"
},
{
      "code": "331003",
      "name": "黄岩区",
      "type": 3,
      "path": "330000,331000,331003",
      "parentCode": "331000"
},
{
      "code": "331004",
      "name": "路桥区",
      "type": 3,
      "path": "330000,331000,331004",
      "parentCode": "331000"
},
{
      "code": "331021",
      "name": "玉环县",
      "type": 3,
      "path": "330000,331000,331021",
      "parentCode": "331000"
},
{
      "code": "331022",
      "name": "三门县",
      "type": 3,
      "path": "330000,331000,331022",
      "parentCode": "331000"
},
{
      "code": "331023",
      "name": "天台县",
      "type": 3,
      "path": "330000,331000,331023",
      "parentCode": "331000"
},
{
      "code": "331024",
      "name": "仙居县",
      "type": 3,
      "path": "330000,331000,331024",
      "parentCode": "331000"
},
{
      "code": "331081",
      "name": "温岭市",
      "type": 3,
      "path": "330000,331000,331081",
      "parentCode": "331000"
},
{
      "code": "331082",
      "name": "临海市",
      "type": 3,
      "path": "330000,331000,331082",
      "parentCode": "331000"
},
{
      "code": "331100",
      "name": "丽水市",
      "type": 2,
      "path": "330000,331100",
      "parentCode": "330000"
},
{
      "code": "331102",
      "name": "莲都区",
      "type": 3,
      "path": "330000,331100,331102",
      "parentCode": "331100"
},
{
      "code": "331121",
      "name": "青田县",
      "type": 3,
      "path": "330000,331100,331121",
      "parentCode": "331100"
},
{
      "code": "331122",
      "name": "缙云县",
      "type": 3,
      "path": "330000,331100,331122",
      "parentCode": "331100"
},
{
      "code": "331123",
      "name": "遂昌县",
      "type": 3,
      "path": "330000,331100,331123",
      "parentCode": "331100"
},
{
      "code": "331124",
      "name": "松阳县",
      "type": 3,
      "path": "330000,331100,331124",
      "parentCode": "331100"
},
{
      "code": "331125",
      "name": "云和县",
      "type": 3,
      "path": "330000,331100,331125",
      "parentCode": "331100"
},
{
      "code": "331126",
      "name": "庆元县",
      "type": 3,
      "path": "330000,331100,331126",
      "parentCode": "331100"
},
{
      "code": "331127",
      "name": "景宁畲族自治县",
      "type": 3,
      "path": "330000,331100,331127",
      "parentCode": "331100"
},
{
      "code": "331181",
      "name": "龙泉市",
      "type": 3,
      "path": "330000,331100,331181",
      "parentCode": "331100"
},
{
      "code": "340000",
      "name": "安徽省",
      "type": 1,
      "path": "340000",
      "parentCode": null
},
{
      "code": "340100",
      "name": "合肥市",
      "type": 2,
      "path": "340000,340100",
      "parentCode": "340000"
},
{
      "code": "340102",
      "name": "瑶海区",
      "type": 3,
      "path": "340000,340100,340102",
      "parentCode": "340100"
},
{
      "code": "340103",
      "name": "庐阳区",
      "type": 3,
      "path": "340000,340100,340103",
      "parentCode": "340100"
},
{
      "code": "340104",
      "name": "蜀山区",
      "type": 3,
      "path": "340000,340100,340104",
      "parentCode": "340100"
},
{
      "code": "340111",
      "name": "包河区",
      "type": 3,
      "path": "340000,340100,340111",
      "parentCode": "340100"
},
{
      "code": "340121",
      "name": "长丰县",
      "type": 3,
      "path": "340000,340100,340121",
      "parentCode": "340100"
},
{
      "code": "340122",
      "name": "肥东县",
      "type": 3,
      "path": "340000,340100,340122",
      "parentCode": "340100"
},
{
      "code": "340123",
      "name": "肥西县",
      "type": 3,
      "path": "340000,340100,340123",
      "parentCode": "340100"
},
{
      "code": "340124",
      "name": "庐江县",
      "type": 3,
      "path": "340000,340100,340124",
      "parentCode": "340100"
},
{
      "code": "340181",
      "name": "巢湖市",
      "type": 3,
      "path": "340000,340100,340181",
      "parentCode": "340100"
},
{
      "code": "340200",
      "name": "芜湖市",
      "type": 2,
      "path": "340000,340200",
      "parentCode": "340000"
},
{
      "code": "340202",
      "name": "镜湖区",
      "type": 3,
      "path": "340000,340200,340202",
      "parentCode": "340200"
},
{
      "code": "340203",
      "name": "弋江区",
      "type": 3,
      "path": "340000,340200,340203",
      "parentCode": "340200"
},
{
      "code": "340207",
      "name": "鸠江区",
      "type": 3,
      "path": "340000,340200,340207",
      "parentCode": "340200"
},
{
      "code": "340208",
      "name": "三山区",
      "type": 3,
      "path": "340000,340200,340208",
      "parentCode": "340200"
},
{
      "code": "340221",
      "name": "芜湖县",
      "type": 3,
      "path": "340000,340200,340221",
      "parentCode": "340200"
},
{
      "code": "340222",
      "name": "繁昌县",
      "type": 3,
      "path": "340000,340200,340222",
      "parentCode": "340200"
},
{
      "code": "340223",
      "name": "南陵县",
      "type": 3,
      "path": "340000,340200,340223",
      "parentCode": "340200"
},
{
      "code": "340225",
      "name": "无为县",
      "type": 3,
      "path": "340000,340200,340225",
      "parentCode": "340200"
},
{
      "code": "340300",
      "name": "蚌埠市",
      "type": 2,
      "path": "340000,340300",
      "parentCode": "340000"
},
{
      "code": "340302",
      "name": "龙子湖区",
      "type": 3,
      "path": "340000,340300,340302",
      "parentCode": "340300"
},
{
      "code": "340303",
      "name": "蚌山区",
      "type": 3,
      "path": "340000,340300,340303",
      "parentCode": "340300"
},
{
      "code": "340304",
      "name": "禹会区",
      "type": 3,
      "path": "340000,340300,340304",
      "parentCode": "340300"
},
{
      "code": "340311",
      "name": "淮上区",
      "type": 3,
      "path": "340000,340300,340311",
      "parentCode": "340300"
},
{
      "code": "340321",
      "name": "怀远县",
      "type": 3,
      "path": "340000,340300,340321",
      "parentCode": "340300"
},
{
      "code": "340322",
      "name": "五河县",
      "type": 3,
      "path": "340000,340300,340322",
      "parentCode": "340300"
},
{
      "code": "340323",
      "name": "固镇县",
      "type": 3,
      "path": "340000,340300,340323",
      "parentCode": "340300"
},
{
      "code": "340400",
      "name": "淮南市",
      "type": 2,
      "path": "340000,340400",
      "parentCode": "340000"
},
{
      "code": "340402",
      "name": "大通区",
      "type": 3,
      "path": "340000,340400,340402",
      "parentCode": "340400"
},
{
      "code": "340403",
      "name": "田家庵区",
      "type": 3,
      "path": "340000,340400,340403",
      "parentCode": "340400"
},
{
      "code": "340404",
      "name": "谢家集区",
      "type": 3,
      "path": "340000,340400,340404",
      "parentCode": "340400"
},
{
      "code": "340405",
      "name": "八公山区",
      "type": 3,
      "path": "340000,340400,340405",
      "parentCode": "340400"
},
{
      "code": "340406",
      "name": "潘集区",
      "type": 3,
      "path": "340000,340400,340406",
      "parentCode": "340400"
},
{
      "code": "340421",
      "name": "凤台县",
      "type": 3,
      "path": "340000,340400,340421",
      "parentCode": "340400"
},
{
      "code": "340500",
      "name": "马鞍山市",
      "type": 2,
      "path": "340000,340500",
      "parentCode": "340000"
},
{
      "code": "340503",
      "name": "花山区",
      "type": 3,
      "path": "340000,340500,340503",
      "parentCode": "340500"
},
{
      "code": "340504",
      "name": "雨山区",
      "type": 3,
      "path": "340000,340500,340504",
      "parentCode": "340500"
},
{
      "code": "340506",
      "name": "博望区",
      "type": 3,
      "path": "340000,340500,340506",
      "parentCode": "340500"
},
{
      "code": "340521",
      "name": "当涂县",
      "type": 3,
      "path": "340000,340500,340521",
      "parentCode": "340500"
},
{
      "code": "340522",
      "name": "含山县",
      "type": 3,
      "path": "340000,340500,340522",
      "parentCode": "340500"
},
{
      "code": "340523",
      "name": "和县",
      "type": 3,
      "path": "340000,340500,340523",
      "parentCode": "340500"
},
{
      "code": "340600",
      "name": "淮北市",
      "type": 2,
      "path": "340000,340600",
      "parentCode": "340000"
},
{
      "code": "340602",
      "name": "杜集区",
      "type": 3,
      "path": "340000,340600,340602",
      "parentCode": "340600"
},
{
      "code": "340603",
      "name": "相山区",
      "type": 3,
      "path": "340000,340600,340603",
      "parentCode": "340600"
},
{
      "code": "340604",
      "name": "烈山区",
      "type": 3,
      "path": "340000,340600,340604",
      "parentCode": "340600"
},
{
      "code": "340621",
      "name": "濉溪县",
      "type": 3,
      "path": "340000,340600,340621",
      "parentCode": "340600"
},
{
      "code": "340700",
      "name": "铜陵市",
      "type": 2,
      "path": "340000,340700",
      "parentCode": "340000"
},
{
      "code": "340702",
      "name": "铜官山区",
      "type": 3,
      "path": "340000,340700,340702",
      "parentCode": "340700"
},
{
      "code": "340703",
      "name": "狮子山区",
      "type": 3,
      "path": "340000,340700,340703",
      "parentCode": "340700"
},
{
      "code": "340711",
      "name": "郊区",
      "type": 3,
      "path": "340000,340700,340711",
      "parentCode": "340700"
},
{
      "code": "340721",
      "name": "铜陵县",
      "type": 3,
      "path": "340000,340700,340721",
      "parentCode": "340700"
},
{
      "code": "340800",
      "name": "安庆市",
      "type": 2,
      "path": "340000,340800",
      "parentCode": "340000"
},
{
      "code": "340802",
      "name": "迎江区",
      "type": 3,
      "path": "340000,340800,340802",
      "parentCode": "340800"
},
{
      "code": "340803",
      "name": "大观区",
      "type": 3,
      "path": "340000,340800,340803",
      "parentCode": "340800"
},
{
      "code": "340811",
      "name": "宜秀区",
      "type": 3,
      "path": "340000,340800,340811",
      "parentCode": "340800"
},
{
      "code": "340822",
      "name": "怀宁县",
      "type": 3,
      "path": "340000,340800,340822",
      "parentCode": "340800"
},
{
      "code": "340823",
      "name": "枞阳县",
      "type": 3,
      "path": "340000,340800,340823",
      "parentCode": "340800"
},
{
      "code": "340824",
      "name": "潜山县",
      "type": 3,
      "path": "340000,340800,340824",
      "parentCode": "340800"
},
{
      "code": "340825",
      "name": "太湖县",
      "type": 3,
      "path": "340000,340800,340825",
      "parentCode": "340800"
},
{
      "code": "340826",
      "name": "宿松县",
      "type": 3,
      "path": "340000,340800,340826",
      "parentCode": "340800"
},
{
      "code": "340827",
      "name": "望江县",
      "type": 3,
      "path": "340000,340800,340827",
      "parentCode": "340800"
},
{
      "code": "340828",
      "name": "岳西县",
      "type": 3,
      "path": "340000,340800,340828",
      "parentCode": "340800"
},
{
      "code": "340881",
      "name": "桐城市",
      "type": 3,
      "path": "340000,340800,340881",
      "parentCode": "340800"
},
{
      "code": "341000",
      "name": "黄山市",
      "type": 2,
      "path": "340000,341000",
      "parentCode": "340000"
},
{
      "code": "341002",
      "name": "屯溪区",
      "type": 3,
      "path": "340000,341000,341002",
      "parentCode": "341000"
},
{
      "code": "341003",
      "name": "黄山区",
      "type": 3,
      "path": "340000,341000,341003",
      "parentCode": "341000"
},
{
      "code": "341004",
      "name": "徽州区",
      "type": 3,
      "path": "340000,341000,341004",
      "parentCode": "341000"
},
{
      "code": "341021",
      "name": "歙县",
      "type": 3,
      "path": "340000,341000,341021",
      "parentCode": "341000"
},
{
      "code": "341022",
      "name": "休宁县",
      "type": 3,
      "path": "340000,341000,341022",
      "parentCode": "341000"
},
{
      "code": "341023",
      "name": "黟县",
      "type": 3,
      "path": "340000,341000,341023",
      "parentCode": "341000"
},
{
      "code": "341024",
      "name": "祁门县",
      "type": 3,
      "path": "340000,341000,341024",
      "parentCode": "341000"
},
{
      "code": "341100",
      "name": "滁州市",
      "type": 2,
      "path": "340000,341100",
      "parentCode": "340000"
},
{
      "code": "341102",
      "name": "琅琊区",
      "type": 3,
      "path": "340000,341100,341102",
      "parentCode": "341100"
},
{
      "code": "341103",
      "name": "南谯区",
      "type": 3,
      "path": "340000,341100,341103",
      "parentCode": "341100"
},
{
      "code": "341122",
      "name": "来安县",
      "type": 3,
      "path": "340000,341100,341122",
      "parentCode": "341100"
},
{
      "code": "341124",
      "name": "全椒县",
      "type": 3,
      "path": "340000,341100,341124",
      "parentCode": "341100"
},
{
      "code": "341125",
      "name": "定远县",
      "type": 3,
      "path": "340000,341100,341125",
      "parentCode": "341100"
},
{
      "code": "341126",
      "name": "凤阳县",
      "type": 3,
      "path": "340000,341100,341126",
      "parentCode": "341100"
},
{
      "code": "341181",
      "name": "天长市",
      "type": 3,
      "path": "340000,341100,341181",
      "parentCode": "341100"
},
{
      "code": "341182",
      "name": "明光市",
      "type": 3,
      "path": "340000,341100,341182",
      "parentCode": "341100"
},
{
      "code": "341200",
      "name": "阜阳市",
      "type": 2,
      "path": "340000,341200",
      "parentCode": "340000"
},
{
      "code": "341202",
      "name": "颍州区",
      "type": 3,
      "path": "340000,341200,341202",
      "parentCode": "341200"
},
{
      "code": "341203",
      "name": "颍东区",
      "type": 3,
      "path": "340000,341200,341203",
      "parentCode": "341200"
},
{
      "code": "341204",
      "name": "颍泉区",
      "type": 3,
      "path": "340000,341200,341204",
      "parentCode": "341200"
},
{
      "code": "341221",
      "name": "临泉县",
      "type": 3,
      "path": "340000,341200,341221",
      "parentCode": "341200"
},
{
      "code": "341222",
      "name": "太和县",
      "type": 3,
      "path": "340000,341200,341222",
      "parentCode": "341200"
},
{
      "code": "341225",
      "name": "阜南县",
      "type": 3,
      "path": "340000,341200,341225",
      "parentCode": "341200"
},
{
      "code": "341226",
      "name": "颍上县",
      "type": 3,
      "path": "340000,341200,341226",
      "parentCode": "341200"
},
{
      "code": "341282",
      "name": "界首市",
      "type": 3,
      "path": "340000,341200,341282",
      "parentCode": "341200"
},
{
      "code": "341300",
      "name": "宿州市",
      "type": 2,
      "path": "340000,341300",
      "parentCode": "340000"
},
{
      "code": "341302",
      "name": "埇桥区",
      "type": 3,
      "path": "340000,341300,341302",
      "parentCode": "341300"
},
{
      "code": "341321",
      "name": "砀山县",
      "type": 3,
      "path": "340000,341300,341321",
      "parentCode": "341300"
},
{
      "code": "341322",
      "name": "萧县",
      "type": 3,
      "path": "340000,341300,341322",
      "parentCode": "341300"
},
{
      "code": "341323",
      "name": "灵璧县",
      "type": 3,
      "path": "340000,341300,341323",
      "parentCode": "341300"
},
{
      "code": "341324",
      "name": "泗县",
      "type": 3,
      "path": "340000,341300,341324",
      "parentCode": "341300"
},
{
      "code": "341400",
      "name": "巢湖市",
      "type": 2,
      "path": "340000,341400",
      "parentCode": "340000"
},
{
      "code": "341400",
      "name": "巢湖市区",
      "type": 3,
      "path": "340000,341400,341400",
      "parentCode": "341400"
},
{
      "code": "341500",
      "name": "六安市",
      "type": 2,
      "path": "340000,341500",
      "parentCode": "340000"
},
{
      "code": "341502",
      "name": "金安区",
      "type": 3,
      "path": "340000,341500,341502",
      "parentCode": "341500"
},
{
      "code": "341503",
      "name": "裕安区",
      "type": 3,
      "path": "340000,341500,341503",
      "parentCode": "341500"
},
{
      "code": "341521",
      "name": "寿县",
      "type": 3,
      "path": "340000,341500,341521",
      "parentCode": "341500"
},
{
      "code": "341522",
      "name": "霍邱县",
      "type": 3,
      "path": "340000,341500,341522",
      "parentCode": "341500"
},
{
      "code": "341523",
      "name": "舒城县",
      "type": 3,
      "path": "340000,341500,341523",
      "parentCode": "341500"
},
{
      "code": "341524",
      "name": "金寨县",
      "type": 3,
      "path": "340000,341500,341524",
      "parentCode": "341500"
},
{
      "code": "341525",
      "name": "霍山县",
      "type": 3,
      "path": "340000,341500,341525",
      "parentCode": "341500"
},
{
      "code": "341600",
      "name": "亳州市",
      "type": 2,
      "path": "340000,341600",
      "parentCode": "340000"
},
{
      "code": "341602",
      "name": "谯城区",
      "type": 3,
      "path": "340000,341600,341602",
      "parentCode": "341600"
},
{
      "code": "341621",
      "name": "涡阳县",
      "type": 3,
      "path": "340000,341600,341621",
      "parentCode": "341600"
},
{
      "code": "341622",
      "name": "蒙城县",
      "type": 3,
      "path": "340000,341600,341622",
      "parentCode": "341600"
},
{
      "code": "341623",
      "name": "利辛县",
      "type": 3,
      "path": "340000,341600,341623",
      "parentCode": "341600"
},
{
      "code": "341700",
      "name": "池州市",
      "type": 2,
      "path": "340000,341700",
      "parentCode": "340000"
},
{
      "code": "341702",
      "name": "贵池区",
      "type": 3,
      "path": "340000,341700,341702",
      "parentCode": "341700"
},
{
      "code": "341721",
      "name": "东至县",
      "type": 3,
      "path": "340000,341700,341721",
      "parentCode": "341700"
},
{
      "code": "341722",
      "name": "石台县",
      "type": 3,
      "path": "340000,341700,341722",
      "parentCode": "341700"
},
{
      "code": "341723",
      "name": "青阳县",
      "type": 3,
      "path": "340000,341700,341723",
      "parentCode": "341700"
},
{
      "code": "341800",
      "name": "宣城市",
      "type": 2,
      "path": "340000,341800",
      "parentCode": "340000"
},
{
      "code": "341802",
      "name": "宣州区",
      "type": 3,
      "path": "340000,341800,341802",
      "parentCode": "341800"
},
{
      "code": "341821",
      "name": "郎溪县",
      "type": 3,
      "path": "340000,341800,341821",
      "parentCode": "341800"
},
{
      "code": "341822",
      "name": "广德县",
      "type": 3,
      "path": "340000,341800,341822",
      "parentCode": "341800"
},
{
      "code": "341823",
      "name": "泾县",
      "type": 3,
      "path": "340000,341800,341823",
      "parentCode": "341800"
},
{
      "code": "341824",
      "name": "绩溪县",
      "type": 3,
      "path": "340000,341800,341824",
      "parentCode": "341800"
},
{
      "code": "341825",
      "name": "旌德县",
      "type": 3,
      "path": "340000,341800,341825",
      "parentCode": "341800"
},
{
      "code": "341881",
      "name": "宁国市",
      "type": 3,
      "path": "340000,341800,341881",
      "parentCode": "341800"
},
{
      "code": "350000",
      "name": "福建省",
      "type": 1,
      "path": "350000",
      "parentCode": null
},
{
      "code": "350100",
      "name": "福州市",
      "type": 2,
      "path": "350000,350100",
      "parentCode": "350000"
},
{
      "code": "350102",
      "name": "鼓楼区",
      "type": 3,
      "path": "350000,350100,350102",
      "parentCode": "350100"
},
{
      "code": "350103",
      "name": "台江区",
      "type": 3,
      "path": "350000,350100,350103",
      "parentCode": "350100"
},
{
      "code": "350104",
      "name": "仓山区",
      "type": 3,
      "path": "350000,350100,350104",
      "parentCode": "350100"
},
{
      "code": "350105",
      "name": "马尾区",
      "type": 3,
      "path": "350000,350100,350105",
      "parentCode": "350100"
},
{
      "code": "350111",
      "name": "晋安区",
      "type": 3,
      "path": "350000,350100,350111",
      "parentCode": "350100"
},
{
      "code": "350121",
      "name": "闽侯县",
      "type": 3,
      "path": "350000,350100,350121",
      "parentCode": "350100"
},
{
      "code": "350122",
      "name": "连江县",
      "type": 3,
      "path": "350000,350100,350122",
      "parentCode": "350100"
},
{
      "code": "350123",
      "name": "罗源县",
      "type": 3,
      "path": "350000,350100,350123",
      "parentCode": "350100"
},
{
      "code": "350124",
      "name": "闽清县",
      "type": 3,
      "path": "350000,350100,350124",
      "parentCode": "350100"
},
{
      "code": "350125",
      "name": "永泰县",
      "type": 3,
      "path": "350000,350100,350125",
      "parentCode": "350100"
},
{
      "code": "350128",
      "name": "平潭县",
      "type": 3,
      "path": "350000,350100,350128",
      "parentCode": "350100"
},
{
      "code": "350181",
      "name": "福清市",
      "type": 3,
      "path": "350000,350100,350181",
      "parentCode": "350100"
},
{
      "code": "350182",
      "name": "长乐市",
      "type": 3,
      "path": "350000,350100,350182",
      "parentCode": "350100"
},
{
      "code": "350200",
      "name": "厦门市",
      "type": 2,
      "path": "350000,350200",
      "parentCode": "350000"
},
{
      "code": "350203",
      "name": "思明区",
      "type": 3,
      "path": "350000,350200,350203",
      "parentCode": "350200"
},
{
      "code": "350205",
      "name": "海沧区",
      "type": 3,
      "path": "350000,350200,350205",
      "parentCode": "350200"
},
{
      "code": "350206",
      "name": "湖里区",
      "type": 3,
      "path": "350000,350200,350206",
      "parentCode": "350200"
},
{
      "code": "350211",
      "name": "集美区",
      "type": 3,
      "path": "350000,350200,350211",
      "parentCode": "350200"
},
{
      "code": "350212",
      "name": "同安区",
      "type": 3,
      "path": "350000,350200,350212",
      "parentCode": "350200"
},
{
      "code": "350213",
      "name": "翔安区",
      "type": 3,
      "path": "350000,350200,350213",
      "parentCode": "350200"
},
{
      "code": "350300",
      "name": "莆田市",
      "type": 2,
      "path": "350000,350300",
      "parentCode": "350000"
},
{
      "code": "350302",
      "name": "城厢区",
      "type": 3,
      "path": "350000,350300,350302",
      "parentCode": "350300"
},
{
      "code": "350303",
      "name": "涵江区",
      "type": 3,
      "path": "350000,350300,350303",
      "parentCode": "350300"
},
{
      "code": "350304",
      "name": "荔城区",
      "type": 3,
      "path": "350000,350300,350304",
      "parentCode": "350300"
},
{
      "code": "350305",
      "name": "秀屿区",
      "type": 3,
      "path": "350000,350300,350305",
      "parentCode": "350300"
},
{
      "code": "350322",
      "name": "仙游县",
      "type": 3,
      "path": "350000,350300,350322",
      "parentCode": "350300"
},
{
      "code": "350400",
      "name": "三明市",
      "type": 2,
      "path": "350000,350400",
      "parentCode": "350000"
},
{
      "code": "350402",
      "name": "梅列区",
      "type": 3,
      "path": "350000,350400,350402",
      "parentCode": "350400"
},
{
      "code": "350403",
      "name": "三元区",
      "type": 3,
      "path": "350000,350400,350403",
      "parentCode": "350400"
},
{
      "code": "350421",
      "name": "明溪县",
      "type": 3,
      "path": "350000,350400,350421",
      "parentCode": "350400"
},
{
      "code": "350423",
      "name": "清流县",
      "type": 3,
      "path": "350000,350400,350423",
      "parentCode": "350400"
},
{
      "code": "350424",
      "name": "宁化县",
      "type": 3,
      "path": "350000,350400,350424",
      "parentCode": "350400"
},
{
      "code": "350425",
      "name": "大田县",
      "type": 3,
      "path": "350000,350400,350425",
      "parentCode": "350400"
},
{
      "code": "350426",
      "name": "尤溪县",
      "type": 3,
      "path": "350000,350400,350426",
      "parentCode": "350400"
},
{
      "code": "350427",
      "name": "沙县",
      "type": 3,
      "path": "350000,350400,350427",
      "parentCode": "350400"
},
{
      "code": "350428",
      "name": "将乐县",
      "type": 3,
      "path": "350000,350400,350428",
      "parentCode": "350400"
},
{
      "code": "350429",
      "name": "泰宁县",
      "type": 3,
      "path": "350000,350400,350429",
      "parentCode": "350400"
},
{
      "code": "350430",
      "name": "建宁县",
      "type": 3,
      "path": "350000,350400,350430",
      "parentCode": "350400"
},
{
      "code": "350481",
      "name": "永安市",
      "type": 3,
      "path": "350000,350400,350481",
      "parentCode": "350400"
},
{
      "code": "350500",
      "name": "泉州市",
      "type": 2,
      "path": "350000,350500",
      "parentCode": "350000"
},
{
      "code": "350502",
      "name": "鲤城区",
      "type": 3,
      "path": "350000,350500,350502",
      "parentCode": "350500"
},
{
      "code": "350503",
      "name": "丰泽区",
      "type": 3,
      "path": "350000,350500,350503",
      "parentCode": "350500"
},
{
      "code": "350504",
      "name": "洛江区",
      "type": 3,
      "path": "350000,350500,350504",
      "parentCode": "350500"
},
{
      "code": "350505",
      "name": "泉港区",
      "type": 3,
      "path": "350000,350500,350505",
      "parentCode": "350500"
},
{
      "code": "350521",
      "name": "惠安县",
      "type": 3,
      "path": "350000,350500,350521",
      "parentCode": "350500"
},
{
      "code": "350524",
      "name": "安溪县",
      "type": 3,
      "path": "350000,350500,350524",
      "parentCode": "350500"
},
{
      "code": "350525",
      "name": "永春县",
      "type": 3,
      "path": "350000,350500,350525",
      "parentCode": "350500"
},
{
      "code": "350526",
      "name": "德化县",
      "type": 3,
      "path": "350000,350500,350526",
      "parentCode": "350500"
},
{
      "code": "350527",
      "name": "金门县",
      "type": 3,
      "path": "350000,350500,350527",
      "parentCode": "350500"
},
{
      "code": "350581",
      "name": "石狮市",
      "type": 3,
      "path": "350000,350500,350581",
      "parentCode": "350500"
},
{
      "code": "350582",
      "name": "晋江市",
      "type": 3,
      "path": "350000,350500,350582",
      "parentCode": "350500"
},
{
      "code": "350583",
      "name": "南安市",
      "type": 3,
      "path": "350000,350500,350583",
      "parentCode": "350500"
},
{
      "code": "350600",
      "name": "漳州市",
      "type": 2,
      "path": "350000,350600",
      "parentCode": "350000"
},
{
      "code": "350602",
      "name": "芗城区",
      "type": 3,
      "path": "350000,350600,350602",
      "parentCode": "350600"
},
{
      "code": "350603",
      "name": "龙文区",
      "type": 3,
      "path": "350000,350600,350603",
      "parentCode": "350600"
},
{
      "code": "350622",
      "name": "云霄县",
      "type": 3,
      "path": "350000,350600,350622",
      "parentCode": "350600"
},
{
      "code": "350623",
      "name": "漳浦县",
      "type": 3,
      "path": "350000,350600,350623",
      "parentCode": "350600"
},
{
      "code": "350624",
      "name": "诏安县",
      "type": 3,
      "path": "350000,350600,350624",
      "parentCode": "350600"
},
{
      "code": "350625",
      "name": "长泰县",
      "type": 3,
      "path": "350000,350600,350625",
      "parentCode": "350600"
},
{
      "code": "350626",
      "name": "东山县",
      "type": 3,
      "path": "350000,350600,350626",
      "parentCode": "350600"
},
{
      "code": "350627",
      "name": "南靖县",
      "type": 3,
      "path": "350000,350600,350627",
      "parentCode": "350600"
},
{
      "code": "350628",
      "name": "平和县",
      "type": 3,
      "path": "350000,350600,350628",
      "parentCode": "350600"
},
{
      "code": "350629",
      "name": "华安县",
      "type": 3,
      "path": "350000,350600,350629",
      "parentCode": "350600"
},
{
      "code": "350681",
      "name": "龙海市",
      "type": 3,
      "path": "350000,350600,350681",
      "parentCode": "350600"
},
{
      "code": "350700",
      "name": "南平市",
      "type": 2,
      "path": "350000,350700",
      "parentCode": "350000"
},
{
      "code": "350702",
      "name": "延平区",
      "type": 3,
      "path": "350000,350700,350702",
      "parentCode": "350700"
},
{
      "code": "350721",
      "name": "顺昌县",
      "type": 3,
      "path": "350000,350700,350721",
      "parentCode": "350700"
},
{
      "code": "350722",
      "name": "浦城县",
      "type": 3,
      "path": "350000,350700,350722",
      "parentCode": "350700"
},
{
      "code": "350723",
      "name": "光泽县",
      "type": 3,
      "path": "350000,350700,350723",
      "parentCode": "350700"
},
{
      "code": "350724",
      "name": "松溪县",
      "type": 3,
      "path": "350000,350700,350724",
      "parentCode": "350700"
},
{
      "code": "350725",
      "name": "政和县",
      "type": 3,
      "path": "350000,350700,350725",
      "parentCode": "350700"
},
{
      "code": "350781",
      "name": "邵武市",
      "type": 3,
      "path": "350000,350700,350781",
      "parentCode": "350700"
},
{
      "code": "350782",
      "name": "武夷山市",
      "type": 3,
      "path": "350000,350700,350782",
      "parentCode": "350700"
},
{
      "code": "350783",
      "name": "建瓯市",
      "type": 3,
      "path": "350000,350700,350783",
      "parentCode": "350700"
},
{
      "code": "350784",
      "name": "建阳市",
      "type": 3,
      "path": "350000,350700,350784",
      "parentCode": "350700"
},
{
      "code": "350800",
      "name": "龙岩市",
      "type": 2,
      "path": "350000,350800",
      "parentCode": "350000"
},
{
      "code": "350802",
      "name": "新罗区",
      "type": 3,
      "path": "350000,350800,350802",
      "parentCode": "350800"
},
{
      "code": "350821",
      "name": "长汀县",
      "type": 3,
      "path": "350000,350800,350821",
      "parentCode": "350800"
},
{
      "code": "350822",
      "name": "永定县",
      "type": 3,
      "path": "350000,350800,350822",
      "parentCode": "350800"
},
{
      "code": "350823",
      "name": "上杭县",
      "type": 3,
      "path": "350000,350800,350823",
      "parentCode": "350800"
},
{
      "code": "350824",
      "name": "武平县",
      "type": 3,
      "path": "350000,350800,350824",
      "parentCode": "350800"
},
{
      "code": "350825",
      "name": "连城县",
      "type": 3,
      "path": "350000,350800,350825",
      "parentCode": "350800"
},
{
      "code": "350881",
      "name": "漳平市",
      "type": 3,
      "path": "350000,350800,350881",
      "parentCode": "350800"
},
{
      "code": "350900",
      "name": "宁德市",
      "type": 2,
      "path": "350000,350900",
      "parentCode": "350000"
},
{
      "code": "350902",
      "name": "蕉城区",
      "type": 3,
      "path": "350000,350900,350902",
      "parentCode": "350900"
},
{
      "code": "350921",
      "name": "霞浦县",
      "type": 3,
      "path": "350000,350900,350921",
      "parentCode": "350900"
},
{
      "code": "350922",
      "name": "古田县",
      "type": 3,
      "path": "350000,350900,350922",
      "parentCode": "350900"
},
{
      "code": "350923",
      "name": "屏南县",
      "type": 3,
      "path": "350000,350900,350923",
      "parentCode": "350900"
},
{
      "code": "350924",
      "name": "寿宁县",
      "type": 3,
      "path": "350000,350900,350924",
      "parentCode": "350900"
},
{
      "code": "350925",
      "name": "周宁县",
      "type": 3,
      "path": "350000,350900,350925",
      "parentCode": "350900"
},
{
      "code": "350926",
      "name": "柘荣县",
      "type": 3,
      "path": "350000,350900,350926",
      "parentCode": "350900"
},
{
      "code": "350981",
      "name": "福安市",
      "type": 3,
      "path": "350000,350900,350981",
      "parentCode": "350900"
},
{
      "code": "350982",
      "name": "福鼎市",
      "type": 3,
      "path": "350000,350900,350982",
      "parentCode": "350900"
},
{
      "code": "360000",
      "name": "江西省",
      "type": 1,
      "path": "360000",
      "parentCode": null
},
{
      "code": "360100",
      "name": "南昌市",
      "type": 2,
      "path": "360000,360100",
      "parentCode": "360000"
},
{
      "code": "360102",
      "name": "东湖区",
      "type": 3,
      "path": "360000,360100,360102",
      "parentCode": "360100"
},
{
      "code": "360103",
      "name": "西湖区",
      "type": 3,
      "path": "360000,360100,360103",
      "parentCode": "360100"
},
{
      "code": "360104",
      "name": "青云谱区",
      "type": 3,
      "path": "360000,360100,360104",
      "parentCode": "360100"
},
{
      "code": "360105",
      "name": "湾里区",
      "type": 3,
      "path": "360000,360100,360105",
      "parentCode": "360100"
},
{
      "code": "360111",
      "name": "青山湖区",
      "type": 3,
      "path": "360000,360100,360111",
      "parentCode": "360100"
},
{
      "code": "360121",
      "name": "南昌县",
      "type": 3,
      "path": "360000,360100,360121",
      "parentCode": "360100"
},
{
      "code": "360122",
      "name": "新建县",
      "type": 3,
      "path": "360000,360100,360122",
      "parentCode": "360100"
},
{
      "code": "360123",
      "name": "安义县",
      "type": 3,
      "path": "360000,360100,360123",
      "parentCode": "360100"
},
{
      "code": "360124",
      "name": "进贤县",
      "type": 3,
      "path": "360000,360100,360124",
      "parentCode": "360100"
},
{
      "code": "360200",
      "name": "景德镇市",
      "type": 2,
      "path": "360000,360200",
      "parentCode": "360000"
},
{
      "code": "360202",
      "name": "昌江区",
      "type": 3,
      "path": "360000,360200,360202",
      "parentCode": "360200"
},
{
      "code": "360203",
      "name": "珠山区",
      "type": 3,
      "path": "360000,360200,360203",
      "parentCode": "360200"
},
{
      "code": "360222",
      "name": "浮梁县",
      "type": 3,
      "path": "360000,360200,360222",
      "parentCode": "360200"
},
{
      "code": "360281",
      "name": "乐平市",
      "type": 3,
      "path": "360000,360200,360281",
      "parentCode": "360200"
},
{
      "code": "360300",
      "name": "萍乡市",
      "type": 2,
      "path": "360000,360300",
      "parentCode": "360000"
},
{
      "code": "360302",
      "name": "安源区",
      "type": 3,
      "path": "360000,360300,360302",
      "parentCode": "360300"
},
{
      "code": "360313",
      "name": "湘东区",
      "type": 3,
      "path": "360000,360300,360313",
      "parentCode": "360300"
},
{
      "code": "360321",
      "name": "莲花县",
      "type": 3,
      "path": "360000,360300,360321",
      "parentCode": "360300"
},
{
      "code": "360322",
      "name": "上栗县",
      "type": 3,
      "path": "360000,360300,360322",
      "parentCode": "360300"
},
{
      "code": "360323",
      "name": "芦溪县",
      "type": 3,
      "path": "360000,360300,360323",
      "parentCode": "360300"
},
{
      "code": "360400",
      "name": "九江市",
      "type": 2,
      "path": "360000,360400",
      "parentCode": "360000"
},
{
      "code": "360402",
      "name": "庐山区",
      "type": 3,
      "path": "360000,360400,360402",
      "parentCode": "360400"
},
{
      "code": "360403",
      "name": "浔阳区",
      "type": 3,
      "path": "360000,360400,360403",
      "parentCode": "360400"
},
{
      "code": "360421",
      "name": "九江县",
      "type": 3,
      "path": "360000,360400,360421",
      "parentCode": "360400"
},
{
      "code": "360423",
      "name": "武宁县",
      "type": 3,
      "path": "360000,360400,360423",
      "parentCode": "360400"
},
{
      "code": "360424",
      "name": "修水县",
      "type": 3,
      "path": "360000,360400,360424",
      "parentCode": "360400"
},
{
      "code": "360425",
      "name": "永修县",
      "type": 3,
      "path": "360000,360400,360425",
      "parentCode": "360400"
},
{
      "code": "360426",
      "name": "德安县",
      "type": 3,
      "path": "360000,360400,360426",
      "parentCode": "360400"
},
{
      "code": "360427",
      "name": "星子县",
      "type": 3,
      "path": "360000,360400,360427",
      "parentCode": "360400"
},
{
      "code": "360428",
      "name": "都昌县",
      "type": 3,
      "path": "360000,360400,360428",
      "parentCode": "360400"
},
{
      "code": "360429",
      "name": "湖口县",
      "type": 3,
      "path": "360000,360400,360429",
      "parentCode": "360400"
},
{
      "code": "360430",
      "name": "彭泽县",
      "type": 3,
      "path": "360000,360400,360430",
      "parentCode": "360400"
},
{
      "code": "360481",
      "name": "瑞昌市",
      "type": 3,
      "path": "360000,360400,360481",
      "parentCode": "360400"
},
{
      "code": "360482",
      "name": "共青城市",
      "type": 3,
      "path": "360000,360400,360482",
      "parentCode": "360400"
},
{
      "code": "360500",
      "name": "新余市",
      "type": 2,
      "path": "360000,360500",
      "parentCode": "360000"
},
{
      "code": "360502",
      "name": "渝水区",
      "type": 3,
      "path": "360000,360500,360502",
      "parentCode": "360500"
},
{
      "code": "360521",
      "name": "分宜县",
      "type": 3,
      "path": "360000,360500,360521",
      "parentCode": "360500"
},
{
      "code": "360600",
      "name": "鹰潭市",
      "type": 2,
      "path": "360000,360600",
      "parentCode": "360000"
},
{
      "code": "360602",
      "name": "月湖区",
      "type": 3,
      "path": "360000,360600,360602",
      "parentCode": "360600"
},
{
      "code": "360622",
      "name": "余江县",
      "type": 3,
      "path": "360000,360600,360622",
      "parentCode": "360600"
},
{
      "code": "360681",
      "name": "贵溪市",
      "type": 3,
      "path": "360000,360600,360681",
      "parentCode": "360600"
},
{
      "code": "360700",
      "name": "赣州市",
      "type": 2,
      "path": "360000,360700",
      "parentCode": "360000"
},
{
      "code": "360702",
      "name": "章贡区",
      "type": 3,
      "path": "360000,360700,360702",
      "parentCode": "360700"
},
{
      "code": "360703",
      "name": "南康区",
      "type": 3,
      "path": "360000,360700,360703",
      "parentCode": "360700"
},
{
      "code": "360721",
      "name": "赣县",
      "type": 3,
      "path": "360000,360700,360721",
      "parentCode": "360700"
},
{
      "code": "360722",
      "name": "信丰县",
      "type": 3,
      "path": "360000,360700,360722",
      "parentCode": "360700"
},
{
      "code": "360723",
      "name": "大余县",
      "type": 3,
      "path": "360000,360700,360723",
      "parentCode": "360700"
},
{
      "code": "360724",
      "name": "上犹县",
      "type": 3,
      "path": "360000,360700,360724",
      "parentCode": "360700"
},
{
      "code": "360725",
      "name": "崇义县",
      "type": 3,
      "path": "360000,360700,360725",
      "parentCode": "360700"
},
{
      "code": "360726",
      "name": "安远县",
      "type": 3,
      "path": "360000,360700,360726",
      "parentCode": "360700"
},
{
      "code": "360727",
      "name": "龙南县",
      "type": 3,
      "path": "360000,360700,360727",
      "parentCode": "360700"
},
{
      "code": "360728",
      "name": "定南县",
      "type": 3,
      "path": "360000,360700,360728",
      "parentCode": "360700"
},
{
      "code": "360729",
      "name": "全南县",
      "type": 3,
      "path": "360000,360700,360729",
      "parentCode": "360700"
},
{
      "code": "360730",
      "name": "宁都县",
      "type": 3,
      "path": "360000,360700,360730",
      "parentCode": "360700"
},
{
      "code": "360731",
      "name": "于都县",
      "type": 3,
      "path": "360000,360700,360731",
      "parentCode": "360700"
},
{
      "code": "360732",
      "name": "兴国县",
      "type": 3,
      "path": "360000,360700,360732",
      "parentCode": "360700"
},
{
      "code": "360733",
      "name": "会昌县",
      "type": 3,
      "path": "360000,360700,360733",
      "parentCode": "360700"
},
{
      "code": "360734",
      "name": "寻乌县",
      "type": 3,
      "path": "360000,360700,360734",
      "parentCode": "360700"
},
{
      "code": "360735",
      "name": "石城县",
      "type": 3,
      "path": "360000,360700,360735",
      "parentCode": "360700"
},
{
      "code": "360781",
      "name": "瑞金市",
      "type": 3,
      "path": "360000,360700,360781",
      "parentCode": "360700"
},
{
      "code": "360800",
      "name": "吉安市",
      "type": 2,
      "path": "360000,360800",
      "parentCode": "360000"
},
{
      "code": "360802",
      "name": "吉州区",
      "type": 3,
      "path": "360000,360800,360802",
      "parentCode": "360800"
},
{
      "code": "360803",
      "name": "青原区",
      "type": 3,
      "path": "360000,360800,360803",
      "parentCode": "360800"
},
{
      "code": "360821",
      "name": "吉安县",
      "type": 3,
      "path": "360000,360800,360821",
      "parentCode": "360800"
},
{
      "code": "360822",
      "name": "吉水县",
      "type": 3,
      "path": "360000,360800,360822",
      "parentCode": "360800"
},
{
      "code": "360823",
      "name": "峡江县",
      "type": 3,
      "path": "360000,360800,360823",
      "parentCode": "360800"
},
{
      "code": "360824",
      "name": "新干县",
      "type": 3,
      "path": "360000,360800,360824",
      "parentCode": "360800"
},
{
      "code": "360825",
      "name": "永丰县",
      "type": 3,
      "path": "360000,360800,360825",
      "parentCode": "360800"
},
{
      "code": "360826",
      "name": "泰和县",
      "type": 3,
      "path": "360000,360800,360826",
      "parentCode": "360800"
},
{
      "code": "360827",
      "name": "遂川县",
      "type": 3,
      "path": "360000,360800,360827",
      "parentCode": "360800"
},
{
      "code": "360828",
      "name": "万安县",
      "type": 3,
      "path": "360000,360800,360828",
      "parentCode": "360800"
},
{
      "code": "360829",
      "name": "安福县",
      "type": 3,
      "path": "360000,360800,360829",
      "parentCode": "360800"
},
{
      "code": "360830",
      "name": "永新县",
      "type": 3,
      "path": "360000,360800,360830",
      "parentCode": "360800"
},
{
      "code": "360881",
      "name": "井冈山市",
      "type": 3,
      "path": "360000,360800,360881",
      "parentCode": "360800"
},
{
      "code": "360900",
      "name": "宜春市",
      "type": 2,
      "path": "360000,360900",
      "parentCode": "360000"
},
{
      "code": "360902",
      "name": "袁州区",
      "type": 3,
      "path": "360000,360900,360902",
      "parentCode": "360900"
},
{
      "code": "360921",
      "name": "奉新县",
      "type": 3,
      "path": "360000,360900,360921",
      "parentCode": "360900"
},
{
      "code": "360922",
      "name": "万载县",
      "type": 3,
      "path": "360000,360900,360922",
      "parentCode": "360900"
},
{
      "code": "360923",
      "name": "上高县",
      "type": 3,
      "path": "360000,360900,360923",
      "parentCode": "360900"
},
{
      "code": "360924",
      "name": "宜丰县",
      "type": 3,
      "path": "360000,360900,360924",
      "parentCode": "360900"
},
{
      "code": "360925",
      "name": "靖安县",
      "type": 3,
      "path": "360000,360900,360925",
      "parentCode": "360900"
},
{
      "code": "360926",
      "name": "铜鼓县",
      "type": 3,
      "path": "360000,360900,360926",
      "parentCode": "360900"
},
{
      "code": "360981",
      "name": "丰城市",
      "type": 3,
      "path": "360000,360900,360981",
      "parentCode": "360900"
},
{
      "code": "360982",
      "name": "樟树市",
      "type": 3,
      "path": "360000,360900,360982",
      "parentCode": "360900"
},
{
      "code": "360983",
      "name": "高安市",
      "type": 3,
      "path": "360000,360900,360983",
      "parentCode": "360900"
},
{
      "code": "361000",
      "name": "抚州市",
      "type": 2,
      "path": "360000,361000",
      "parentCode": "360000"
},
{
      "code": "361002",
      "name": "临川区",
      "type": 3,
      "path": "360000,361000,361002",
      "parentCode": "361000"
},
{
      "code": "361021",
      "name": "南城县",
      "type": 3,
      "path": "360000,361000,361021",
      "parentCode": "361000"
},
{
      "code": "361022",
      "name": "黎川县",
      "type": 3,
      "path": "360000,361000,361022",
      "parentCode": "361000"
},
{
      "code": "361023",
      "name": "南丰县",
      "type": 3,
      "path": "360000,361000,361023",
      "parentCode": "361000"
},
{
      "code": "361024",
      "name": "崇仁县",
      "type": 3,
      "path": "360000,361000,361024",
      "parentCode": "361000"
},
{
      "code": "361025",
      "name": "乐安县",
      "type": 3,
      "path": "360000,361000,361025",
      "parentCode": "361000"
},
{
      "code": "361026",
      "name": "宜黄县",
      "type": 3,
      "path": "360000,361000,361026",
      "parentCode": "361000"
},
{
      "code": "361027",
      "name": "金溪县",
      "type": 3,
      "path": "360000,361000,361027",
      "parentCode": "361000"
},
{
      "code": "361028",
      "name": "资溪县",
      "type": 3,
      "path": "360000,361000,361028",
      "parentCode": "361000"
},
{
      "code": "361029",
      "name": "东乡县",
      "type": 3,
      "path": "360000,361000,361029",
      "parentCode": "361000"
},
{
      "code": "361030",
      "name": "广昌县",
      "type": 3,
      "path": "360000,361000,361030",
      "parentCode": "361000"
},
{
      "code": "361100",
      "name": "上饶市",
      "type": 2,
      "path": "360000,361100",
      "parentCode": "360000"
},
{
      "code": "361102",
      "name": "信州区",
      "type": 3,
      "path": "360000,361100,361102",
      "parentCode": "361100"
},
{
      "code": "361121",
      "name": "上饶县",
      "type": 3,
      "path": "360000,361100,361121",
      "parentCode": "361100"
},
{
      "code": "361122",
      "name": "广丰县",
      "type": 3,
      "path": "360000,361100,361122",
      "parentCode": "361100"
},
{
      "code": "361123",
      "name": "玉山县",
      "type": 3,
      "path": "360000,361100,361123",
      "parentCode": "361100"
},
{
      "code": "361124",
      "name": "铅山县",
      "type": 3,
      "path": "360000,361100,361124",
      "parentCode": "361100"
},
{
      "code": "361125",
      "name": "横峰县",
      "type": 3,
      "path": "360000,361100,361125",
      "parentCode": "361100"
},
{
      "code": "361126",
      "name": "弋阳县",
      "type": 3,
      "path": "360000,361100,361126",
      "parentCode": "361100"
},
{
      "code": "361127",
      "name": "余干县",
      "type": 3,
      "path": "360000,361100,361127",
      "parentCode": "361100"
},
{
      "code": "361128",
      "name": "鄱阳县",
      "type": 3,
      "path": "360000,361100,361128",
      "parentCode": "361100"
},
{
      "code": "361129",
      "name": "万年县",
      "type": 3,
      "path": "360000,361100,361129",
      "parentCode": "361100"
},
{
      "code": "361130",
      "name": "婺源县",
      "type": 3,
      "path": "360000,361100,361130",
      "parentCode": "361100"
},
{
      "code": "361181",
      "name": "德兴市",
      "type": 3,
      "path": "360000,361100,361181",
      "parentCode": "361100"
},
{
      "code": "370000",
      "name": "山东省",
      "type": 1,
      "path": "370000",
      "parentCode": null
},
{
      "code": "370100",
      "name": "济南市",
      "type": 2,
      "path": "370000,370100",
      "parentCode": "370000"
},
{
      "code": "370102",
      "name": "历下区",
      "type": 3,
      "path": "370000,370100,370102",
      "parentCode": "370100"
},
{
      "code": "370103",
      "name": "市中区",
      "type": 3,
      "path": "370000,370100,370103",
      "parentCode": "370100"
},
{
      "code": "370104",
      "name": "槐荫区",
      "type": 3,
      "path": "370000,370100,370104",
      "parentCode": "370100"
},
{
      "code": "370105",
      "name": "天桥区",
      "type": 3,
      "path": "370000,370100,370105",
      "parentCode": "370100"
},
{
      "code": "370112",
      "name": "历城区",
      "type": 3,
      "path": "370000,370100,370112",
      "parentCode": "370100"
},
{
      "code": "370113",
      "name": "长清区",
      "type": 3,
      "path": "370000,370100,370113",
      "parentCode": "370100"
},
{
      "code": "370124",
      "name": "平阴县",
      "type": 3,
      "path": "370000,370100,370124",
      "parentCode": "370100"
},
{
      "code": "370125",
      "name": "济阳县",
      "type": 3,
      "path": "370000,370100,370125",
      "parentCode": "370100"
},
{
      "code": "370126",
      "name": "商河县",
      "type": 3,
      "path": "370000,370100,370126",
      "parentCode": "370100"
},
{
      "code": "370181",
      "name": "章丘市",
      "type": 3,
      "path": "370000,370100,370181",
      "parentCode": "370100"
},
{
      "code": "370200",
      "name": "青岛市",
      "type": 2,
      "path": "370000,370200",
      "parentCode": "370000"
},
{
      "code": "370202",
      "name": "市南区",
      "type": 3,
      "path": "370000,370200,370202",
      "parentCode": "370200"
},
{
      "code": "370203",
      "name": "市北区",
      "type": 3,
      "path": "370000,370200,370203",
      "parentCode": "370200"
},
{
      "code": "370211",
      "name": "黄岛区",
      "type": 3,
      "path": "370000,370200,370211",
      "parentCode": "370200"
},
{
      "code": "370212",
      "name": "崂山区",
      "type": 3,
      "path": "370000,370200,370212",
      "parentCode": "370200"
},
{
      "code": "370213",
      "name": "李沧区",
      "type": 3,
      "path": "370000,370200,370213",
      "parentCode": "370200"
},
{
      "code": "370214",
      "name": "城阳区",
      "type": 3,
      "path": "370000,370200,370214",
      "parentCode": "370200"
},
{
      "code": "370281",
      "name": "胶州市",
      "type": 3,
      "path": "370000,370200,370281",
      "parentCode": "370200"
},
{
      "code": "370282",
      "name": "即墨市",
      "type": 3,
      "path": "370000,370200,370282",
      "parentCode": "370200"
},
{
      "code": "370283",
      "name": "平度市",
      "type": 3,
      "path": "370000,370200,370283",
      "parentCode": "370200"
},
{
      "code": "370285",
      "name": "莱西市",
      "type": 3,
      "path": "370000,370200,370285",
      "parentCode": "370200"
},
{
      "code": "370300",
      "name": "淄博市",
      "type": 2,
      "path": "370000,370300",
      "parentCode": "370000"
},
{
      "code": "370302",
      "name": "淄川区",
      "type": 3,
      "path": "370000,370300,370302",
      "parentCode": "370300"
},
{
      "code": "370303",
      "name": "张店区",
      "type": 3,
      "path": "370000,370300,370303",
      "parentCode": "370300"
},
{
      "code": "370304",
      "name": "博山区",
      "type": 3,
      "path": "370000,370300,370304",
      "parentCode": "370300"
},
{
      "code": "370305",
      "name": "临淄区",
      "type": 3,
      "path": "370000,370300,370305",
      "parentCode": "370300"
},
{
      "code": "370306",
      "name": "周村区",
      "type": 3,
      "path": "370000,370300,370306",
      "parentCode": "370300"
},
{
      "code": "370321",
      "name": "桓台县",
      "type": 3,
      "path": "370000,370300,370321",
      "parentCode": "370300"
},
{
      "code": "370322",
      "name": "高青县",
      "type": 3,
      "path": "370000,370300,370322",
      "parentCode": "370300"
},
{
      "code": "370323",
      "name": "沂源县",
      "type": 3,
      "path": "370000,370300,370323",
      "parentCode": "370300"
},
{
      "code": "370400",
      "name": "枣庄市",
      "type": 2,
      "path": "370000,370400",
      "parentCode": "370000"
},
{
      "code": "370402",
      "name": "市中区",
      "type": 3,
      "path": "370000,370400,370402",
      "parentCode": "370400"
},
{
      "code": "370403",
      "name": "薛城区",
      "type": 3,
      "path": "370000,370400,370403",
      "parentCode": "370400"
},
{
      "code": "370404",
      "name": "峄城区",
      "type": 3,
      "path": "370000,370400,370404",
      "parentCode": "370400"
},
{
      "code": "370405",
      "name": "台儿庄区",
      "type": 3,
      "path": "370000,370400,370405",
      "parentCode": "370400"
},
{
      "code": "370406",
      "name": "山亭区",
      "type": 3,
      "path": "370000,370400,370406",
      "parentCode": "370400"
},
{
      "code": "370481",
      "name": "滕州市",
      "type": 3,
      "path": "370000,370400,370481",
      "parentCode": "370400"
},
{
      "code": "370500",
      "name": "东营市",
      "type": 2,
      "path": "370000,370500",
      "parentCode": "370000"
},
{
      "code": "370502",
      "name": "东营区",
      "type": 3,
      "path": "370000,370500,370502",
      "parentCode": "370500"
},
{
      "code": "370503",
      "name": "河口区",
      "type": 3,
      "path": "370000,370500,370503",
      "parentCode": "370500"
},
{
      "code": "370521",
      "name": "垦利县",
      "type": 3,
      "path": "370000,370500,370521",
      "parentCode": "370500"
},
{
      "code": "370522",
      "name": "利津县",
      "type": 3,
      "path": "370000,370500,370522",
      "parentCode": "370500"
},
{
      "code": "370523",
      "name": "广饶县",
      "type": 3,
      "path": "370000,370500,370523",
      "parentCode": "370500"
},
{
      "code": "370600",
      "name": "烟台市",
      "type": 2,
      "path": "370000,370600",
      "parentCode": "370000"
},
{
      "code": "370602",
      "name": "芝罘区",
      "type": 3,
      "path": "370000,370600,370602",
      "parentCode": "370600"
},
{
      "code": "370611",
      "name": "福山区",
      "type": 3,
      "path": "370000,370600,370611",
      "parentCode": "370600"
},
{
      "code": "370612",
      "name": "牟平区",
      "type": 3,
      "path": "370000,370600,370612",
      "parentCode": "370600"
},
{
      "code": "370613",
      "name": "莱山区",
      "type": 3,
      "path": "370000,370600,370613",
      "parentCode": "370600"
},
{
      "code": "370634",
      "name": "长岛县",
      "type": 3,
      "path": "370000,370600,370634",
      "parentCode": "370600"
},
{
      "code": "370681",
      "name": "龙口市",
      "type": 3,
      "path": "370000,370600,370681",
      "parentCode": "370600"
},
{
      "code": "370682",
      "name": "莱阳市",
      "type": 3,
      "path": "370000,370600,370682",
      "parentCode": "370600"
},
{
      "code": "370683",
      "name": "莱州市",
      "type": 3,
      "path": "370000,370600,370683",
      "parentCode": "370600"
},
{
      "code": "370684",
      "name": "蓬莱市",
      "type": 3,
      "path": "370000,370600,370684",
      "parentCode": "370600"
},
{
      "code": "370685",
      "name": "招远市",
      "type": 3,
      "path": "370000,370600,370685",
      "parentCode": "370600"
},
{
      "code": "370686",
      "name": "栖霞市",
      "type": 3,
      "path": "370000,370600,370686",
      "parentCode": "370600"
},
{
      "code": "370687",
      "name": "海阳市",
      "type": 3,
      "path": "370000,370600,370687",
      "parentCode": "370600"
},
{
      "code": "370700",
      "name": "潍坊市",
      "type": 2,
      "path": "370000,370700",
      "parentCode": "370000"
},
{
      "code": "370702",
      "name": "潍城区",
      "type": 3,
      "path": "370000,370700,370702",
      "parentCode": "370700"
},
{
      "code": "370703",
      "name": "寒亭区",
      "type": 3,
      "path": "370000,370700,370703",
      "parentCode": "370700"
},
{
      "code": "370704",
      "name": "坊子区",
      "type": 3,
      "path": "370000,370700,370704",
      "parentCode": "370700"
},
{
      "code": "370705",
      "name": "奎文区",
      "type": 3,
      "path": "370000,370700,370705",
      "parentCode": "370700"
},
{
      "code": "370724",
      "name": "临朐县",
      "type": 3,
      "path": "370000,370700,370724",
      "parentCode": "370700"
},
{
      "code": "370725",
      "name": "昌乐县",
      "type": 3,
      "path": "370000,370700,370725",
      "parentCode": "370700"
},
{
      "code": "370781",
      "name": "青州市",
      "type": 3,
      "path": "370000,370700,370781",
      "parentCode": "370700"
},
{
      "code": "370782",
      "name": "诸城市",
      "type": 3,
      "path": "370000,370700,370782",
      "parentCode": "370700"
},
{
      "code": "370783",
      "name": "寿光市",
      "type": 3,
      "path": "370000,370700,370783",
      "parentCode": "370700"
},
{
      "code": "370784",
      "name": "安丘市",
      "type": 3,
      "path": "370000,370700,370784",
      "parentCode": "370700"
},
{
      "code": "370785",
      "name": "高密市",
      "type": 3,
      "path": "370000,370700,370785",
      "parentCode": "370700"
},
{
      "code": "370786",
      "name": "昌邑市",
      "type": 3,
      "path": "370000,370700,370786",
      "parentCode": "370700"
},
{
      "code": "370800",
      "name": "济宁市",
      "type": 2,
      "path": "370000,370800",
      "parentCode": "370000"
},
{
      "code": "370802",
      "name": "市中区",
      "type": 3,
      "path": "370000,370800,370802",
      "parentCode": "370800"
},
{
      "code": "370811",
      "name": "任城区",
      "type": 3,
      "path": "370000,370800,370811",
      "parentCode": "370800"
},
{
      "code": "370812",
      "name": "兖州区",
      "type": 3,
      "path": "370000,370800,370812",
      "parentCode": "370800"
},
{
      "code": "370826",
      "name": "微山县",
      "type": 3,
      "path": "370000,370800,370826",
      "parentCode": "370800"
},
{
      "code": "370827",
      "name": "鱼台县",
      "type": 3,
      "path": "370000,370800,370827",
      "parentCode": "370800"
},
{
      "code": "370828",
      "name": "金乡县",
      "type": 3,
      "path": "370000,370800,370828",
      "parentCode": "370800"
},
{
      "code": "370829",
      "name": "嘉祥县",
      "type": 3,
      "path": "370000,370800,370829",
      "parentCode": "370800"
},
{
      "code": "370830",
      "name": "汶上县",
      "type": 3,
      "path": "370000,370800,370830",
      "parentCode": "370800"
},
{
      "code": "370831",
      "name": "泗水县",
      "type": 3,
      "path": "370000,370800,370831",
      "parentCode": "370800"
},
{
      "code": "370832",
      "name": "梁山县",
      "type": 3,
      "path": "370000,370800,370832",
      "parentCode": "370800"
},
{
      "code": "370881",
      "name": "曲阜市",
      "type": 3,
      "path": "370000,370800,370881",
      "parentCode": "370800"
},
{
      "code": "370883",
      "name": "邹城市",
      "type": 3,
      "path": "370000,370800,370883",
      "parentCode": "370800"
},
{
      "code": "370900",
      "name": "泰安市",
      "type": 2,
      "path": "370000,370900",
      "parentCode": "370000"
},
{
      "code": "370902",
      "name": "泰山区",
      "type": 3,
      "path": "370000,370900,370902",
      "parentCode": "370900"
},
{
      "code": "370911",
      "name": "岱岳区",
      "type": 3,
      "path": "370000,370900,370911",
      "parentCode": "370900"
},
{
      "code": "370921",
      "name": "宁阳县",
      "type": 3,
      "path": "370000,370900,370921",
      "parentCode": "370900"
},
{
      "code": "370923",
      "name": "东平县",
      "type": 3,
      "path": "370000,370900,370923",
      "parentCode": "370900"
},
{
      "code": "370982",
      "name": "新泰市",
      "type": 3,
      "path": "370000,370900,370982",
      "parentCode": "370900"
},
{
      "code": "370983",
      "name": "肥城市",
      "type": 3,
      "path": "370000,370900,370983",
      "parentCode": "370900"
},
{
      "code": "371000",
      "name": "威海市",
      "type": 2,
      "path": "370000,371000",
      "parentCode": "370000"
},
{
      "code": "371002",
      "name": "环翠区",
      "type": 3,
      "path": "370000,371000,371002",
      "parentCode": "371000"
},
{
      "code": "371003",
      "name": "文登区",
      "type": 3,
      "path": "370000,371000,371003",
      "parentCode": "371000"
},
{
      "code": "371082",
      "name": "荣成市",
      "type": 3,
      "path": "370000,371000,371082",
      "parentCode": "371000"
},
{
      "code": "371083",
      "name": "乳山市",
      "type": 3,
      "path": "370000,371000,371083",
      "parentCode": "371000"
},
{
      "code": "371100",
      "name": "日照市",
      "type": 2,
      "path": "370000,371100",
      "parentCode": "370000"
},
{
      "code": "371102",
      "name": "东港区",
      "type": 3,
      "path": "370000,371100,371102",
      "parentCode": "371100"
},
{
      "code": "371103",
      "name": "岚山区",
      "type": 3,
      "path": "370000,371100,371103",
      "parentCode": "371100"
},
{
      "code": "371121",
      "name": "五莲县",
      "type": 3,
      "path": "370000,371100,371121",
      "parentCode": "371100"
},
{
      "code": "371122",
      "name": "莒县",
      "type": 3,
      "path": "370000,371100,371122",
      "parentCode": "371100"
},
{
      "code": "371200",
      "name": "莱芜市",
      "type": 2,
      "path": "370000,371200",
      "parentCode": "370000"
},
{
      "code": "371202",
      "name": "莱城区",
      "type": 3,
      "path": "370000,371200,371202",
      "parentCode": "371200"
},
{
      "code": "371203",
      "name": "钢城区",
      "type": 3,
      "path": "370000,371200,371203",
      "parentCode": "371200"
},
{
      "code": "371300",
      "name": "临沂市",
      "type": 2,
      "path": "370000,371300",
      "parentCode": "370000"
},
{
      "code": "371302",
      "name": "兰山区",
      "type": 3,
      "path": "370000,371300,371302",
      "parentCode": "371300"
},
{
      "code": "371311",
      "name": "罗庄区",
      "type": 3,
      "path": "370000,371300,371311",
      "parentCode": "371300"
},
{
      "code": "371312",
      "name": "河东区",
      "type": 3,
      "path": "370000,371300,371312",
      "parentCode": "371300"
},
{
      "code": "371321",
      "name": "沂南县",
      "type": 3,
      "path": "370000,371300,371321",
      "parentCode": "371300"
},
{
      "code": "371322",
      "name": "郯城县",
      "type": 3,
      "path": "370000,371300,371322",
      "parentCode": "371300"
},
{
      "code": "371323",
      "name": "沂水县",
      "type": 3,
      "path": "370000,371300,371323",
      "parentCode": "371300"
},
{
      "code": "371324",
      "name": "兰陵县",
      "type": 3,
      "path": "370000,371300,371324",
      "parentCode": "371300"
},
{
      "code": "371325",
      "name": "费县",
      "type": 3,
      "path": "370000,371300,371325",
      "parentCode": "371300"
},
{
      "code": "371326",
      "name": "平邑县",
      "type": 3,
      "path": "370000,371300,371326",
      "parentCode": "371300"
},
{
      "code": "371327",
      "name": "莒南县",
      "type": 3,
      "path": "370000,371300,371327",
      "parentCode": "371300"
},
{
      "code": "371328",
      "name": "蒙阴县",
      "type": 3,
      "path": "370000,371300,371328",
      "parentCode": "371300"
},
{
      "code": "371329",
      "name": "临沭县",
      "type": 3,
      "path": "370000,371300,371329",
      "parentCode": "371300"
},
{
      "code": "371400",
      "name": "德州市",
      "type": 2,
      "path": "370000,371400",
      "parentCode": "370000"
},
{
      "code": "371402",
      "name": "德城区",
      "type": 3,
      "path": "370000,371400,371402",
      "parentCode": "371400"
},
{
      "code": "371403",
      "name": "陵城区",
      "type": 3,
      "path": "370000,371400,371403",
      "parentCode": "371400"
},
{
      "code": "371422",
      "name": "宁津县",
      "type": 3,
      "path": "370000,371400,371422",
      "parentCode": "371400"
},
{
      "code": "371423",
      "name": "庆云县",
      "type": 3,
      "path": "370000,371400,371423",
      "parentCode": "371400"
},
{
      "code": "371424",
      "name": "临邑县",
      "type": 3,
      "path": "370000,371400,371424",
      "parentCode": "371400"
},
{
      "code": "371425",
      "name": "齐河县",
      "type": 3,
      "path": "370000,371400,371425",
      "parentCode": "371400"
},
{
      "code": "371426",
      "name": "平原县",
      "type": 3,
      "path": "370000,371400,371426",
      "parentCode": "371400"
},
{
      "code": "371427",
      "name": "夏津县",
      "type": 3,
      "path": "370000,371400,371427",
      "parentCode": "371400"
},
{
      "code": "371428",
      "name": "武城县",
      "type": 3,
      "path": "370000,371400,371428",
      "parentCode": "371400"
},
{
      "code": "371481",
      "name": "乐陵市",
      "type": 3,
      "path": "370000,371400,371481",
      "parentCode": "371400"
},
{
      "code": "371482",
      "name": "禹城市",
      "type": 3,
      "path": "370000,371400,371482",
      "parentCode": "371400"
},
{
      "code": "371500",
      "name": "聊城市",
      "type": 2,
      "path": "370000,371500",
      "parentCode": "370000"
},
{
      "code": "371502",
      "name": "东昌府区",
      "type": 3,
      "path": "370000,371500,371502",
      "parentCode": "371500"
},
{
      "code": "371521",
      "name": "阳谷县",
      "type": 3,
      "path": "370000,371500,371521",
      "parentCode": "371500"
},
{
      "code": "371522",
      "name": "莘县",
      "type": 3,
      "path": "370000,371500,371522",
      "parentCode": "371500"
},
{
      "code": "371523",
      "name": "茌平县",
      "type": 3,
      "path": "370000,371500,371523",
      "parentCode": "371500"
},
{
      "code": "371524",
      "name": "东阿县",
      "type": 3,
      "path": "370000,371500,371524",
      "parentCode": "371500"
},
{
      "code": "371525",
      "name": "冠县",
      "type": 3,
      "path": "370000,371500,371525",
      "parentCode": "371500"
},
{
      "code": "371526",
      "name": "高唐县",
      "type": 3,
      "path": "370000,371500,371526",
      "parentCode": "371500"
},
{
      "code": "371581",
      "name": "临清市",
      "type": 3,
      "path": "370000,371500,371581",
      "parentCode": "371500"
},
{
      "code": "371600",
      "name": "滨州市",
      "type": 2,
      "path": "370000,371600",
      "parentCode": "370000"
},
{
      "code": "371602",
      "name": "滨城区",
      "type": 3,
      "path": "370000,371600,371602",
      "parentCode": "371600"
},
{
      "code": "371603",
      "name": "沾化区",
      "type": 3,
      "path": "370000,371600,371603",
      "parentCode": "371600"
},
{
      "code": "371621",
      "name": "惠民县",
      "type": 3,
      "path": "370000,371600,371621",
      "parentCode": "371600"
},
{
      "code": "371622",
      "name": "阳信县",
      "type": 3,
      "path": "370000,371600,371622",
      "parentCode": "371600"
},
{
      "code": "371623",
      "name": "无棣县",
      "type": 3,
      "path": "370000,371600,371623",
      "parentCode": "371600"
},
{
      "code": "371625",
      "name": "博兴县",
      "type": 3,
      "path": "370000,371600,371625",
      "parentCode": "371600"
},
{
      "code": "371626",
      "name": "邹平县",
      "type": 3,
      "path": "370000,371600,371626",
      "parentCode": "371600"
},
{
      "code": "371700",
      "name": "菏泽市",
      "type": 2,
      "path": "370000,371700",
      "parentCode": "370000"
},
{
      "code": "371702",
      "name": "牡丹区",
      "type": 3,
      "path": "370000,371700,371702",
      "parentCode": "371700"
},
{
      "code": "371721",
      "name": "曹县",
      "type": 3,
      "path": "370000,371700,371721",
      "parentCode": "371700"
},
{
      "code": "371722",
      "name": "单县",
      "type": 3,
      "path": "370000,371700,371722",
      "parentCode": "371700"
},
{
      "code": "371723",
      "name": "成武县",
      "type": 3,
      "path": "370000,371700,371723",
      "parentCode": "371700"
},
{
      "code": "371724",
      "name": "巨野县",
      "type": 3,
      "path": "370000,371700,371724",
      "parentCode": "371700"
},
{
      "code": "371725",
      "name": "郓城县",
      "type": 3,
      "path": "370000,371700,371725",
      "parentCode": "371700"
},
{
      "code": "371726",
      "name": "鄄城县",
      "type": 3,
      "path": "370000,371700,371726",
      "parentCode": "371700"
},
{
      "code": "371727",
      "name": "定陶县",
      "type": 3,
      "path": "370000,371700,371727",
      "parentCode": "371700"
},
{
      "code": "371728",
      "name": "东明县",
      "type": 3,
      "path": "370000,371700,371728",
      "parentCode": "371700"
},
{
      "code": "410000",
      "name": "河南省",
      "type": 1,
      "path": "410000",
      "parentCode": null
},
{
      "code": "410100",
      "name": "郑州市",
      "type": 2,
      "path": "410000,410100",
      "parentCode": "410000"
},
{
      "code": "410102",
      "name": "中原区",
      "type": 3,
      "path": "410000,410100,410102",
      "parentCode": "410100"
},
{
      "code": "410103",
      "name": "二七区",
      "type": 3,
      "path": "410000,410100,410103",
      "parentCode": "410100"
},
{
      "code": "410104",
      "name": "管城回族区",
      "type": 3,
      "path": "410000,410100,410104",
      "parentCode": "410100"
},
{
      "code": "410105",
      "name": "金水区",
      "type": 3,
      "path": "410000,410100,410105",
      "parentCode": "410100"
},
{
      "code": "410106",
      "name": "上街区",
      "type": 3,
      "path": "410000,410100,410106",
      "parentCode": "410100"
},
{
      "code": "410108",
      "name": "惠济区",
      "type": 3,
      "path": "410000,410100,410108",
      "parentCode": "410100"
},
{
      "code": "410122",
      "name": "中牟县",
      "type": 3,
      "path": "410000,410100,410122",
      "parentCode": "410100"
},
{
      "code": "410181",
      "name": "巩义市",
      "type": 3,
      "path": "410000,410100,410181",
      "parentCode": "410100"
},
{
      "code": "410182",
      "name": "荥阳市",
      "type": 3,
      "path": "410000,410100,410182",
      "parentCode": "410100"
},
{
      "code": "410183",
      "name": "新密市",
      "type": 3,
      "path": "410000,410100,410183",
      "parentCode": "410100"
},
{
      "code": "410184",
      "name": "新郑市",
      "type": 3,
      "path": "410000,410100,410184",
      "parentCode": "410100"
},
{
      "code": "410185",
      "name": "登封市",
      "type": 3,
      "path": "410000,410100,410185",
      "parentCode": "410100"
},
{
      "code": "410200",
      "name": "开封市",
      "type": 2,
      "path": "410000,410200",
      "parentCode": "410000"
},
{
      "code": "410202",
      "name": "龙亭区",
      "type": 3,
      "path": "410000,410200,410202",
      "parentCode": "410200"
},
{
      "code": "410203",
      "name": "顺河回族区",
      "type": 3,
      "path": "410000,410200,410203",
      "parentCode": "410200"
},
{
      "code": "410204",
      "name": "鼓楼区",
      "type": 3,
      "path": "410000,410200,410204",
      "parentCode": "410200"
},
{
      "code": "410205",
      "name": "禹王台区",
      "type": 3,
      "path": "410000,410200,410205",
      "parentCode": "410200"
},
{
      "code": "410211",
      "name": "金明区",
      "type": 3,
      "path": "410000,410200,410211",
      "parentCode": "410200"
},
{
      "code": "410221",
      "name": "杞县",
      "type": 3,
      "path": "410000,410200,410221",
      "parentCode": "410200"
},
{
      "code": "410222",
      "name": "通许县",
      "type": 3,
      "path": "410000,410200,410222",
      "parentCode": "410200"
},
{
      "code": "410223",
      "name": "尉氏县",
      "type": 3,
      "path": "410000,410200,410223",
      "parentCode": "410200"
},
{
      "code": "410224",
      "name": "开封县",
      "type": 3,
      "path": "410000,410200,410224",
      "parentCode": "410200"
},
{
      "code": "410225",
      "name": "兰考县",
      "type": 3,
      "path": "410000,410200,410225",
      "parentCode": "410200"
},
{
      "code": "410300",
      "name": "洛阳市",
      "type": 2,
      "path": "410000,410300",
      "parentCode": "410000"
},
{
      "code": "410302",
      "name": "老城区",
      "type": 3,
      "path": "410000,410300,410302",
      "parentCode": "410300"
},
{
      "code": "410303",
      "name": "西工区",
      "type": 3,
      "path": "410000,410300,410303",
      "parentCode": "410300"
},
{
      "code": "410304",
      "name": "瀍河回族区",
      "type": 3,
      "path": "410000,410300,410304",
      "parentCode": "410300"
},
{
      "code": "410305",
      "name": "涧西区",
      "type": 3,
      "path": "410000,410300,410305",
      "parentCode": "410300"
},
{
      "code": "410306",
      "name": "吉利区",
      "type": 3,
      "path": "410000,410300,410306",
      "parentCode": "410300"
},
{
      "code": "410311",
      "name": "洛龙区",
      "type": 3,
      "path": "410000,410300,410311",
      "parentCode": "410300"
},
{
      "code": "410322",
      "name": "孟津县",
      "type": 3,
      "path": "410000,410300,410322",
      "parentCode": "410300"
},
{
      "code": "410323",
      "name": "新安县",
      "type": 3,
      "path": "410000,410300,410323",
      "parentCode": "410300"
},
{
      "code": "410324",
      "name": "栾川县",
      "type": 3,
      "path": "410000,410300,410324",
      "parentCode": "410300"
},
{
      "code": "410325",
      "name": "嵩县",
      "type": 3,
      "path": "410000,410300,410325",
      "parentCode": "410300"
},
{
      "code": "410326",
      "name": "汝阳县",
      "type": 3,
      "path": "410000,410300,410326",
      "parentCode": "410300"
},
{
      "code": "410327",
      "name": "宜阳县",
      "type": 3,
      "path": "410000,410300,410327",
      "parentCode": "410300"
},
{
      "code": "410328",
      "name": "洛宁县",
      "type": 3,
      "path": "410000,410300,410328",
      "parentCode": "410300"
},
{
      "code": "410329",
      "name": "伊川县",
      "type": 3,
      "path": "410000,410300,410329",
      "parentCode": "410300"
},
{
      "code": "410381",
      "name": "偃师市",
      "type": 3,
      "path": "410000,410300,410381",
      "parentCode": "410300"
},
{
      "code": "410400",
      "name": "平顶山市",
      "type": 2,
      "path": "410000,410400",
      "parentCode": "410000"
},
{
      "code": "410402",
      "name": "新华区",
      "type": 3,
      "path": "410000,410400,410402",
      "parentCode": "410400"
},
{
      "code": "410403",
      "name": "卫东区",
      "type": 3,
      "path": "410000,410400,410403",
      "parentCode": "410400"
},
{
      "code": "410404",
      "name": "石龙区",
      "type": 3,
      "path": "410000,410400,410404",
      "parentCode": "410400"
},
{
      "code": "410411",
      "name": "湛河区",
      "type": 3,
      "path": "410000,410400,410411",
      "parentCode": "410400"
},
{
      "code": "410421",
      "name": "宝丰县",
      "type": 3,
      "path": "410000,410400,410421",
      "parentCode": "410400"
},
{
      "code": "410422",
      "name": "叶县",
      "type": 3,
      "path": "410000,410400,410422",
      "parentCode": "410400"
},
{
      "code": "410423",
      "name": "鲁山县",
      "type": 3,
      "path": "410000,410400,410423",
      "parentCode": "410400"
},
{
      "code": "410425",
      "name": "郏县",
      "type": 3,
      "path": "410000,410400,410425",
      "parentCode": "410400"
},
{
      "code": "410481",
      "name": "舞钢市",
      "type": 3,
      "path": "410000,410400,410481",
      "parentCode": "410400"
},
{
      "code": "410482",
      "name": "汝州市",
      "type": 3,
      "path": "410000,410400,410482",
      "parentCode": "410400"
},
{
      "code": "410500",
      "name": "安阳市",
      "type": 2,
      "path": "410000,410500",
      "parentCode": "410000"
},
{
      "code": "410502",
      "name": "文峰区",
      "type": 3,
      "path": "410000,410500,410502",
      "parentCode": "410500"
},
{
      "code": "410503",
      "name": "北关区",
      "type": 3,
      "path": "410000,410500,410503",
      "parentCode": "410500"
},
{
      "code": "410505",
      "name": "殷都区",
      "type": 3,
      "path": "410000,410500,410505",
      "parentCode": "410500"
},
{
      "code": "410506",
      "name": "龙安区",
      "type": 3,
      "path": "410000,410500,410506",
      "parentCode": "410500"
},
{
      "code": "410522",
      "name": "安阳县",
      "type": 3,
      "path": "410000,410500,410522",
      "parentCode": "410500"
},
{
      "code": "410523",
      "name": "汤阴县",
      "type": 3,
      "path": "410000,410500,410523",
      "parentCode": "410500"
},
{
      "code": "410526",
      "name": "滑县",
      "type": 3,
      "path": "410000,410500,410526",
      "parentCode": "410500"
},
{
      "code": "410527",
      "name": "内黄县",
      "type": 3,
      "path": "410000,410500,410527",
      "parentCode": "410500"
},
{
      "code": "410581",
      "name": "林州市",
      "type": 3,
      "path": "410000,410500,410581",
      "parentCode": "410500"
},
{
      "code": "410600",
      "name": "鹤壁市",
      "type": 2,
      "path": "410000,410600",
      "parentCode": "410000"
},
{
      "code": "410602",
      "name": "鹤山区",
      "type": 3,
      "path": "410000,410600,410602",
      "parentCode": "410600"
},
{
      "code": "410603",
      "name": "山城区",
      "type": 3,
      "path": "410000,410600,410603",
      "parentCode": "410600"
},
{
      "code": "410611",
      "name": "淇滨区",
      "type": 3,
      "path": "410000,410600,410611",
      "parentCode": "410600"
},
{
      "code": "410621",
      "name": "浚县",
      "type": 3,
      "path": "410000,410600,410621",
      "parentCode": "410600"
},
{
      "code": "410622",
      "name": "淇县",
      "type": 3,
      "path": "410000,410600,410622",
      "parentCode": "410600"
},
{
      "code": "410700",
      "name": "新乡市",
      "type": 2,
      "path": "410000,410700",
      "parentCode": "410000"
},
{
      "code": "410702",
      "name": "红旗区",
      "type": 3,
      "path": "410000,410700,410702",
      "parentCode": "410700"
},
{
      "code": "410703",
      "name": "卫滨区",
      "type": 3,
      "path": "410000,410700,410703",
      "parentCode": "410700"
},
{
      "code": "410704",
      "name": "凤泉区",
      "type": 3,
      "path": "410000,410700,410704",
      "parentCode": "410700"
},
{
      "code": "410711",
      "name": "牧野区",
      "type": 3,
      "path": "410000,410700,410711",
      "parentCode": "410700"
},
{
      "code": "410721",
      "name": "新乡县",
      "type": 3,
      "path": "410000,410700,410721",
      "parentCode": "410700"
},
{
      "code": "410724",
      "name": "获嘉县",
      "type": 3,
      "path": "410000,410700,410724",
      "parentCode": "410700"
},
{
      "code": "410725",
      "name": "原阳县",
      "type": 3,
      "path": "410000,410700,410725",
      "parentCode": "410700"
},
{
      "code": "410726",
      "name": "延津县",
      "type": 3,
      "path": "410000,410700,410726",
      "parentCode": "410700"
},
{
      "code": "410727",
      "name": "封丘县",
      "type": 3,
      "path": "410000,410700,410727",
      "parentCode": "410700"
},
{
      "code": "410728",
      "name": "长垣县",
      "type": 3,
      "path": "410000,410700,410728",
      "parentCode": "410700"
},
{
      "code": "410781",
      "name": "卫辉市",
      "type": 3,
      "path": "410000,410700,410781",
      "parentCode": "410700"
},
{
      "code": "410782",
      "name": "辉县市",
      "type": 3,
      "path": "410000,410700,410782",
      "parentCode": "410700"
},
{
      "code": "410800",
      "name": "焦作市",
      "type": 2,
      "path": "410000,410800",
      "parentCode": "410000"
},
{
      "code": "410802",
      "name": "解放区",
      "type": 3,
      "path": "410000,410800,410802",
      "parentCode": "410800"
},
{
      "code": "410803",
      "name": "中站区",
      "type": 3,
      "path": "410000,410800,410803",
      "parentCode": "410800"
},
{
      "code": "410804",
      "name": "马村区",
      "type": 3,
      "path": "410000,410800,410804",
      "parentCode": "410800"
},
{
      "code": "410811",
      "name": "山阳区",
      "type": 3,
      "path": "410000,410800,410811",
      "parentCode": "410800"
},
{
      "code": "410821",
      "name": "修武县",
      "type": 3,
      "path": "410000,410800,410821",
      "parentCode": "410800"
},
{
      "code": "410822",
      "name": "博爱县",
      "type": 3,
      "path": "410000,410800,410822",
      "parentCode": "410800"
},
{
      "code": "410823",
      "name": "武陟县",
      "type": 3,
      "path": "410000,410800,410823",
      "parentCode": "410800"
},
{
      "code": "410825",
      "name": "温县",
      "type": 3,
      "path": "410000,410800,410825",
      "parentCode": "410800"
},
{
      "code": "410882",
      "name": "沁阳市",
      "type": 3,
      "path": "410000,410800,410882",
      "parentCode": "410800"
},
{
      "code": "410883",
      "name": "孟州市",
      "type": 3,
      "path": "410000,410800,410883",
      "parentCode": "410800"
},
{
      "code": "410900",
      "name": "濮阳市",
      "type": 2,
      "path": "410000,410900",
      "parentCode": "410000"
},
{
      "code": "410902",
      "name": "华龙区",
      "type": 3,
      "path": "410000,410900,410902",
      "parentCode": "410900"
},
{
      "code": "410922",
      "name": "清丰县",
      "type": 3,
      "path": "410000,410900,410922",
      "parentCode": "410900"
},
{
      "code": "410923",
      "name": "南乐县",
      "type": 3,
      "path": "410000,410900,410923",
      "parentCode": "410900"
},
{
      "code": "410926",
      "name": "范县",
      "type": 3,
      "path": "410000,410900,410926",
      "parentCode": "410900"
},
{
      "code": "410927",
      "name": "台前县",
      "type": 3,
      "path": "410000,410900,410927",
      "parentCode": "410900"
},
{
      "code": "410928",
      "name": "濮阳县",
      "type": 3,
      "path": "410000,410900,410928",
      "parentCode": "410900"
},
{
      "code": "411000",
      "name": "许昌市",
      "type": 2,
      "path": "410000,411000",
      "parentCode": "410000"
},
{
      "code": "411002",
      "name": "魏都区",
      "type": 3,
      "path": "410000,411000,411002",
      "parentCode": "411000"
},
{
      "code": "411023",
      "name": "许昌县",
      "type": 3,
      "path": "410000,411000,411023",
      "parentCode": "411000"
},
{
      "code": "411024",
      "name": "鄢陵县",
      "type": 3,
      "path": "410000,411000,411024",
      "parentCode": "411000"
},
{
      "code": "411025",
      "name": "襄城县",
      "type": 3,
      "path": "410000,411000,411025",
      "parentCode": "411000"
},
{
      "code": "411081",
      "name": "禹州市",
      "type": 3,
      "path": "410000,411000,411081",
      "parentCode": "411000"
},
{
      "code": "411082",
      "name": "长葛市",
      "type": 3,
      "path": "410000,411000,411082",
      "parentCode": "411000"
},
{
      "code": "411100",
      "name": "漯河市",
      "type": 2,
      "path": "410000,411100",
      "parentCode": "410000"
},
{
      "code": "411102",
      "name": "源汇区",
      "type": 3,
      "path": "410000,411100,411102",
      "parentCode": "411100"
},
{
      "code": "411103",
      "name": "郾城区",
      "type": 3,
      "path": "410000,411100,411103",
      "parentCode": "411100"
},
{
      "code": "411104",
      "name": "召陵区",
      "type": 3,
      "path": "410000,411100,411104",
      "parentCode": "411100"
},
{
      "code": "411121",
      "name": "舞阳县",
      "type": 3,
      "path": "410000,411100,411121",
      "parentCode": "411100"
},
{
      "code": "411122",
      "name": "临颍县",
      "type": 3,
      "path": "410000,411100,411122",
      "parentCode": "411100"
},
{
      "code": "411200",
      "name": "三门峡市",
      "type": 2,
      "path": "410000,411200",
      "parentCode": "410000"
},
{
      "code": "411202",
      "name": "湖滨区",
      "type": 3,
      "path": "410000,411200,411202",
      "parentCode": "411200"
},
{
      "code": "411221",
      "name": "渑池县",
      "type": 3,
      "path": "410000,411200,411221",
      "parentCode": "411200"
},
{
      "code": "411222",
      "name": "陕县",
      "type": 3,
      "path": "410000,411200,411222",
      "parentCode": "411200"
},
{
      "code": "411224",
      "name": "卢氏县",
      "type": 3,
      "path": "410000,411200,411224",
      "parentCode": "411200"
},
{
      "code": "411281",
      "name": "义马市",
      "type": 3,
      "path": "410000,411200,411281",
      "parentCode": "411200"
},
{
      "code": "411282",
      "name": "灵宝市",
      "type": 3,
      "path": "410000,411200,411282",
      "parentCode": "411200"
},
{
      "code": "411300",
      "name": "南阳市",
      "type": 2,
      "path": "410000,411300",
      "parentCode": "410000"
},
{
      "code": "411302",
      "name": "宛城区",
      "type": 3,
      "path": "410000,411300,411302",
      "parentCode": "411300"
},
{
      "code": "411303",
      "name": "卧龙区",
      "type": 3,
      "path": "410000,411300,411303",
      "parentCode": "411300"
},
{
      "code": "411321",
      "name": "南召县",
      "type": 3,
      "path": "410000,411300,411321",
      "parentCode": "411300"
},
{
      "code": "411322",
      "name": "方城县",
      "type": 3,
      "path": "410000,411300,411322",
      "parentCode": "411300"
},
{
      "code": "411323",
      "name": "西峡县",
      "type": 3,
      "path": "410000,411300,411323",
      "parentCode": "411300"
},
{
      "code": "411324",
      "name": "镇平县",
      "type": 3,
      "path": "410000,411300,411324",
      "parentCode": "411300"
},
{
      "code": "411325",
      "name": "内乡县",
      "type": 3,
      "path": "410000,411300,411325",
      "parentCode": "411300"
},
{
      "code": "411326",
      "name": "淅川县",
      "type": 3,
      "path": "410000,411300,411326",
      "parentCode": "411300"
},
{
      "code": "411327",
      "name": "社旗县",
      "type": 3,
      "path": "410000,411300,411327",
      "parentCode": "411300"
},
{
      "code": "411328",
      "name": "唐河县",
      "type": 3,
      "path": "410000,411300,411328",
      "parentCode": "411300"
},
{
      "code": "411329",
      "name": "新野县",
      "type": 3,
      "path": "410000,411300,411329",
      "parentCode": "411300"
},
{
      "code": "411330",
      "name": "桐柏县",
      "type": 3,
      "path": "410000,411300,411330",
      "parentCode": "411300"
},
{
      "code": "411381",
      "name": "邓州市",
      "type": 3,
      "path": "410000,411300,411381",
      "parentCode": "411300"
},
{
      "code": "411400",
      "name": "商丘市",
      "type": 2,
      "path": "410000,411400",
      "parentCode": "410000"
},
{
      "code": "411402",
      "name": "梁园区",
      "type": 3,
      "path": "410000,411400,411402",
      "parentCode": "411400"
},
{
      "code": "411403",
      "name": "睢阳区",
      "type": 3,
      "path": "410000,411400,411403",
      "parentCode": "411400"
},
{
      "code": "411421",
      "name": "民权县",
      "type": 3,
      "path": "410000,411400,411421",
      "parentCode": "411400"
},
{
      "code": "411422",
      "name": "睢县",
      "type": 3,
      "path": "410000,411400,411422",
      "parentCode": "411400"
},
{
      "code": "411423",
      "name": "宁陵县",
      "type": 3,
      "path": "410000,411400,411423",
      "parentCode": "411400"
},
{
      "code": "411424",
      "name": "柘城县",
      "type": 3,
      "path": "410000,411400,411424",
      "parentCode": "411400"
},
{
      "code": "411425",
      "name": "虞城县",
      "type": 3,
      "path": "410000,411400,411425",
      "parentCode": "411400"
},
{
      "code": "411426",
      "name": "夏邑县",
      "type": 3,
      "path": "410000,411400,411426",
      "parentCode": "411400"
},
{
      "code": "411481",
      "name": "永城市",
      "type": 3,
      "path": "410000,411400,411481",
      "parentCode": "411400"
},
{
      "code": "411500",
      "name": "信阳市",
      "type": 2,
      "path": "410000,411500",
      "parentCode": "410000"
},
{
      "code": "411502",
      "name": "浉河区",
      "type": 3,
      "path": "410000,411500,411502",
      "parentCode": "411500"
},
{
      "code": "411503",
      "name": "平桥区",
      "type": 3,
      "path": "410000,411500,411503",
      "parentCode": "411500"
},
{
      "code": "411521",
      "name": "罗山县",
      "type": 3,
      "path": "410000,411500,411521",
      "parentCode": "411500"
},
{
      "code": "411522",
      "name": "光山县",
      "type": 3,
      "path": "410000,411500,411522",
      "parentCode": "411500"
},
{
      "code": "411523",
      "name": "新县",
      "type": 3,
      "path": "410000,411500,411523",
      "parentCode": "411500"
},
{
      "code": "411524",
      "name": "商城县",
      "type": 3,
      "path": "410000,411500,411524",
      "parentCode": "411500"
},
{
      "code": "411525",
      "name": "固始县",
      "type": 3,
      "path": "410000,411500,411525",
      "parentCode": "411500"
},
{
      "code": "411526",
      "name": "潢川县",
      "type": 3,
      "path": "410000,411500,411526",
      "parentCode": "411500"
},
{
      "code": "411527",
      "name": "淮滨县",
      "type": 3,
      "path": "410000,411500,411527",
      "parentCode": "411500"
},
{
      "code": "411528",
      "name": "息县",
      "type": 3,
      "path": "410000,411500,411528",
      "parentCode": "411500"
},
{
      "code": "411600",
      "name": "周口市",
      "type": 2,
      "path": "410000,411600",
      "parentCode": "410000"
},
{
      "code": "411602",
      "name": "川汇区",
      "type": 3,
      "path": "410000,411600,411602",
      "parentCode": "411600"
},
{
      "code": "411621",
      "name": "扶沟县",
      "type": 3,
      "path": "410000,411600,411621",
      "parentCode": "411600"
},
{
      "code": "411622",
      "name": "西华县",
      "type": 3,
      "path": "410000,411600,411622",
      "parentCode": "411600"
},
{
      "code": "411623",
      "name": "商水县",
      "type": 3,
      "path": "410000,411600,411623",
      "parentCode": "411600"
},
{
      "code": "411624",
      "name": "沈丘县",
      "type": 3,
      "path": "410000,411600,411624",
      "parentCode": "411600"
},
{
      "code": "411625",
      "name": "郸城县",
      "type": 3,
      "path": "410000,411600,411625",
      "parentCode": "411600"
},
{
      "code": "411626",
      "name": "淮阳县",
      "type": 3,
      "path": "410000,411600,411626",
      "parentCode": "411600"
},
{
      "code": "411627",
      "name": "太康县",
      "type": 3,
      "path": "410000,411600,411627",
      "parentCode": "411600"
},
{
      "code": "411628",
      "name": "鹿邑县",
      "type": 3,
      "path": "410000,411600,411628",
      "parentCode": "411600"
},
{
      "code": "411681",
      "name": "项城市",
      "type": 3,
      "path": "410000,411600,411681",
      "parentCode": "411600"
},
{
      "code": "411700",
      "name": "驻马店市",
      "type": 2,
      "path": "410000,411700",
      "parentCode": "410000"
},
{
      "code": "411702",
      "name": "驿城区",
      "type": 3,
      "path": "410000,411700,411702",
      "parentCode": "411700"
},
{
      "code": "411721",
      "name": "西平县",
      "type": 3,
      "path": "410000,411700,411721",
      "parentCode": "411700"
},
{
      "code": "411722",
      "name": "上蔡县",
      "type": 3,
      "path": "410000,411700,411722",
      "parentCode": "411700"
},
{
      "code": "411723",
      "name": "平舆县",
      "type": 3,
      "path": "410000,411700,411723",
      "parentCode": "411700"
},
{
      "code": "411724",
      "name": "正阳县",
      "type": 3,
      "path": "410000,411700,411724",
      "parentCode": "411700"
},
{
      "code": "411725",
      "name": "确山县",
      "type": 3,
      "path": "410000,411700,411725",
      "parentCode": "411700"
},
{
      "code": "411726",
      "name": "泌阳县",
      "type": 3,
      "path": "410000,411700,411726",
      "parentCode": "411700"
},
{
      "code": "411727",
      "name": "汝南县",
      "type": 3,
      "path": "410000,411700,411727",
      "parentCode": "411700"
},
{
      "code": "411728",
      "name": "遂平县",
      "type": 3,
      "path": "410000,411700,411728",
      "parentCode": "411700"
},
{
      "code": "411729",
      "name": "新蔡县",
      "type": 3,
      "path": "410000,411700,411729",
      "parentCode": "411700"
},
{
      "code": "419000",
      "name": "河南省直辖县级行政区划",
      "type": 2,
      "path": "410000,419000",
      "parentCode": "410000"
},
{
      "code": "419001",
      "name": "济源市",
      "type": 3,
      "path": "410000,419000,419001",
      "parentCode": "419000"
},
{
      "code": "420000",
      "name": "湖北省",
      "type": 1,
      "path": "420000",
      "parentCode": null
},
{
      "code": "420100",
      "name": "武汉市",
      "type": 2,
      "path": "420000,420100",
      "parentCode": "420000"
},
{
      "code": "420102",
      "name": "江岸区",
      "type": 3,
      "path": "420000,420100,420102",
      "parentCode": "420100"
},
{
      "code": "420103",
      "name": "江汉区",
      "type": 3,
      "path": "420000,420100,420103",
      "parentCode": "420100"
},
{
      "code": "420104",
      "name": "硚口区",
      "type": 3,
      "path": "420000,420100,420104",
      "parentCode": "420100"
},
{
      "code": "420105",
      "name": "汉阳区",
      "type": 3,
      "path": "420000,420100,420105",
      "parentCode": "420100"
},
{
      "code": "420106",
      "name": "武昌区",
      "type": 3,
      "path": "420000,420100,420106",
      "parentCode": "420100"
},
{
      "code": "420107",
      "name": "青山区",
      "type": 3,
      "path": "420000,420100,420107",
      "parentCode": "420100"
},
{
      "code": "420111",
      "name": "洪山区",
      "type": 3,
      "path": "420000,420100,420111",
      "parentCode": "420100"
},
{
      "code": "420112",
      "name": "东西湖区",
      "type": 3,
      "path": "420000,420100,420112",
      "parentCode": "420100"
},
{
      "code": "420113",
      "name": "汉南区",
      "type": 3,
      "path": "420000,420100,420113",
      "parentCode": "420100"
},
{
      "code": "420114",
      "name": "蔡甸区",
      "type": 3,
      "path": "420000,420100,420114",
      "parentCode": "420100"
},
{
      "code": "420115",
      "name": "江夏区",
      "type": 3,
      "path": "420000,420100,420115",
      "parentCode": "420100"
},
{
      "code": "420116",
      "name": "黄陂区",
      "type": 3,
      "path": "420000,420100,420116",
      "parentCode": "420100"
},
{
      "code": "420117",
      "name": "新洲区",
      "type": 3,
      "path": "420000,420100,420117",
      "parentCode": "420100"
},
{
      "code": "420200",
      "name": "黄石市",
      "type": 2,
      "path": "420000,420200",
      "parentCode": "420000"
},
{
      "code": "420202",
      "name": "黄石港区",
      "type": 3,
      "path": "420000,420200,420202",
      "parentCode": "420200"
},
{
      "code": "420203",
      "name": "西塞山区",
      "type": 3,
      "path": "420000,420200,420203",
      "parentCode": "420200"
},
{
      "code": "420204",
      "name": "下陆区",
      "type": 3,
      "path": "420000,420200,420204",
      "parentCode": "420200"
},
{
      "code": "420205",
      "name": "铁山区",
      "type": 3,
      "path": "420000,420200,420205",
      "parentCode": "420200"
},
{
      "code": "420222",
      "name": "阳新县",
      "type": 3,
      "path": "420000,420200,420222",
      "parentCode": "420200"
},
{
      "code": "420281",
      "name": "大冶市",
      "type": 3,
      "path": "420000,420200,420281",
      "parentCode": "420200"
},
{
      "code": "420300",
      "name": "十堰市",
      "type": 2,
      "path": "420000,420300",
      "parentCode": "420000"
},
{
      "code": "420302",
      "name": "茅箭区",
      "type": 3,
      "path": "420000,420300,420302",
      "parentCode": "420300"
},
{
      "code": "420303",
      "name": "张湾区",
      "type": 3,
      "path": "420000,420300,420303",
      "parentCode": "420300"
},
{
      "code": "420304",
      "name": "郧阳区",
      "type": 3,
      "path": "420000,420300,420304",
      "parentCode": "420300"
},
{
      "code": "420322",
      "name": "郧西县",
      "type": 3,
      "path": "420000,420300,420322",
      "parentCode": "420300"
},
{
      "code": "420323",
      "name": "竹山县",
      "type": 3,
      "path": "420000,420300,420323",
      "parentCode": "420300"
},
{
      "code": "420324",
      "name": "竹溪县",
      "type": 3,
      "path": "420000,420300,420324",
      "parentCode": "420300"
},
{
      "code": "420325",
      "name": "房县",
      "type": 3,
      "path": "420000,420300,420325",
      "parentCode": "420300"
},
{
      "code": "420381",
      "name": "丹江口市",
      "type": 3,
      "path": "420000,420300,420381",
      "parentCode": "420300"
},
{
      "code": "420500",
      "name": "宜昌市",
      "type": 2,
      "path": "420000,420500",
      "parentCode": "420000"
},
{
      "code": "420502",
      "name": "西陵区",
      "type": 3,
      "path": "420000,420500,420502",
      "parentCode": "420500"
},
{
      "code": "420503",
      "name": "伍家岗区",
      "type": 3,
      "path": "420000,420500,420503",
      "parentCode": "420500"
},
{
      "code": "420504",
      "name": "点军区",
      "type": 3,
      "path": "420000,420500,420504",
      "parentCode": "420500"
},
{
      "code": "420505",
      "name": "猇亭区",
      "type": 3,
      "path": "420000,420500,420505",
      "parentCode": "420500"
},
{
      "code": "420506",
      "name": "夷陵区",
      "type": 3,
      "path": "420000,420500,420506",
      "parentCode": "420500"
},
{
      "code": "420525",
      "name": "远安县",
      "type": 3,
      "path": "420000,420500,420525",
      "parentCode": "420500"
},
{
      "code": "420526",
      "name": "兴山县",
      "type": 3,
      "path": "420000,420500,420526",
      "parentCode": "420500"
},
{
      "code": "420527",
      "name": "秭归县",
      "type": 3,
      "path": "420000,420500,420527",
      "parentCode": "420500"
},
{
      "code": "420528",
      "name": "长阳土家族自治县",
      "type": 3,
      "path": "420000,420500,420528",
      "parentCode": "420500"
},
{
      "code": "420529",
      "name": "五峰土家族自治县",
      "type": 3,
      "path": "420000,420500,420529",
      "parentCode": "420500"
},
{
      "code": "420581",
      "name": "宜都市",
      "type": 3,
      "path": "420000,420500,420581",
      "parentCode": "420500"
},
{
      "code": "420582",
      "name": "当阳市",
      "type": 3,
      "path": "420000,420500,420582",
      "parentCode": "420500"
},
{
      "code": "420583",
      "name": "枝江市",
      "type": 3,
      "path": "420000,420500,420583",
      "parentCode": "420500"
},
{
      "code": "420600",
      "name": "襄樊市",
      "type": 2,
      "path": "420000,420600",
      "parentCode": "420000"
},
{
      "code": "420602",
      "name": "襄城区",
      "type": 3,
      "path": "420000,420600,420602",
      "parentCode": "420600"
},
{
      "code": "420606",
      "name": "樊城区",
      "type": 3,
      "path": "420000,420600,420606",
      "parentCode": "420600"
},
{
      "code": "420607",
      "name": "襄州区",
      "type": 3,
      "path": "420000,420600,420607",
      "parentCode": "420600"
},
{
      "code": "420624",
      "name": "南漳县",
      "type": 3,
      "path": "420000,420600,420624",
      "parentCode": "420600"
},
{
      "code": "420625",
      "name": "谷城县",
      "type": 3,
      "path": "420000,420600,420625",
      "parentCode": "420600"
},
{
      "code": "420626",
      "name": "保康县",
      "type": 3,
      "path": "420000,420600,420626",
      "parentCode": "420600"
},
{
      "code": "420682",
      "name": "老河口市",
      "type": 3,
      "path": "420000,420600,420682",
      "parentCode": "420600"
},
{
      "code": "420683",
      "name": "枣阳市",
      "type": 3,
      "path": "420000,420600,420683",
      "parentCode": "420600"
},
{
      "code": "420684",
      "name": "宜城市",
      "type": 3,
      "path": "420000,420600,420684",
      "parentCode": "420600"
},
{
      "code": "420700",
      "name": "鄂州市",
      "type": 2,
      "path": "420000,420700",
      "parentCode": "420000"
},
{
      "code": "420702",
      "name": "梁子湖区",
      "type": 3,
      "path": "420000,420700,420702",
      "parentCode": "420700"
},
{
      "code": "420703",
      "name": "华容区",
      "type": 3,
      "path": "420000,420700,420703",
      "parentCode": "420700"
},
{
      "code": "420704",
      "name": "鄂城区",
      "type": 3,
      "path": "420000,420700,420704",
      "parentCode": "420700"
},
{
      "code": "420800",
      "name": "荆门市",
      "type": 2,
      "path": "420000,420800",
      "parentCode": "420000"
},
{
      "code": "420802",
      "name": "东宝区",
      "type": 3,
      "path": "420000,420800,420802",
      "parentCode": "420800"
},
{
      "code": "420804",
      "name": "掇刀区",
      "type": 3,
      "path": "420000,420800,420804",
      "parentCode": "420800"
},
{
      "code": "420821",
      "name": "京山县",
      "type": 3,
      "path": "420000,420800,420821",
      "parentCode": "420800"
},
{
      "code": "420822",
      "name": "沙洋县",
      "type": 3,
      "path": "420000,420800,420822",
      "parentCode": "420800"
},
{
      "code": "420881",
      "name": "钟祥市",
      "type": 3,
      "path": "420000,420800,420881",
      "parentCode": "420800"
},
{
      "code": "420900",
      "name": "孝感市",
      "type": 2,
      "path": "420000,420900",
      "parentCode": "420000"
},
{
      "code": "420902",
      "name": "孝南区",
      "type": 3,
      "path": "420000,420900,420902",
      "parentCode": "420900"
},
{
      "code": "420921",
      "name": "孝昌县",
      "type": 3,
      "path": "420000,420900,420921",
      "parentCode": "420900"
},
{
      "code": "420922",
      "name": "大悟县",
      "type": 3,
      "path": "420000,420900,420922",
      "parentCode": "420900"
},
{
      "code": "420923",
      "name": "云梦县",
      "type": 3,
      "path": "420000,420900,420923",
      "parentCode": "420900"
},
{
      "code": "420981",
      "name": "应城市",
      "type": 3,
      "path": "420000,420900,420981",
      "parentCode": "420900"
},
{
      "code": "420982",
      "name": "安陆市",
      "type": 3,
      "path": "420000,420900,420982",
      "parentCode": "420900"
},
{
      "code": "420984",
      "name": "汉川市",
      "type": 3,
      "path": "420000,420900,420984",
      "parentCode": "420900"
},
{
      "code": "421000",
      "name": "荆州市",
      "type": 2,
      "path": "420000,421000",
      "parentCode": "420000"
},
{
      "code": "421002",
      "name": "沙市区",
      "type": 3,
      "path": "420000,421000,421002",
      "parentCode": "421000"
},
{
      "code": "421003",
      "name": "荆州区",
      "type": 3,
      "path": "420000,421000,421003",
      "parentCode": "421000"
},
{
      "code": "421022",
      "name": "公安县",
      "type": 3,
      "path": "420000,421000,421022",
      "parentCode": "421000"
},
{
      "code": "421023",
      "name": "监利县",
      "type": 3,
      "path": "420000,421000,421023",
      "parentCode": "421000"
},
{
      "code": "421024",
      "name": "江陵县",
      "type": 3,
      "path": "420000,421000,421024",
      "parentCode": "421000"
},
{
      "code": "421081",
      "name": "石首市",
      "type": 3,
      "path": "420000,421000,421081",
      "parentCode": "421000"
},
{
      "code": "421083",
      "name": "洪湖市",
      "type": 3,
      "path": "420000,421000,421083",
      "parentCode": "421000"
},
{
      "code": "421087",
      "name": "松滋市",
      "type": 3,
      "path": "420000,421000,421087",
      "parentCode": "421000"
},
{
      "code": "421100",
      "name": "黄冈市",
      "type": 2,
      "path": "420000,421100",
      "parentCode": "420000"
},
{
      "code": "421102",
      "name": "黄州区",
      "type": 3,
      "path": "420000,421100,421102",
      "parentCode": "421100"
},
{
      "code": "421121",
      "name": "团风县",
      "type": 3,
      "path": "420000,421100,421121",
      "parentCode": "421100"
},
{
      "code": "421122",
      "name": "红安县",
      "type": 3,
      "path": "420000,421100,421122",
      "parentCode": "421100"
},
{
      "code": "421123",
      "name": "罗田县",
      "type": 3,
      "path": "420000,421100,421123",
      "parentCode": "421100"
},
{
      "code": "421124",
      "name": "英山县",
      "type": 3,
      "path": "420000,421100,421124",
      "parentCode": "421100"
},
{
      "code": "421125",
      "name": "浠水县",
      "type": 3,
      "path": "420000,421100,421125",
      "parentCode": "421100"
},
{
      "code": "421126",
      "name": "蕲春县",
      "type": 3,
      "path": "420000,421100,421126",
      "parentCode": "421100"
},
{
      "code": "421127",
      "name": "黄梅县",
      "type": 3,
      "path": "420000,421100,421127",
      "parentCode": "421100"
},
{
      "code": "421181",
      "name": "麻城市",
      "type": 3,
      "path": "420000,421100,421181",
      "parentCode": "421100"
},
{
      "code": "421182",
      "name": "武穴市",
      "type": 3,
      "path": "420000,421100,421182",
      "parentCode": "421100"
},
{
      "code": "421200",
      "name": "咸宁市",
      "type": 2,
      "path": "420000,421200",
      "parentCode": "420000"
},
{
      "code": "421202",
      "name": "咸安区",
      "type": 3,
      "path": "420000,421200,421202",
      "parentCode": "421200"
},
{
      "code": "421221",
      "name": "嘉鱼县",
      "type": 3,
      "path": "420000,421200,421221",
      "parentCode": "421200"
},
{
      "code": "421222",
      "name": "通城县",
      "type": 3,
      "path": "420000,421200,421222",
      "parentCode": "421200"
},
{
      "code": "421223",
      "name": "崇阳县",
      "type": 3,
      "path": "420000,421200,421223",
      "parentCode": "421200"
},
{
      "code": "421224",
      "name": "通山县",
      "type": 3,
      "path": "420000,421200,421224",
      "parentCode": "421200"
},
{
      "code": "421281",
      "name": "赤壁市",
      "type": 3,
      "path": "420000,421200,421281",
      "parentCode": "421200"
},
{
      "code": "421300",
      "name": "随州市",
      "type": 2,
      "path": "420000,421300",
      "parentCode": "420000"
},
{
      "code": "421303",
      "name": "曾都区",
      "type": 3,
      "path": "420000,421300,421303",
      "parentCode": "421300"
},
{
      "code": "421321",
      "name": "随县",
      "type": 3,
      "path": "420000,421300,421321",
      "parentCode": "421300"
},
{
      "code": "421381",
      "name": "广水市",
      "type": 3,
      "path": "420000,421300,421381",
      "parentCode": "421300"
},
{
      "code": "422800",
      "name": "恩施土家族苗族自治州",
      "type": 2,
      "path": "420000,422800",
      "parentCode": "420000"
},
{
      "code": "422801",
      "name": "恩施市",
      "type": 3,
      "path": "420000,422800,422801",
      "parentCode": "422800"
},
{
      "code": "422802",
      "name": "利川市",
      "type": 3,
      "path": "420000,422800,422802",
      "parentCode": "422800"
},
{
      "code": "422822",
      "name": "建始县",
      "type": 3,
      "path": "420000,422800,422822",
      "parentCode": "422800"
},
{
      "code": "422823",
      "name": "巴东县",
      "type": 3,
      "path": "420000,422800,422823",
      "parentCode": "422800"
},
{
      "code": "422825",
      "name": "宣恩县",
      "type": 3,
      "path": "420000,422800,422825",
      "parentCode": "422800"
},
{
      "code": "422826",
      "name": "咸丰县",
      "type": 3,
      "path": "420000,422800,422826",
      "parentCode": "422800"
},
{
      "code": "422827",
      "name": "来凤县",
      "type": 3,
      "path": "420000,422800,422827",
      "parentCode": "422800"
},
{
      "code": "422828",
      "name": "鹤峰县",
      "type": 3,
      "path": "420000,422800,422828",
      "parentCode": "422800"
},
{
      "code": "429000",
      "name": "省直辖行政单位",
      "type": 2,
      "path": "420000,429000",
      "parentCode": "420000"
},
{
      "code": "429004",
      "name": "仙桃市",
      "type": 3,
      "path": "420000,429000,429004",
      "parentCode": "429000"
},
{
      "code": "429005",
      "name": "潜江市",
      "type": 3,
      "path": "420000,429000,429005",
      "parentCode": "429000"
},
{
      "code": "429006",
      "name": "天门市",
      "type": 3,
      "path": "420000,429000,429006",
      "parentCode": "429000"
},
{
      "code": "429021",
      "name": "神农架林区",
      "type": 3,
      "path": "420000,429000,429021",
      "parentCode": "429000"
},
{
      "code": "430000",
      "name": "湖南省",
      "type": 1,
      "path": "430000",
      "parentCode": null
},
{
      "code": "430100",
      "name": "长沙市",
      "type": 2,
      "path": "430000,430100",
      "parentCode": "430000"
},
{
      "code": "430102",
      "name": "芙蓉区",
      "type": 3,
      "path": "430000,430100,430102",
      "parentCode": "430100"
},
{
      "code": "430103",
      "name": "天心区",
      "type": 3,
      "path": "430000,430100,430103",
      "parentCode": "430100"
},
{
      "code": "430104",
      "name": "岳麓区",
      "type": 3,
      "path": "430000,430100,430104",
      "parentCode": "430100"
},
{
      "code": "430105",
      "name": "开福区",
      "type": 3,
      "path": "430000,430100,430105",
      "parentCode": "430100"
},
{
      "code": "430111",
      "name": "雨花区",
      "type": 3,
      "path": "430000,430100,430111",
      "parentCode": "430100"
},
{
      "code": "430112",
      "name": "望城区",
      "type": 3,
      "path": "430000,430100,430112",
      "parentCode": "430100"
},
{
      "code": "430121",
      "name": "长沙县",
      "type": 3,
      "path": "430000,430100,430121",
      "parentCode": "430100"
},
{
      "code": "430124",
      "name": "宁乡县",
      "type": 3,
      "path": "430000,430100,430124",
      "parentCode": "430100"
},
{
      "code": "430181",
      "name": "浏阳市",
      "type": 3,
      "path": "430000,430100,430181",
      "parentCode": "430100"
},
{
      "code": "430200",
      "name": "株洲市",
      "type": 2,
      "path": "430000,430200",
      "parentCode": "430000"
},
{
      "code": "430202",
      "name": "荷塘区",
      "type": 3,
      "path": "430000,430200,430202",
      "parentCode": "430200"
},
{
      "code": "430203",
      "name": "芦淞区",
      "type": 3,
      "path": "430000,430200,430203",
      "parentCode": "430200"
},
{
      "code": "430204",
      "name": "石峰区",
      "type": 3,
      "path": "430000,430200,430204",
      "parentCode": "430200"
},
{
      "code": "430211",
      "name": "天元区",
      "type": 3,
      "path": "430000,430200,430211",
      "parentCode": "430200"
},
{
      "code": "430221",
      "name": "株洲县",
      "type": 3,
      "path": "430000,430200,430221",
      "parentCode": "430200"
},
{
      "code": "430223",
      "name": "攸县",
      "type": 3,
      "path": "430000,430200,430223",
      "parentCode": "430200"
},
{
      "code": "430224",
      "name": "茶陵县",
      "type": 3,
      "path": "430000,430200,430224",
      "parentCode": "430200"
},
{
      "code": "430225",
      "name": "炎陵县",
      "type": 3,
      "path": "430000,430200,430225",
      "parentCode": "430200"
},
{
      "code": "430281",
      "name": "醴陵市",
      "type": 3,
      "path": "430000,430200,430281",
      "parentCode": "430200"
},
{
      "code": "430300",
      "name": "湘潭市",
      "type": 2,
      "path": "430000,430300",
      "parentCode": "430000"
},
{
      "code": "430302",
      "name": "雨湖区",
      "type": 3,
      "path": "430000,430300,430302",
      "parentCode": "430300"
},
{
      "code": "430304",
      "name": "岳塘区",
      "type": 3,
      "path": "430000,430300,430304",
      "parentCode": "430300"
},
{
      "code": "430321",
      "name": "湘潭县",
      "type": 3,
      "path": "430000,430300,430321",
      "parentCode": "430300"
},
{
      "code": "430381",
      "name": "湘乡市",
      "type": 3,
      "path": "430000,430300,430381",
      "parentCode": "430300"
},
{
      "code": "430382",
      "name": "韶山市",
      "type": 3,
      "path": "430000,430300,430382",
      "parentCode": "430300"
},
{
      "code": "430400",
      "name": "衡阳市",
      "type": 2,
      "path": "430000,430400",
      "parentCode": "430000"
},
{
      "code": "430405",
      "name": "珠晖区",
      "type": 3,
      "path": "430000,430400,430405",
      "parentCode": "430400"
},
{
      "code": "430406",
      "name": "雁峰区",
      "type": 3,
      "path": "430000,430400,430406",
      "parentCode": "430400"
},
{
      "code": "430407",
      "name": "石鼓区",
      "type": 3,
      "path": "430000,430400,430407",
      "parentCode": "430400"
},
{
      "code": "430408",
      "name": "蒸湘区",
      "type": 3,
      "path": "430000,430400,430408",
      "parentCode": "430400"
},
{
      "code": "430412",
      "name": "南岳区",
      "type": 3,
      "path": "430000,430400,430412",
      "parentCode": "430400"
},
{
      "code": "430421",
      "name": "衡阳县",
      "type": 3,
      "path": "430000,430400,430421",
      "parentCode": "430400"
},
{
      "code": "430422",
      "name": "衡南县",
      "type": 3,
      "path": "430000,430400,430422",
      "parentCode": "430400"
},
{
      "code": "430423",
      "name": "衡山县",
      "type": 3,
      "path": "430000,430400,430423",
      "parentCode": "430400"
},
{
      "code": "430424",
      "name": "衡东县",
      "type": 3,
      "path": "430000,430400,430424",
      "parentCode": "430400"
},
{
      "code": "430426",
      "name": "祁东县",
      "type": 3,
      "path": "430000,430400,430426",
      "parentCode": "430400"
},
{
      "code": "430481",
      "name": "耒阳市",
      "type": 3,
      "path": "430000,430400,430481",
      "parentCode": "430400"
},
{
      "code": "430482",
      "name": "常宁市",
      "type": 3,
      "path": "430000,430400,430482",
      "parentCode": "430400"
},
{
      "code": "430500",
      "name": "邵阳市",
      "type": 2,
      "path": "430000,430500",
      "parentCode": "430000"
},
{
      "code": "430502",
      "name": "双清区",
      "type": 3,
      "path": "430000,430500,430502",
      "parentCode": "430500"
},
{
      "code": "430503",
      "name": "大祥区",
      "type": 3,
      "path": "430000,430500,430503",
      "parentCode": "430500"
},
{
      "code": "430511",
      "name": "北塔区",
      "type": 3,
      "path": "430000,430500,430511",
      "parentCode": "430500"
},
{
      "code": "430521",
      "name": "邵东县",
      "type": 3,
      "path": "430000,430500,430521",
      "parentCode": "430500"
},
{
      "code": "430522",
      "name": "新邵县",
      "type": 3,
      "path": "430000,430500,430522",
      "parentCode": "430500"
},
{
      "code": "430523",
      "name": "邵阳县",
      "type": 3,
      "path": "430000,430500,430523",
      "parentCode": "430500"
},
{
      "code": "430524",
      "name": "隆回县",
      "type": 3,
      "path": "430000,430500,430524",
      "parentCode": "430500"
},
{
      "code": "430525",
      "name": "洞口县",
      "type": 3,
      "path": "430000,430500,430525",
      "parentCode": "430500"
},
{
      "code": "430527",
      "name": "绥宁县",
      "type": 3,
      "path": "430000,430500,430527",
      "parentCode": "430500"
},
{
      "code": "430528",
      "name": "新宁县",
      "type": 3,
      "path": "430000,430500,430528",
      "parentCode": "430500"
},
{
      "code": "430529",
      "name": "城步苗族自治县",
      "type": 3,
      "path": "430000,430500,430529",
      "parentCode": "430500"
},
{
      "code": "430581",
      "name": "武冈市",
      "type": 3,
      "path": "430000,430500,430581",
      "parentCode": "430500"
},
{
      "code": "430600",
      "name": "岳阳市",
      "type": 2,
      "path": "430000,430600",
      "parentCode": "430000"
},
{
      "code": "430602",
      "name": "岳阳楼区",
      "type": 3,
      "path": "430000,430600,430602",
      "parentCode": "430600"
},
{
      "code": "430603",
      "name": "云溪区",
      "type": 3,
      "path": "430000,430600,430603",
      "parentCode": "430600"
},
{
      "code": "430611",
      "name": "君山区",
      "type": 3,
      "path": "430000,430600,430611",
      "parentCode": "430600"
},
{
      "code": "430621",
      "name": "岳阳县",
      "type": 3,
      "path": "430000,430600,430621",
      "parentCode": "430600"
},
{
      "code": "430623",
      "name": "华容县",
      "type": 3,
      "path": "430000,430600,430623",
      "parentCode": "430600"
},
{
      "code": "430624",
      "name": "湘阴县",
      "type": 3,
      "path": "430000,430600,430624",
      "parentCode": "430600"
},
{
      "code": "430626",
      "name": "平江县",
      "type": 3,
      "path": "430000,430600,430626",
      "parentCode": "430600"
},
{
      "code": "430681",
      "name": "汨罗市",
      "type": 3,
      "path": "430000,430600,430681",
      "parentCode": "430600"
},
{
      "code": "430682",
      "name": "临湘市",
      "type": 3,
      "path": "430000,430600,430682",
      "parentCode": "430600"
},
{
      "code": "430700",
      "name": "常德市",
      "type": 2,
      "path": "430000,430700",
      "parentCode": "430000"
},
{
      "code": "430702",
      "name": "武陵区",
      "type": 3,
      "path": "430000,430700,430702",
      "parentCode": "430700"
},
{
      "code": "430703",
      "name": "鼎城区",
      "type": 3,
      "path": "430000,430700,430703",
      "parentCode": "430700"
},
{
      "code": "430721",
      "name": "安乡县",
      "type": 3,
      "path": "430000,430700,430721",
      "parentCode": "430700"
},
{
      "code": "430722",
      "name": "汉寿县",
      "type": 3,
      "path": "430000,430700,430722",
      "parentCode": "430700"
},
{
      "code": "430723",
      "name": "澧县",
      "type": 3,
      "path": "430000,430700,430723",
      "parentCode": "430700"
},
{
      "code": "430724",
      "name": "临澧县",
      "type": 3,
      "path": "430000,430700,430724",
      "parentCode": "430700"
},
{
      "code": "430725",
      "name": "桃源县",
      "type": 3,
      "path": "430000,430700,430725",
      "parentCode": "430700"
},
{
      "code": "430726",
      "name": "石门县",
      "type": 3,
      "path": "430000,430700,430726",
      "parentCode": "430700"
},
{
      "code": "430781",
      "name": "津市市",
      "type": 3,
      "path": "430000,430700,430781",
      "parentCode": "430700"
},
{
      "code": "430800",
      "name": "张家界市",
      "type": 2,
      "path": "430000,430800",
      "parentCode": "430000"
},
{
      "code": "430802",
      "name": "永定区",
      "type": 3,
      "path": "430000,430800,430802",
      "parentCode": "430800"
},
{
      "code": "430811",
      "name": "武陵源区",
      "type": 3,
      "path": "430000,430800,430811",
      "parentCode": "430800"
},
{
      "code": "430821",
      "name": "慈利县",
      "type": 3,
      "path": "430000,430800,430821",
      "parentCode": "430800"
},
{
      "code": "430822",
      "name": "桑植县",
      "type": 3,
      "path": "430000,430800,430822",
      "parentCode": "430800"
},
{
      "code": "430900",
      "name": "益阳市",
      "type": 2,
      "path": "430000,430900",
      "parentCode": "430000"
},
{
      "code": "430902",
      "name": "资阳区",
      "type": 3,
      "path": "430000,430900,430902",
      "parentCode": "430900"
},
{
      "code": "430903",
      "name": "赫山区",
      "type": 3,
      "path": "430000,430900,430903",
      "parentCode": "430900"
},
{
      "code": "430921",
      "name": "南县",
      "type": 3,
      "path": "430000,430900,430921",
      "parentCode": "430900"
},
{
      "code": "430922",
      "name": "桃江县",
      "type": 3,
      "path": "430000,430900,430922",
      "parentCode": "430900"
},
{
      "code": "430923",
      "name": "安化县",
      "type": 3,
      "path": "430000,430900,430923",
      "parentCode": "430900"
},
{
      "code": "430981",
      "name": "沅江市",
      "type": 3,
      "path": "430000,430900,430981",
      "parentCode": "430900"
},
{
      "code": "431000",
      "name": "郴州市",
      "type": 2,
      "path": "430000,431000",
      "parentCode": "430000"
},
{
      "code": "431002",
      "name": "北湖区",
      "type": 3,
      "path": "430000,431000,431002",
      "parentCode": "431000"
},
{
      "code": "431003",
      "name": "苏仙区",
      "type": 3,
      "path": "430000,431000,431003",
      "parentCode": "431000"
},
{
      "code": "431021",
      "name": "桂阳县",
      "type": 3,
      "path": "430000,431000,431021",
      "parentCode": "431000"
},
{
      "code": "431022",
      "name": "宜章县",
      "type": 3,
      "path": "430000,431000,431022",
      "parentCode": "431000"
},
{
      "code": "431023",
      "name": "永兴县",
      "type": 3,
      "path": "430000,431000,431023",
      "parentCode": "431000"
},
{
      "code": "431024",
      "name": "嘉禾县",
      "type": 3,
      "path": "430000,431000,431024",
      "parentCode": "431000"
},
{
      "code": "431025",
      "name": "临武县",
      "type": 3,
      "path": "430000,431000,431025",
      "parentCode": "431000"
},
{
      "code": "431026",
      "name": "汝城县",
      "type": 3,
      "path": "430000,431000,431026",
      "parentCode": "431000"
},
{
      "code": "431027",
      "name": "桂东县",
      "type": 3,
      "path": "430000,431000,431027",
      "parentCode": "431000"
},
{
      "code": "431028",
      "name": "安仁县",
      "type": 3,
      "path": "430000,431000,431028",
      "parentCode": "431000"
},
{
      "code": "431081",
      "name": "资兴市",
      "type": 3,
      "path": "430000,431000,431081",
      "parentCode": "431000"
},
{
      "code": "431100",
      "name": "永州市",
      "type": 2,
      "path": "430000,431100",
      "parentCode": "430000"
},
{
      "code": "431102",
      "name": "零陵区",
      "type": 3,
      "path": "430000,431100,431102",
      "parentCode": "431100"
},
{
      "code": "431103",
      "name": "冷水滩区",
      "type": 3,
      "path": "430000,431100,431103",
      "parentCode": "431100"
},
{
      "code": "431121",
      "name": "祁阳县",
      "type": 3,
      "path": "430000,431100,431121",
      "parentCode": "431100"
},
{
      "code": "431122",
      "name": "东安县",
      "type": 3,
      "path": "430000,431100,431122",
      "parentCode": "431100"
},
{
      "code": "431123",
      "name": "双牌县",
      "type": 3,
      "path": "430000,431100,431123",
      "parentCode": "431100"
},
{
      "code": "431124",
      "name": "道县",
      "type": 3,
      "path": "430000,431100,431124",
      "parentCode": "431100"
},
{
      "code": "431125",
      "name": "江永县",
      "type": 3,
      "path": "430000,431100,431125",
      "parentCode": "431100"
},
{
      "code": "431126",
      "name": "宁远县",
      "type": 3,
      "path": "430000,431100,431126",
      "parentCode": "431100"
},
{
      "code": "431127",
      "name": "蓝山县",
      "type": 3,
      "path": "430000,431100,431127",
      "parentCode": "431100"
},
{
      "code": "431128",
      "name": "新田县",
      "type": 3,
      "path": "430000,431100,431128",
      "parentCode": "431100"
},
{
      "code": "431129",
      "name": "江华瑶族自治县",
      "type": 3,
      "path": "430000,431100,431129",
      "parentCode": "431100"
},
{
      "code": "431200",
      "name": "怀化市",
      "type": 2,
      "path": "430000,431200",
      "parentCode": "430000"
},
{
      "code": "431202",
      "name": "鹤城区",
      "type": 3,
      "path": "430000,431200,431202",
      "parentCode": "431200"
},
{
      "code": "431221",
      "name": "中方县",
      "type": 3,
      "path": "430000,431200,431221",
      "parentCode": "431200"
},
{
      "code": "431222",
      "name": "沅陵县",
      "type": 3,
      "path": "430000,431200,431222",
      "parentCode": "431200"
},
{
      "code": "431223",
      "name": "辰溪县",
      "type": 3,
      "path": "430000,431200,431223",
      "parentCode": "431200"
},
{
      "code": "431224",
      "name": "溆浦县",
      "type": 3,
      "path": "430000,431200,431224",
      "parentCode": "431200"
},
{
      "code": "431225",
      "name": "会同县",
      "type": 3,
      "path": "430000,431200,431225",
      "parentCode": "431200"
},
{
      "code": "431226",
      "name": "麻阳苗族自治县",
      "type": 3,
      "path": "430000,431200,431226",
      "parentCode": "431200"
},
{
      "code": "431227",
      "name": "新晃侗族自治县",
      "type": 3,
      "path": "430000,431200,431227",
      "parentCode": "431200"
},
{
      "code": "431228",
      "name": "芷江侗族自治县",
      "type": 3,
      "path": "430000,431200,431228",
      "parentCode": "431200"
},
{
      "code": "431229",
      "name": "靖州苗族侗族自治县",
      "type": 3,
      "path": "430000,431200,431229",
      "parentCode": "431200"
},
{
      "code": "431230",
      "name": "通道侗族自治县",
      "type": 3,
      "path": "430000,431200,431230",
      "parentCode": "431200"
},
{
      "code": "431281",
      "name": "洪江市",
      "type": 3,
      "path": "430000,431200,431281",
      "parentCode": "431200"
},
{
      "code": "431300",
      "name": "娄底市",
      "type": 2,
      "path": "430000,431300",
      "parentCode": "430000"
},
{
      "code": "431302",
      "name": "娄星区",
      "type": 3,
      "path": "430000,431300,431302",
      "parentCode": "431300"
},
{
      "code": "431321",
      "name": "双峰县",
      "type": 3,
      "path": "430000,431300,431321",
      "parentCode": "431300"
},
{
      "code": "431322",
      "name": "新化县",
      "type": 3,
      "path": "430000,431300,431322",
      "parentCode": "431300"
},
{
      "code": "431381",
      "name": "冷水江市",
      "type": 3,
      "path": "430000,431300,431381",
      "parentCode": "431300"
},
{
      "code": "431382",
      "name": "涟源市",
      "type": 3,
      "path": "430000,431300,431382",
      "parentCode": "431300"
},
{
      "code": "433100",
      "name": "湘西土家族苗族自治州",
      "type": 2,
      "path": "430000,433100",
      "parentCode": "430000"
},
{
      "code": "433101",
      "name": "吉首市",
      "type": 3,
      "path": "430000,433100,433101",
      "parentCode": "433100"
},
{
      "code": "433122",
      "name": "泸溪县",
      "type": 3,
      "path": "430000,433100,433122",
      "parentCode": "433100"
},
{
      "code": "433123",
      "name": "凤凰县",
      "type": 3,
      "path": "430000,433100,433123",
      "parentCode": "433100"
},
{
      "code": "433124",
      "name": "花垣县",
      "type": 3,
      "path": "430000,433100,433124",
      "parentCode": "433100"
},
{
      "code": "433125",
      "name": "保靖县",
      "type": 3,
      "path": "430000,433100,433125",
      "parentCode": "433100"
},
{
      "code": "433126",
      "name": "古丈县",
      "type": 3,
      "path": "430000,433100,433126",
      "parentCode": "433100"
},
{
      "code": "433127",
      "name": "永顺县",
      "type": 3,
      "path": "430000,433100,433127",
      "parentCode": "433100"
},
{
      "code": "433130",
      "name": "龙山县",
      "type": 3,
      "path": "430000,433100,433130",
      "parentCode": "433100"
},
{
      "code": "440000",
      "name": "广东省",
      "type": 1,
      "path": "440000",
      "parentCode": null
},
{
      "code": "440100",
      "name": "广州市",
      "type": 2,
      "path": "440000,440100",
      "parentCode": "440000"
},
{
      "code": "440103",
      "name": "荔湾区",
      "type": 3,
      "path": "440000,440100,440103",
      "parentCode": "440100"
},
{
      "code": "440104",
      "name": "越秀区",
      "type": 3,
      "path": "440000,440100,440104",
      "parentCode": "440100"
},
{
      "code": "440105",
      "name": "海珠区",
      "type": 3,
      "path": "440000,440100,440105",
      "parentCode": "440100"
},
{
      "code": "440106",
      "name": "天河区",
      "type": 3,
      "path": "440000,440100,440106",
      "parentCode": "440100"
},
{
      "code": "440111",
      "name": "白云区",
      "type": 3,
      "path": "440000,440100,440111",
      "parentCode": "440100"
},
{
      "code": "440112",
      "name": "黄埔区",
      "type": 3,
      "path": "440000,440100,440112",
      "parentCode": "440100"
},
{
      "code": "440113",
      "name": "番禺区",
      "type": 3,
      "path": "440000,440100,440113",
      "parentCode": "440100"
},
{
      "code": "440114",
      "name": "花都区",
      "type": 3,
      "path": "440000,440100,440114",
      "parentCode": "440100"
},
{
      "code": "440115",
      "name": "南沙区",
      "type": 3,
      "path": "440000,440100,440115",
      "parentCode": "440100"
},
{
      "code": "440116",
      "name": "萝岗区",
      "type": 3,
      "path": "440000,440100,440116",
      "parentCode": "440100"
},
{
      "code": "440117",
      "name": "从化区",
      "type": 3,
      "path": "440000,440100,440117",
      "parentCode": "440100"
},
{
      "code": "440118",
      "name": "增城区",
      "type": 3,
      "path": "440000,440100,440118",
      "parentCode": "440100"
},
{
      "code": "440200",
      "name": "韶关市",
      "type": 2,
      "path": "440000,440200",
      "parentCode": "440000"
},
{
      "code": "440203",
      "name": "武江区",
      "type": 3,
      "path": "440000,440200,440203",
      "parentCode": "440200"
},
{
      "code": "440204",
      "name": "浈江区",
      "type": 3,
      "path": "440000,440200,440204",
      "parentCode": "440200"
},
{
      "code": "440205",
      "name": "曲江区",
      "type": 3,
      "path": "440000,440200,440205",
      "parentCode": "440200"
},
{
      "code": "440222",
      "name": "始兴县",
      "type": 3,
      "path": "440000,440200,440222",
      "parentCode": "440200"
},
{
      "code": "440224",
      "name": "仁化县",
      "type": 3,
      "path": "440000,440200,440224",
      "parentCode": "440200"
},
{
      "code": "440229",
      "name": "翁源县",
      "type": 3,
      "path": "440000,440200,440229",
      "parentCode": "440200"
},
{
      "code": "440232",
      "name": "乳源瑶族自治县",
      "type": 3,
      "path": "440000,440200,440232",
      "parentCode": "440200"
},
{
      "code": "440233",
      "name": "新丰县",
      "type": 3,
      "path": "440000,440200,440233",
      "parentCode": "440200"
},
{
      "code": "440281",
      "name": "乐昌市",
      "type": 3,
      "path": "440000,440200,440281",
      "parentCode": "440200"
},
{
      "code": "440282",
      "name": "南雄市",
      "type": 3,
      "path": "440000,440200,440282",
      "parentCode": "440200"
},
{
      "code": "440300",
      "name": "深圳市",
      "type": 2,
      "path": "440000,440300",
      "parentCode": "440000"
},
{
      "code": "440303",
      "name": "罗湖区",
      "type": 3,
      "path": "440000,440300,440303",
      "parentCode": "440300"
},
{
      "code": "440304",
      "name": "福田区",
      "type": 3,
      "path": "440000,440300,440304",
      "parentCode": "440300"
},
{
      "code": "440305",
      "name": "南山区",
      "type": 3,
      "path": "440000,440300,440305",
      "parentCode": "440300"
},
{
      "code": "440306",
      "name": "宝安区",
      "type": 3,
      "path": "440000,440300,440306",
      "parentCode": "440300"
},
{
      "code": "440307",
      "name": "龙岗区",
      "type": 3,
      "path": "440000,440300,440307",
      "parentCode": "440300"
},
{
      "code": "440308",
      "name": "盐田区",
      "type": 3,
      "path": "440000,440300,440308",
      "parentCode": "440300"
},
{
      "code": "440400",
      "name": "珠海市",
      "type": 2,
      "path": "440000,440400",
      "parentCode": "440000"
},
{
      "code": "440402",
      "name": "香洲区",
      "type": 3,
      "path": "440000,440400,440402",
      "parentCode": "440400"
},
{
      "code": "440403",
      "name": "斗门区",
      "type": 3,
      "path": "440000,440400,440403",
      "parentCode": "440400"
},
{
      "code": "440404",
      "name": "金湾区",
      "type": 3,
      "path": "440000,440400,440404",
      "parentCode": "440400"
},
{
      "code": "440500",
      "name": "汕头市",
      "type": 2,
      "path": "440000,440500",
      "parentCode": "440000"
},
{
      "code": "440507",
      "name": "龙湖区",
      "type": 3,
      "path": "440000,440500,440507",
      "parentCode": "440500"
},
{
      "code": "440511",
      "name": "金平区",
      "type": 3,
      "path": "440000,440500,440511",
      "parentCode": "440500"
},
{
      "code": "440512",
      "name": "濠江区",
      "type": 3,
      "path": "440000,440500,440512",
      "parentCode": "440500"
},
{
      "code": "440513",
      "name": "潮阳区",
      "type": 3,
      "path": "440000,440500,440513",
      "parentCode": "440500"
},
{
      "code": "440514",
      "name": "潮南区",
      "type": 3,
      "path": "440000,440500,440514",
      "parentCode": "440500"
},
{
      "code": "440515",
      "name": "澄海区",
      "type": 3,
      "path": "440000,440500,440515",
      "parentCode": "440500"
},
{
      "code": "440523",
      "name": "南澳县",
      "type": 3,
      "path": "440000,440500,440523",
      "parentCode": "440500"
},
{
      "code": "440600",
      "name": "佛山市",
      "type": 2,
      "path": "440000,440600",
      "parentCode": "440000"
},
{
      "code": "440604",
      "name": "禅城区",
      "type": 3,
      "path": "440000,440600,440604",
      "parentCode": "440600"
},
{
      "code": "440605",
      "name": "南海区",
      "type": 3,
      "path": "440000,440600,440605",
      "parentCode": "440600"
},
{
      "code": "440606",
      "name": "顺德区",
      "type": 3,
      "path": "440000,440600,440606",
      "parentCode": "440600"
},
{
      "code": "440607",
      "name": "三水区",
      "type": 3,
      "path": "440000,440600,440607",
      "parentCode": "440600"
},
{
      "code": "440608",
      "name": "高明区",
      "type": 3,
      "path": "440000,440600,440608",
      "parentCode": "440600"
},
{
      "code": "440700",
      "name": "江门市",
      "type": 2,
      "path": "440000,440700",
      "parentCode": "440000"
},
{
      "code": "440703",
      "name": "蓬江区",
      "type": 3,
      "path": "440000,440700,440703",
      "parentCode": "440700"
},
{
      "code": "440704",
      "name": "江海区",
      "type": 3,
      "path": "440000,440700,440704",
      "parentCode": "440700"
},
{
      "code": "440705",
      "name": "新会区",
      "type": 3,
      "path": "440000,440700,440705",
      "parentCode": "440700"
},
{
      "code": "440781",
      "name": "台山市",
      "type": 3,
      "path": "440000,440700,440781",
      "parentCode": "440700"
},
{
      "code": "440783",
      "name": "开平市",
      "type": 3,
      "path": "440000,440700,440783",
      "parentCode": "440700"
},
{
      "code": "440784",
      "name": "鹤山市",
      "type": 3,
      "path": "440000,440700,440784",
      "parentCode": "440700"
},
{
      "code": "440785",
      "name": "恩平市",
      "type": 3,
      "path": "440000,440700,440785",
      "parentCode": "440700"
},
{
      "code": "440800",
      "name": "湛江市",
      "type": 2,
      "path": "440000,440800",
      "parentCode": "440000"
},
{
      "code": "440802",
      "name": "赤坎区",
      "type": 3,
      "path": "440000,440800,440802",
      "parentCode": "440800"
},
{
      "code": "440803",
      "name": "霞山区",
      "type": 3,
      "path": "440000,440800,440803",
      "parentCode": "440800"
},
{
      "code": "440804",
      "name": "坡头区",
      "type": 3,
      "path": "440000,440800,440804",
      "parentCode": "440800"
},
{
      "code": "440811",
      "name": "麻章区",
      "type": 3,
      "path": "440000,440800,440811",
      "parentCode": "440800"
},
{
      "code": "440823",
      "name": "遂溪县",
      "type": 3,
      "path": "440000,440800,440823",
      "parentCode": "440800"
},
{
      "code": "440825",
      "name": "徐闻县",
      "type": 3,
      "path": "440000,440800,440825",
      "parentCode": "440800"
},
{
      "code": "440881",
      "name": "廉江市",
      "type": 3,
      "path": "440000,440800,440881",
      "parentCode": "440800"
},
{
      "code": "440882",
      "name": "雷州市",
      "type": 3,
      "path": "440000,440800,440882",
      "parentCode": "440800"
},
{
      "code": "440883",
      "name": "吴川市",
      "type": 3,
      "path": "440000,440800,440883",
      "parentCode": "440800"
},
{
      "code": "440900",
      "name": "茂名市",
      "type": 2,
      "path": "440000,440900",
      "parentCode": "440000"
},
{
      "code": "440902",
      "name": "茂南区",
      "type": 3,
      "path": "440000,440900,440902",
      "parentCode": "440900"
},
{
      "code": "440904",
      "name": "电白区",
      "type": 3,
      "path": "440000,440900,440904",
      "parentCode": "440900"
},
{
      "code": "440981",
      "name": "高州市",
      "type": 3,
      "path": "440000,440900,440981",
      "parentCode": "440900"
},
{
      "code": "440982",
      "name": "化州市",
      "type": 3,
      "path": "440000,440900,440982",
      "parentCode": "440900"
},
{
      "code": "440983",
      "name": "信宜市",
      "type": 3,
      "path": "440000,440900,440983",
      "parentCode": "440900"
},
{
      "code": "441200",
      "name": "肇庆市",
      "type": 2,
      "path": "440000,441200",
      "parentCode": "440000"
},
{
      "code": "441202",
      "name": "端州区",
      "type": 3,
      "path": "440000,441200,441202",
      "parentCode": "441200"
},
{
      "code": "441203",
      "name": "鼎湖区",
      "type": 3,
      "path": "440000,441200,441203",
      "parentCode": "441200"
},
{
      "code": "441223",
      "name": "广宁县",
      "type": 3,
      "path": "440000,441200,441223",
      "parentCode": "441200"
},
{
      "code": "441224",
      "name": "怀集县",
      "type": 3,
      "path": "440000,441200,441224",
      "parentCode": "441200"
},
{
      "code": "441225",
      "name": "封开县",
      "type": 3,
      "path": "440000,441200,441225",
      "parentCode": "441200"
},
{
      "code": "441226",
      "name": "德庆县",
      "type": 3,
      "path": "440000,441200,441226",
      "parentCode": "441200"
},
{
      "code": "441283",
      "name": "高要市",
      "type": 3,
      "path": "440000,441200,441283",
      "parentCode": "441200"
},
{
      "code": "441284",
      "name": "四会市",
      "type": 3,
      "path": "440000,441200,441284",
      "parentCode": "441200"
},
{
      "code": "441300",
      "name": "惠州市",
      "type": 2,
      "path": "440000,441300",
      "parentCode": "440000"
},
{
      "code": "441302",
      "name": "惠城区",
      "type": 3,
      "path": "440000,441300,441302",
      "parentCode": "441300"
},
{
      "code": "441303",
      "name": "惠阳区",
      "type": 3,
      "path": "440000,441300,441303",
      "parentCode": "441300"
},
{
      "code": "441322",
      "name": "博罗县",
      "type": 3,
      "path": "440000,441300,441322",
      "parentCode": "441300"
},
{
      "code": "441323",
      "name": "惠东县",
      "type": 3,
      "path": "440000,441300,441323",
      "parentCode": "441300"
},
{
      "code": "441324",
      "name": "龙门县",
      "type": 3,
      "path": "440000,441300,441324",
      "parentCode": "441300"
},
{
      "code": "441400",
      "name": "梅州市",
      "type": 2,
      "path": "440000,441400",
      "parentCode": "440000"
},
{
      "code": "441402",
      "name": "梅江区",
      "type": 3,
      "path": "440000,441400,441402",
      "parentCode": "441400"
},
{
      "code": "441403",
      "name": "梅县区",
      "type": 3,
      "path": "440000,441400,441403",
      "parentCode": "441400"
},
{
      "code": "441422",
      "name": "大埔县",
      "type": 3,
      "path": "440000,441400,441422",
      "parentCode": "441400"
},
{
      "code": "441423",
      "name": "丰顺县",
      "type": 3,
      "path": "440000,441400,441423",
      "parentCode": "441400"
},
{
      "code": "441424",
      "name": "五华县",
      "type": 3,
      "path": "440000,441400,441424",
      "parentCode": "441400"
},
{
      "code": "441426",
      "name": "平远县",
      "type": 3,
      "path": "440000,441400,441426",
      "parentCode": "441400"
},
{
      "code": "441427",
      "name": "蕉岭县",
      "type": 3,
      "path": "440000,441400,441427",
      "parentCode": "441400"
},
{
      "code": "441481",
      "name": "兴宁市",
      "type": 3,
      "path": "440000,441400,441481",
      "parentCode": "441400"
},
{
      "code": "441500",
      "name": "汕尾市",
      "type": 2,
      "path": "440000,441500",
      "parentCode": "440000"
},
{
      "code": "441502",
      "name": "城区",
      "type": 3,
      "path": "440000,441500,441502",
      "parentCode": "441500"
},
{
      "code": "441521",
      "name": "海丰县",
      "type": 3,
      "path": "440000,441500,441521",
      "parentCode": "441500"
},
{
      "code": "441523",
      "name": "陆河县",
      "type": 3,
      "path": "440000,441500,441523",
      "parentCode": "441500"
},
{
      "code": "441581",
      "name": "陆丰市",
      "type": 3,
      "path": "440000,441500,441581",
      "parentCode": "441500"
},
{
      "code": "441600",
      "name": "河源市",
      "type": 2,
      "path": "440000,441600",
      "parentCode": "440000"
},
{
      "code": "441602",
      "name": "源城区",
      "type": 3,
      "path": "440000,441600,441602",
      "parentCode": "441600"
},
{
      "code": "441621",
      "name": "紫金县",
      "type": 3,
      "path": "440000,441600,441621",
      "parentCode": "441600"
},
{
      "code": "441622",
      "name": "龙川县",
      "type": 3,
      "path": "440000,441600,441622",
      "parentCode": "441600"
},
{
      "code": "441623",
      "name": "连平县",
      "type": 3,
      "path": "440000,441600,441623",
      "parentCode": "441600"
},
{
      "code": "441624",
      "name": "和平县",
      "type": 3,
      "path": "440000,441600,441624",
      "parentCode": "441600"
},
{
      "code": "441625",
      "name": "东源县",
      "type": 3,
      "path": "440000,441600,441625",
      "parentCode": "441600"
},
{
      "code": "441700",
      "name": "阳江市",
      "type": 2,
      "path": "440000,441700",
      "parentCode": "440000"
},
{
      "code": "441702",
      "name": "江城区",
      "type": 3,
      "path": "440000,441700,441702",
      "parentCode": "441700"
},
{
      "code": "441721",
      "name": "阳西县",
      "type": 3,
      "path": "440000,441700,441721",
      "parentCode": "441700"
},
{
      "code": "441723",
      "name": "阳东县",
      "type": 3,
      "path": "440000,441700,441723",
      "parentCode": "441700"
},
{
      "code": "441781",
      "name": "阳春市",
      "type": 3,
      "path": "440000,441700,441781",
      "parentCode": "441700"
},
{
      "code": "441800",
      "name": "清远市",
      "type": 2,
      "path": "440000,441800",
      "parentCode": "440000"
},
{
      "code": "441802",
      "name": "清城区",
      "type": 3,
      "path": "440000,441800,441802",
      "parentCode": "441800"
},
{
      "code": "441803",
      "name": "清新区",
      "type": 3,
      "path": "440000,441800,441803",
      "parentCode": "441800"
},
{
      "code": "441821",
      "name": "佛冈县",
      "type": 3,
      "path": "440000,441800,441821",
      "parentCode": "441800"
},
{
      "code": "441823",
      "name": "阳山县",
      "type": 3,
      "path": "440000,441800,441823",
      "parentCode": "441800"
},
{
      "code": "441825",
      "name": "连山壮族瑶族自治县",
      "type": 3,
      "path": "440000,441800,441825",
      "parentCode": "441800"
},
{
      "code": "441826",
      "name": "连南瑶族自治县",
      "type": 3,
      "path": "440000,441800,441826",
      "parentCode": "441800"
},
{
      "code": "441881",
      "name": "英德市",
      "type": 3,
      "path": "440000,441800,441881",
      "parentCode": "441800"
},
{
      "code": "441882",
      "name": "连州市",
      "type": 3,
      "path": "440000,441800,441882",
      "parentCode": "441800"
},
{
      "code": "441900",
      "name": "东莞市",
      "type": 2,
      "path": "440000,441900",
      "parentCode": "440000"
},
{
      "code": "441900",
      "name": "东莞市",
      "type": 3,
      "path": "440000,441900,441900",
      "parentCode": "441900"
},
{
      "code": "442000",
      "name": "中山市",
      "type": 2,
      "path": "440000,442000",
      "parentCode": "440000"
},
{
      "code": "442000",
      "name": "中山市",
      "type": 3,
      "path": "440000,442000,442000",
      "parentCode": "442000"
},
{
      "code": "445100",
      "name": "潮州市",
      "type": 2,
      "path": "440000,445100",
      "parentCode": "440000"
},
{
      "code": "445102",
      "name": "湘桥区",
      "type": 3,
      "path": "440000,445100,445102",
      "parentCode": "445100"
},
{
      "code": "445103",
      "name": "潮安区",
      "type": 3,
      "path": "440000,445100,445103",
      "parentCode": "445100"
},
{
      "code": "445122",
      "name": "饶平县",
      "type": 3,
      "path": "440000,445100,445122",
      "parentCode": "445100"
},
{
      "code": "445200",
      "name": "揭阳市",
      "type": 2,
      "path": "440000,445200",
      "parentCode": "440000"
},
{
      "code": "445202",
      "name": "榕城区",
      "type": 3,
      "path": "440000,445200,445202",
      "parentCode": "445200"
},
{
      "code": "445203",
      "name": "揭东区",
      "type": 3,
      "path": "440000,445200,445203",
      "parentCode": "445200"
},
{
      "code": "445222",
      "name": "揭西县",
      "type": 3,
      "path": "440000,445200,445222",
      "parentCode": "445200"
},
{
      "code": "445224",
      "name": "惠来县",
      "type": 3,
      "path": "440000,445200,445224",
      "parentCode": "445200"
},
{
      "code": "445281",
      "name": "普宁市",
      "type": 3,
      "path": "440000,445200,445281",
      "parentCode": "445200"
},
{
      "code": "445300",
      "name": "云浮市",
      "type": 2,
      "path": "440000,445300",
      "parentCode": "440000"
},
{
      "code": "445302",
      "name": "云城区",
      "type": 3,
      "path": "440000,445300,445302",
      "parentCode": "445300"
},
{
      "code": "445303",
      "name": "云安区",
      "type": 3,
      "path": "440000,445300,445303",
      "parentCode": "445300"
},
{
      "code": "445321",
      "name": "新兴县",
      "type": 3,
      "path": "440000,445300,445321",
      "parentCode": "445300"
},
{
      "code": "445322",
      "name": "郁南县",
      "type": 3,
      "path": "440000,445300,445322",
      "parentCode": "445300"
},
{
      "code": "445381",
      "name": "罗定市",
      "type": 3,
      "path": "440000,445300,445381",
      "parentCode": "445300"
},
{
      "code": "450000",
      "name": "广西壮族自治区",
      "type": 1,
      "path": "450000",
      "parentCode": null
},
{
      "code": "450100",
      "name": "南宁市",
      "type": 2,
      "path": "450000,450100",
      "parentCode": "450000"
},
{
      "code": "450102",
      "name": "兴宁区",
      "type": 3,
      "path": "450000,450100,450102",
      "parentCode": "450100"
},
{
      "code": "450103",
      "name": "青秀区",
      "type": 3,
      "path": "450000,450100,450103",
      "parentCode": "450100"
},
{
      "code": "450105",
      "name": "江南区",
      "type": 3,
      "path": "450000,450100,450105",
      "parentCode": "450100"
},
{
      "code": "450107",
      "name": "西乡塘区",
      "type": 3,
      "path": "450000,450100,450107",
      "parentCode": "450100"
},
{
      "code": "450108",
      "name": "良庆区",
      "type": 3,
      "path": "450000,450100,450108",
      "parentCode": "450100"
},
{
      "code": "450109",
      "name": "邕宁区",
      "type": 3,
      "path": "450000,450100,450109",
      "parentCode": "450100"
},
{
      "code": "450122",
      "name": "武鸣县",
      "type": 3,
      "path": "450000,450100,450122",
      "parentCode": "450100"
},
{
      "code": "450123",
      "name": "隆安县",
      "type": 3,
      "path": "450000,450100,450123",
      "parentCode": "450100"
},
{
      "code": "450124",
      "name": "马山县",
      "type": 3,
      "path": "450000,450100,450124",
      "parentCode": "450100"
},
{
      "code": "450125",
      "name": "上林县",
      "type": 3,
      "path": "450000,450100,450125",
      "parentCode": "450100"
},
{
      "code": "450126",
      "name": "宾阳县",
      "type": 3,
      "path": "450000,450100,450126",
      "parentCode": "450100"
},
{
      "code": "450127",
      "name": "横县",
      "type": 3,
      "path": "450000,450100,450127",
      "parentCode": "450100"
},
{
      "code": "450200",
      "name": "柳州市",
      "type": 2,
      "path": "450000,450200",
      "parentCode": "450000"
},
{
      "code": "450202",
      "name": "城中区",
      "type": 3,
      "path": "450000,450200,450202",
      "parentCode": "450200"
},
{
      "code": "450203",
      "name": "鱼峰区",
      "type": 3,
      "path": "450000,450200,450203",
      "parentCode": "450200"
},
{
      "code": "450204",
      "name": "柳南区",
      "type": 3,
      "path": "450000,450200,450204",
      "parentCode": "450200"
},
{
      "code": "450205",
      "name": "柳北区",
      "type": 3,
      "path": "450000,450200,450205",
      "parentCode": "450200"
},
{
      "code": "450221",
      "name": "柳江县",
      "type": 3,
      "path": "450000,450200,450221",
      "parentCode": "450200"
},
{
      "code": "450222",
      "name": "柳城县",
      "type": 3,
      "path": "450000,450200,450222",
      "parentCode": "450200"
},
{
      "code": "450223",
      "name": "鹿寨县",
      "type": 3,
      "path": "450000,450200,450223",
      "parentCode": "450200"
},
{
      "code": "450224",
      "name": "融安县",
      "type": 3,
      "path": "450000,450200,450224",
      "parentCode": "450200"
},
{
      "code": "450225",
      "name": "融水苗族自治县",
      "type": 3,
      "path": "450000,450200,450225",
      "parentCode": "450200"
},
{
      "code": "450226",
      "name": "三江侗族自治县",
      "type": 3,
      "path": "450000,450200,450226",
      "parentCode": "450200"
},
{
      "code": "450300",
      "name": "桂林市",
      "type": 2,
      "path": "450000,450300",
      "parentCode": "450000"
},
{
      "code": "450302",
      "name": "秀峰区",
      "type": 3,
      "path": "450000,450300,450302",
      "parentCode": "450300"
},
{
      "code": "450303",
      "name": "叠彩区",
      "type": 3,
      "path": "450000,450300,450303",
      "parentCode": "450300"
},
{
      "code": "450304",
      "name": "象山区",
      "type": 3,
      "path": "450000,450300,450304",
      "parentCode": "450300"
},
{
      "code": "450305",
      "name": "七星区",
      "type": 3,
      "path": "450000,450300,450305",
      "parentCode": "450300"
},
{
      "code": "450311",
      "name": "雁山区",
      "type": 3,
      "path": "450000,450300,450311",
      "parentCode": "450300"
},
{
      "code": "450312",
      "name": "临桂区",
      "type": 3,
      "path": "450000,450300,450312",
      "parentCode": "450300"
},
{
      "code": "450321",
      "name": "阳朔县",
      "type": 3,
      "path": "450000,450300,450321",
      "parentCode": "450300"
},
{
      "code": "450323",
      "name": "灵川县",
      "type": 3,
      "path": "450000,450300,450323",
      "parentCode": "450300"
},
{
      "code": "450324",
      "name": "全州县",
      "type": 3,
      "path": "450000,450300,450324",
      "parentCode": "450300"
},
{
      "code": "450325",
      "name": "兴安县",
      "type": 3,
      "path": "450000,450300,450325",
      "parentCode": "450300"
},
{
      "code": "450326",
      "name": "永福县",
      "type": 3,
      "path": "450000,450300,450326",
      "parentCode": "450300"
},
{
      "code": "450327",
      "name": "灌阳县",
      "type": 3,
      "path": "450000,450300,450327",
      "parentCode": "450300"
},
{
      "code": "450328",
      "name": "龙胜各族自治县",
      "type": 3,
      "path": "450000,450300,450328",
      "parentCode": "450300"
},
{
      "code": "450329",
      "name": "资源县",
      "type": 3,
      "path": "450000,450300,450329",
      "parentCode": "450300"
},
{
      "code": "450330",
      "name": "平乐县",
      "type": 3,
      "path": "450000,450300,450330",
      "parentCode": "450300"
},
{
      "code": "450331",
      "name": "荔浦县",
      "type": 3,
      "path": "450000,450300,450331",
      "parentCode": "450300"
},
{
      "code": "450332",
      "name": "恭城瑶族自治县",
      "type": 3,
      "path": "450000,450300,450332",
      "parentCode": "450300"
},
{
      "code": "450400",
      "name": "梧州市",
      "type": 2,
      "path": "450000,450400",
      "parentCode": "450000"
},
{
      "code": "450403",
      "name": "万秀区",
      "type": 3,
      "path": "450000,450400,450403",
      "parentCode": "450400"
},
{
      "code": "450405",
      "name": "长洲区",
      "type": 3,
      "path": "450000,450400,450405",
      "parentCode": "450400"
},
{
      "code": "450406",
      "name": "龙圩区",
      "type": 3,
      "path": "450000,450400,450406",
      "parentCode": "450400"
},
{
      "code": "450421",
      "name": "苍梧县",
      "type": 3,
      "path": "450000,450400,450421",
      "parentCode": "450400"
},
{
      "code": "450422",
      "name": "藤县",
      "type": 3,
      "path": "450000,450400,450422",
      "parentCode": "450400"
},
{
      "code": "450423",
      "name": "蒙山县",
      "type": 3,
      "path": "450000,450400,450423",
      "parentCode": "450400"
},
{
      "code": "450481",
      "name": "岑溪市",
      "type": 3,
      "path": "450000,450400,450481",
      "parentCode": "450400"
},
{
      "code": "450500",
      "name": "北海市",
      "type": 2,
      "path": "450000,450500",
      "parentCode": "450000"
},
{
      "code": "450502",
      "name": "海城区",
      "type": 3,
      "path": "450000,450500,450502",
      "parentCode": "450500"
},
{
      "code": "450503",
      "name": "银海区",
      "type": 3,
      "path": "450000,450500,450503",
      "parentCode": "450500"
},
{
      "code": "450512",
      "name": "铁山港区",
      "type": 3,
      "path": "450000,450500,450512",
      "parentCode": "450500"
},
{
      "code": "450521",
      "name": "合浦县",
      "type": 3,
      "path": "450000,450500,450521",
      "parentCode": "450500"
},
{
      "code": "450600",
      "name": "防城港市",
      "type": 2,
      "path": "450000,450600",
      "parentCode": "450000"
},
{
      "code": "450602",
      "name": "港口区",
      "type": 3,
      "path": "450000,450600,450602",
      "parentCode": "450600"
},
{
      "code": "450603",
      "name": "防城区",
      "type": 3,
      "path": "450000,450600,450603",
      "parentCode": "450600"
},
{
      "code": "450621",
      "name": "上思县",
      "type": 3,
      "path": "450000,450600,450621",
      "parentCode": "450600"
},
{
      "code": "450681",
      "name": "东兴市",
      "type": 3,
      "path": "450000,450600,450681",
      "parentCode": "450600"
},
{
      "code": "450700",
      "name": "钦州市",
      "type": 2,
      "path": "450000,450700",
      "parentCode": "450000"
},
{
      "code": "450702",
      "name": "钦南区",
      "type": 3,
      "path": "450000,450700,450702",
      "parentCode": "450700"
},
{
      "code": "450703",
      "name": "钦北区",
      "type": 3,
      "path": "450000,450700,450703",
      "parentCode": "450700"
},
{
      "code": "450721",
      "name": "灵山县",
      "type": 3,
      "path": "450000,450700,450721",
      "parentCode": "450700"
},
{
      "code": "450722",
      "name": "浦北县",
      "type": 3,
      "path": "450000,450700,450722",
      "parentCode": "450700"
},
{
      "code": "450800",
      "name": "贵港市",
      "type": 2,
      "path": "450000,450800",
      "parentCode": "450000"
},
{
      "code": "450802",
      "name": "港北区",
      "type": 3,
      "path": "450000,450800,450802",
      "parentCode": "450800"
},
{
      "code": "450803",
      "name": "港南区",
      "type": 3,
      "path": "450000,450800,450803",
      "parentCode": "450800"
},
{
      "code": "450804",
      "name": "覃塘区",
      "type": 3,
      "path": "450000,450800,450804",
      "parentCode": "450800"
},
{
      "code": "450821",
      "name": "平南县",
      "type": 3,
      "path": "450000,450800,450821",
      "parentCode": "450800"
},
{
      "code": "450881",
      "name": "桂平市",
      "type": 3,
      "path": "450000,450800,450881",
      "parentCode": "450800"
},
{
      "code": "450900",
      "name": "玉林市",
      "type": 2,
      "path": "450000,450900",
      "parentCode": "450000"
},
{
      "code": "450902",
      "name": "玉州区",
      "type": 3,
      "path": "450000,450900,450902",
      "parentCode": "450900"
},
{
      "code": "450903",
      "name": "福绵区",
      "type": 3,
      "path": "450000,450900,450903",
      "parentCode": "450900"
},
{
      "code": "450921",
      "name": "容县",
      "type": 3,
      "path": "450000,450900,450921",
      "parentCode": "450900"
},
{
      "code": "450922",
      "name": "陆川县",
      "type": 3,
      "path": "450000,450900,450922",
      "parentCode": "450900"
},
{
      "code": "450923",
      "name": "博白县",
      "type": 3,
      "path": "450000,450900,450923",
      "parentCode": "450900"
},
{
      "code": "450924",
      "name": "兴业县",
      "type": 3,
      "path": "450000,450900,450924",
      "parentCode": "450900"
},
{
      "code": "450981",
      "name": "北流市",
      "type": 3,
      "path": "450000,450900,450981",
      "parentCode": "450900"
},
{
      "code": "451000",
      "name": "百色市",
      "type": 2,
      "path": "450000,451000",
      "parentCode": "450000"
},
{
      "code": "451002",
      "name": "右江区",
      "type": 3,
      "path": "450000,451000,451002",
      "parentCode": "451000"
},
{
      "code": "451021",
      "name": "田阳县",
      "type": 3,
      "path": "450000,451000,451021",
      "parentCode": "451000"
},
{
      "code": "451022",
      "name": "田东县",
      "type": 3,
      "path": "450000,451000,451022",
      "parentCode": "451000"
},
{
      "code": "451023",
      "name": "平果县",
      "type": 3,
      "path": "450000,451000,451023",
      "parentCode": "451000"
},
{
      "code": "451024",
      "name": "德保县",
      "type": 3,
      "path": "450000,451000,451024",
      "parentCode": "451000"
},
{
      "code": "451025",
      "name": "靖西县",
      "type": 3,
      "path": "450000,451000,451025",
      "parentCode": "451000"
},
{
      "code": "451026",
      "name": "那坡县",
      "type": 3,
      "path": "450000,451000,451026",
      "parentCode": "451000"
},
{
      "code": "451027",
      "name": "凌云县",
      "type": 3,
      "path": "450000,451000,451027",
      "parentCode": "451000"
},
{
      "code": "451028",
      "name": "乐业县",
      "type": 3,
      "path": "450000,451000,451028",
      "parentCode": "451000"
},
{
      "code": "451029",
      "name": "田林县",
      "type": 3,
      "path": "450000,451000,451029",
      "parentCode": "451000"
},
{
      "code": "451030",
      "name": "西林县",
      "type": 3,
      "path": "450000,451000,451030",
      "parentCode": "451000"
},
{
      "code": "451031",
      "name": "隆林各族自治县",
      "type": 3,
      "path": "450000,451000,451031",
      "parentCode": "451000"
},
{
      "code": "451100",
      "name": "贺州市",
      "type": 2,
      "path": "450000,451100",
      "parentCode": "450000"
},
{
      "code": "451102",
      "name": "八步区",
      "type": 3,
      "path": "450000,451100,451102",
      "parentCode": "451100"
},
{
      "code": "451121",
      "name": "昭平县",
      "type": 3,
      "path": "450000,451100,451121",
      "parentCode": "451100"
},
{
      "code": "451122",
      "name": "钟山县",
      "type": 3,
      "path": "450000,451100,451122",
      "parentCode": "451100"
},
{
      "code": "451123",
      "name": "富川瑶族自治县",
      "type": 3,
      "path": "450000,451100,451123",
      "parentCode": "451100"
},
{
      "code": "451200",
      "name": "河池市",
      "type": 2,
      "path": "450000,451200",
      "parentCode": "450000"
},
{
      "code": "451202",
      "name": "金城江区",
      "type": 3,
      "path": "450000,451200,451202",
      "parentCode": "451200"
},
{
      "code": "451221",
      "name": "南丹县",
      "type": 3,
      "path": "450000,451200,451221",
      "parentCode": "451200"
},
{
      "code": "451222",
      "name": "天峨县",
      "type": 3,
      "path": "450000,451200,451222",
      "parentCode": "451200"
},
{
      "code": "451223",
      "name": "凤山县",
      "type": 3,
      "path": "450000,451200,451223",
      "parentCode": "451200"
},
{
      "code": "451224",
      "name": "东兰县",
      "type": 3,
      "path": "450000,451200,451224",
      "parentCode": "451200"
},
{
      "code": "451225",
      "name": "罗城仫佬族自治县",
      "type": 3,
      "path": "450000,451200,451225",
      "parentCode": "451200"
},
{
      "code": "451226",
      "name": "环江毛南族自治县",
      "type": 3,
      "path": "450000,451200,451226",
      "parentCode": "451200"
},
{
      "code": "451227",
      "name": "巴马瑶族自治县",
      "type": 3,
      "path": "450000,451200,451227",
      "parentCode": "451200"
},
{
      "code": "451228",
      "name": "都安瑶族自治县",
      "type": 3,
      "path": "450000,451200,451228",
      "parentCode": "451200"
},
{
      "code": "451229",
      "name": "大化瑶族自治县",
      "type": 3,
      "path": "450000,451200,451229",
      "parentCode": "451200"
},
{
      "code": "451281",
      "name": "宜州市",
      "type": 3,
      "path": "450000,451200,451281",
      "parentCode": "451200"
},
{
      "code": "451300",
      "name": "来宾市",
      "type": 2,
      "path": "450000,451300",
      "parentCode": "450000"
},
{
      "code": "451302",
      "name": "兴宾区",
      "type": 3,
      "path": "450000,451300,451302",
      "parentCode": "451300"
},
{
      "code": "451321",
      "name": "忻城县",
      "type": 3,
      "path": "450000,451300,451321",
      "parentCode": "451300"
},
{
      "code": "451322",
      "name": "象州县",
      "type": 3,
      "path": "450000,451300,451322",
      "parentCode": "451300"
},
{
      "code": "451323",
      "name": "武宣县",
      "type": 3,
      "path": "450000,451300,451323",
      "parentCode": "451300"
},
{
      "code": "451324",
      "name": "金秀瑶族自治县",
      "type": 3,
      "path": "450000,451300,451324",
      "parentCode": "451300"
},
{
      "code": "451381",
      "name": "合山市",
      "type": 3,
      "path": "450000,451300,451381",
      "parentCode": "451300"
},
{
      "code": "451400",
      "name": "崇左市",
      "type": 2,
      "path": "450000,451400",
      "parentCode": "450000"
},
{
      "code": "451402",
      "name": "江州区",
      "type": 3,
      "path": "450000,451400,451402",
      "parentCode": "451400"
},
{
      "code": "451421",
      "name": "扶绥县",
      "type": 3,
      "path": "450000,451400,451421",
      "parentCode": "451400"
},
{
      "code": "451422",
      "name": "宁明县",
      "type": 3,
      "path": "450000,451400,451422",
      "parentCode": "451400"
},
{
      "code": "451423",
      "name": "龙州县",
      "type": 3,
      "path": "450000,451400,451423",
      "parentCode": "451400"
},
{
      "code": "451424",
      "name": "大新县",
      "type": 3,
      "path": "450000,451400,451424",
      "parentCode": "451400"
},
{
      "code": "451425",
      "name": "天等县",
      "type": 3,
      "path": "450000,451400,451425",
      "parentCode": "451400"
},
{
      "code": "451481",
      "name": "凭祥市",
      "type": 3,
      "path": "450000,451400,451481",
      "parentCode": "451400"
},
{
      "code": "460000",
      "name": "海南省",
      "type": 1,
      "path": "460000",
      "parentCode": null
},
{
      "code": "460100",
      "name": "海口市",
      "type": 2,
      "path": "460000,460100",
      "parentCode": "460000"
},
{
      "code": "460105",
      "name": "秀英区",
      "type": 3,
      "path": "460000,460100,460105",
      "parentCode": "460100"
},
{
      "code": "460106",
      "name": "龙华区",
      "type": 3,
      "path": "460000,460100,460106",
      "parentCode": "460100"
},
{
      "code": "460107",
      "name": "琼山区",
      "type": 3,
      "path": "460000,460100,460107",
      "parentCode": "460100"
},
{
      "code": "460108",
      "name": "美兰区",
      "type": 3,
      "path": "460000,460100,460108",
      "parentCode": "460100"
},
{
      "code": "460200",
      "name": "三亚市",
      "type": 2,
      "path": "460000,460200",
      "parentCode": "460000"
},
{
      "code": "460202",
      "name": "海棠区",
      "type": 3,
      "path": "460000,460200,460202",
      "parentCode": "460200"
},
{
      "code": "460203",
      "name": "吉阳区",
      "type": 3,
      "path": "460000,460200,460203",
      "parentCode": "460200"
},
{
      "code": "460204",
      "name": "天涯区",
      "type": 3,
      "path": "460000,460200,460204",
      "parentCode": "460200"
},
{
      "code": "460205",
      "name": "崖州区",
      "type": 3,
      "path": "460000,460200,460205",
      "parentCode": "460200"
},
{
      "code": "469000",
      "name": "省直辖县级行政单位",
      "type": 2,
      "path": "460000,469000",
      "parentCode": "460000"
},
{
      "code": "469001",
      "name": "五指山市",
      "type": 3,
      "path": "460000,469000,469001",
      "parentCode": "469000"
},
{
      "code": "469002",
      "name": "琼海市",
      "type": 3,
      "path": "460000,469000,469002",
      "parentCode": "469000"
},
{
      "code": "469003",
      "name": "儋州市",
      "type": 3,
      "path": "460000,469000,469003",
      "parentCode": "469000"
},
{
      "code": "469005",
      "name": "文昌市",
      "type": 3,
      "path": "460000,469000,469005",
      "parentCode": "469000"
},
{
      "code": "469006",
      "name": "万宁市",
      "type": 3,
      "path": "460000,469000,469006",
      "parentCode": "469000"
},
{
      "code": "469007",
      "name": "东方市",
      "type": 3,
      "path": "460000,469000,469007",
      "parentCode": "469000"
},
{
      "code": "469021",
      "name": "定安县",
      "type": 3,
      "path": "460000,469000,469021",
      "parentCode": "469000"
},
{
      "code": "469022",
      "name": "屯昌县",
      "type": 3,
      "path": "460000,469000,469022",
      "parentCode": "469000"
},
{
      "code": "469023",
      "name": "澄迈县",
      "type": 3,
      "path": "460000,469000,469023",
      "parentCode": "469000"
},
{
      "code": "469024",
      "name": "临高县",
      "type": 3,
      "path": "460000,469000,469024",
      "parentCode": "469000"
},
{
      "code": "469025",
      "name": "白沙黎族自治县",
      "type": 3,
      "path": "460000,469000,469025",
      "parentCode": "469000"
},
{
      "code": "469026",
      "name": "昌江黎族自治县",
      "type": 3,
      "path": "460000,469000,469026",
      "parentCode": "469000"
},
{
      "code": "469027",
      "name": "乐东黎族自治县",
      "type": 3,
      "path": "460000,469000,469027",
      "parentCode": "469000"
},
{
      "code": "469028",
      "name": "陵水黎族自治县",
      "type": 3,
      "path": "460000,469000,469028",
      "parentCode": "469000"
},
{
      "code": "469029",
      "name": "保亭黎族苗族自治县",
      "type": 3,
      "path": "460000,469000,469029",
      "parentCode": "469000"
},
{
      "code": "469030",
      "name": "琼中黎族苗族自治县",
      "type": 3,
      "path": "460000,469000,469030",
      "parentCode": "469000"
},
{
      "code": "500000",
      "name": "重庆市",
      "type": 1,
      "path": "500000",
      "parentCode": null
},
{
      "code": "500100",
      "name": "重庆市",
      "type": 2,
      "path": "500000,500100",
      "parentCode": "500000"
},
{
      "code": "500101",
      "name": "万州区",
      "type": 3,
      "path": "500000,500100,500101",
      "parentCode": "500100"
},
{
      "code": "500102",
      "name": "涪陵区",
      "type": 3,
      "path": "500000,500100,500102",
      "parentCode": "500100"
},
{
      "code": "500103",
      "name": "渝中区",
      "type": 3,
      "path": "500000,500100,500103",
      "parentCode": "500100"
},
{
      "code": "500104",
      "name": "大渡口区",
      "type": 3,
      "path": "500000,500100,500104",
      "parentCode": "500100"
},
{
      "code": "500105",
      "name": "江北区",
      "type": 3,
      "path": "500000,500100,500105",
      "parentCode": "500100"
},
{
      "code": "500106",
      "name": "沙坪坝区",
      "type": 3,
      "path": "500000,500100,500106",
      "parentCode": "500100"
},
{
      "code": "500107",
      "name": "九龙坡区",
      "type": 3,
      "path": "500000,500100,500107",
      "parentCode": "500100"
},
{
      "code": "500108",
      "name": "南岸区",
      "type": 3,
      "path": "500000,500100,500108",
      "parentCode": "500100"
},
{
      "code": "500109",
      "name": "北碚区",
      "type": 3,
      "path": "500000,500100,500109",
      "parentCode": "500100"
},
{
      "code": "500110",
      "name": "綦江区",
      "type": 3,
      "path": "500000,500100,500110",
      "parentCode": "500100"
},
{
      "code": "500111",
      "name": "大足区",
      "type": 3,
      "path": "500000,500100,500111",
      "parentCode": "500100"
},
{
      "code": "500112",
      "name": "渝北区",
      "type": 3,
      "path": "500000,500100,500112",
      "parentCode": "500100"
},
{
      "code": "500113",
      "name": "巴南区",
      "type": 3,
      "path": "500000,500100,500113",
      "parentCode": "500100"
},
{
      "code": "500114",
      "name": "黔江区",
      "type": 3,
      "path": "500000,500100,500114",
      "parentCode": "500100"
},
{
      "code": "500115",
      "name": "长寿区",
      "type": 3,
      "path": "500000,500100,500115",
      "parentCode": "500100"
},
{
      "code": "500116",
      "name": "江津区",
      "type": 3,
      "path": "500000,500100,500116",
      "parentCode": "500100"
},
{
      "code": "500117",
      "name": "合川区",
      "type": 3,
      "path": "500000,500100,500117",
      "parentCode": "500100"
},
{
      "code": "500118",
      "name": "永川区",
      "type": 3,
      "path": "500000,500100,500118",
      "parentCode": "500100"
},
{
      "code": "500119",
      "name": "南川区",
      "type": 3,
      "path": "500000,500100,500119",
      "parentCode": "500100"
},
{
      "code": "500120",
      "name": "璧山区",
      "type": 3,
      "path": "500000,500100,500120",
      "parentCode": "500100"
},
{
      "code": "500151",
      "name": "铜梁区",
      "type": 3,
      "path": "500000,500100,500151",
      "parentCode": "500100"
},
{
      "code": "500200",
      "name": "重庆市辖县",
      "type": 2,
      "path": "500000,500200",
      "parentCode": "500000"
},
{
      "code": "500223",
      "name": "潼南县",
      "type": 3,
      "path": "500000,500200,500223",
      "parentCode": "500200"
},
{
      "code": "500226",
      "name": "荣昌县",
      "type": 3,
      "path": "500000,500200,500226",
      "parentCode": "500200"
},
{
      "code": "500228",
      "name": "梁平县",
      "type": 3,
      "path": "500000,500200,500228",
      "parentCode": "500200"
},
{
      "code": "500229",
      "name": "城口县",
      "type": 3,
      "path": "500000,500200,500229",
      "parentCode": "500200"
},
{
      "code": "500230",
      "name": "丰都县",
      "type": 3,
      "path": "500000,500200,500230",
      "parentCode": "500200"
},
{
      "code": "500231",
      "name": "垫江县",
      "type": 3,
      "path": "500000,500200,500231",
      "parentCode": "500200"
},
{
      "code": "500232",
      "name": "武隆县",
      "type": 3,
      "path": "500000,500200,500232",
      "parentCode": "500200"
},
{
      "code": "500233",
      "name": "忠县",
      "type": 3,
      "path": "500000,500200,500233",
      "parentCode": "500200"
},
{
      "code": "500234",
      "name": "开县",
      "type": 3,
      "path": "500000,500200,500234",
      "parentCode": "500200"
},
{
      "code": "500235",
      "name": "云阳县",
      "type": 3,
      "path": "500000,500200,500235",
      "parentCode": "500200"
},
{
      "code": "500236",
      "name": "奉节县",
      "type": 3,
      "path": "500000,500200,500236",
      "parentCode": "500200"
},
{
      "code": "500237",
      "name": "巫山县",
      "type": 3,
      "path": "500000,500200,500237",
      "parentCode": "500200"
},
{
      "code": "500238",
      "name": "巫溪县",
      "type": 3,
      "path": "500000,500200,500238",
      "parentCode": "500200"
},
{
      "code": "500240",
      "name": "石柱土家族自治县",
      "type": 3,
      "path": "500000,500200,500240",
      "parentCode": "500200"
},
{
      "code": "500241",
      "name": "秀山土家族苗族自治县",
      "type": 3,
      "path": "500000,500200,500241",
      "parentCode": "500200"
},
{
      "code": "500242",
      "name": "酉阳土家族苗族自治县",
      "type": 3,
      "path": "500000,500200,500242",
      "parentCode": "500200"
},
{
      "code": "500243",
      "name": "彭水苗族土家族自治县",
      "type": 3,
      "path": "500000,500200,500243",
      "parentCode": "500200"
},
{
      "code": "510000",
      "name": "四川省",
      "type": 1,
      "path": "510000",
      "parentCode": null
},
{
      "code": "510100",
      "name": "成都市",
      "type": 2,
      "path": "510000,510100",
      "parentCode": "510000"
},
{
      "code": "510104",
      "name": "锦江区",
      "type": 3,
      "path": "510000,510100,510104",
      "parentCode": "510100"
},
{
      "code": "510105",
      "name": "青羊区",
      "type": 3,
      "path": "510000,510100,510105",
      "parentCode": "510100"
},
{
      "code": "510106",
      "name": "金牛区",
      "type": 3,
      "path": "510000,510100,510106",
      "parentCode": "510100"
},
{
      "code": "510107",
      "name": "武侯区",
      "type": 3,
      "path": "510000,510100,510107",
      "parentCode": "510100"
},
{
      "code": "510108",
      "name": "成华区",
      "type": 3,
      "path": "510000,510100,510108",
      "parentCode": "510100"
},
{
      "code": "510112",
      "name": "龙泉驿区",
      "type": 3,
      "path": "510000,510100,510112",
      "parentCode": "510100"
},
{
      "code": "510113",
      "name": "青白江区",
      "type": 3,
      "path": "510000,510100,510113",
      "parentCode": "510100"
},
{
      "code": "510114",
      "name": "新都区",
      "type": 3,
      "path": "510000,510100,510114",
      "parentCode": "510100"
},
{
      "code": "510115",
      "name": "温江区",
      "type": 3,
      "path": "510000,510100,510115",
      "parentCode": "510100"
},
{
      "code": "510121",
      "name": "金堂县",
      "type": 3,
      "path": "510000,510100,510121",
      "parentCode": "510100"
},
{
      "code": "510122",
      "name": "双流县",
      "type": 3,
      "path": "510000,510100,510122",
      "parentCode": "510100"
},
{
      "code": "510124",
      "name": "郫县",
      "type": 3,
      "path": "510000,510100,510124",
      "parentCode": "510100"
},
{
      "code": "510129",
      "name": "大邑县",
      "type": 3,
      "path": "510000,510100,510129",
      "parentCode": "510100"
},
{
      "code": "510131",
      "name": "蒲江县",
      "type": 3,
      "path": "510000,510100,510131",
      "parentCode": "510100"
},
{
      "code": "510132",
      "name": "新津县",
      "type": 3,
      "path": "510000,510100,510132",
      "parentCode": "510100"
},
{
      "code": "510181",
      "name": "都江堰市",
      "type": 3,
      "path": "510000,510100,510181",
      "parentCode": "510100"
},
{
      "code": "510182",
      "name": "彭州市",
      "type": 3,
      "path": "510000,510100,510182",
      "parentCode": "510100"
},
{
      "code": "510183",
      "name": "邛崃市",
      "type": 3,
      "path": "510000,510100,510183",
      "parentCode": "510100"
},
{
      "code": "510184",
      "name": "崇州市",
      "type": 3,
      "path": "510000,510100,510184",
      "parentCode": "510100"
},
{
      "code": "510300",
      "name": "自贡市",
      "type": 2,
      "path": "510000,510300",
      "parentCode": "510000"
},
{
      "code": "510302",
      "name": "自流井区",
      "type": 3,
      "path": "510000,510300,510302",
      "parentCode": "510300"
},
{
      "code": "510303",
      "name": "贡井区",
      "type": 3,
      "path": "510000,510300,510303",
      "parentCode": "510300"
},
{
      "code": "510304",
      "name": "大安区",
      "type": 3,
      "path": "510000,510300,510304",
      "parentCode": "510300"
},
{
      "code": "510311",
      "name": "沿滩区",
      "type": 3,
      "path": "510000,510300,510311",
      "parentCode": "510300"
},
{
      "code": "510321",
      "name": "荣县",
      "type": 3,
      "path": "510000,510300,510321",
      "parentCode": "510300"
},
{
      "code": "510322",
      "name": "富顺县",
      "type": 3,
      "path": "510000,510300,510322",
      "parentCode": "510300"
},
{
      "code": "510400",
      "name": "攀枝花市",
      "type": 2,
      "path": "510000,510400",
      "parentCode": "510000"
},
{
      "code": "510402",
      "name": "东区",
      "type": 3,
      "path": "510000,510400,510402",
      "parentCode": "510400"
},
{
      "code": "510403",
      "name": "西区",
      "type": 3,
      "path": "510000,510400,510403",
      "parentCode": "510400"
},
{
      "code": "510411",
      "name": "仁和区",
      "type": 3,
      "path": "510000,510400,510411",
      "parentCode": "510400"
},
{
      "code": "510421",
      "name": "米易县",
      "type": 3,
      "path": "510000,510400,510421",
      "parentCode": "510400"
},
{
      "code": "510422",
      "name": "盐边县",
      "type": 3,
      "path": "510000,510400,510422",
      "parentCode": "510400"
},
{
      "code": "510500",
      "name": "泸州市",
      "type": 2,
      "path": "510000,510500",
      "parentCode": "510000"
},
{
      "code": "510502",
      "name": "江阳区",
      "type": 3,
      "path": "510000,510500,510502",
      "parentCode": "510500"
},
{
      "code": "510503",
      "name": "纳溪区",
      "type": 3,
      "path": "510000,510500,510503",
      "parentCode": "510500"
},
{
      "code": "510504",
      "name": "龙马潭区",
      "type": 3,
      "path": "510000,510500,510504",
      "parentCode": "510500"
},
{
      "code": "510521",
      "name": "泸县",
      "type": 3,
      "path": "510000,510500,510521",
      "parentCode": "510500"
},
{
      "code": "510522",
      "name": "合江县",
      "type": 3,
      "path": "510000,510500,510522",
      "parentCode": "510500"
},
{
      "code": "510524",
      "name": "叙永县",
      "type": 3,
      "path": "510000,510500,510524",
      "parentCode": "510500"
},
{
      "code": "510525",
      "name": "古蔺县",
      "type": 3,
      "path": "510000,510500,510525",
      "parentCode": "510500"
},
{
      "code": "510600",
      "name": "德阳市",
      "type": 2,
      "path": "510000,510600",
      "parentCode": "510000"
},
{
      "code": "510603",
      "name": "旌阳区",
      "type": 3,
      "path": "510000,510600,510603",
      "parentCode": "510600"
},
{
      "code": "510623",
      "name": "中江县",
      "type": 3,
      "path": "510000,510600,510623",
      "parentCode": "510600"
},
{
      "code": "510626",
      "name": "罗江县",
      "type": 3,
      "path": "510000,510600,510626",
      "parentCode": "510600"
},
{
      "code": "510681",
      "name": "广汉市",
      "type": 3,
      "path": "510000,510600,510681",
      "parentCode": "510600"
},
{
      "code": "510682",
      "name": "什邡市",
      "type": 3,
      "path": "510000,510600,510682",
      "parentCode": "510600"
},
{
      "code": "510683",
      "name": "绵竹市",
      "type": 3,
      "path": "510000,510600,510683",
      "parentCode": "510600"
},
{
      "code": "510700",
      "name": "绵阳市",
      "type": 2,
      "path": "510000,510700",
      "parentCode": "510000"
},
{
      "code": "510703",
      "name": "涪城区",
      "type": 3,
      "path": "510000,510700,510703",
      "parentCode": "510700"
},
{
      "code": "510704",
      "name": "游仙区",
      "type": 3,
      "path": "510000,510700,510704",
      "parentCode": "510700"
},
{
      "code": "510722",
      "name": "三台县",
      "type": 3,
      "path": "510000,510700,510722",
      "parentCode": "510700"
},
{
      "code": "510723",
      "name": "盐亭县",
      "type": 3,
      "path": "510000,510700,510723",
      "parentCode": "510700"
},
{
      "code": "510724",
      "name": "安县",
      "type": 3,
      "path": "510000,510700,510724",
      "parentCode": "510700"
},
{
      "code": "510725",
      "name": "梓潼县",
      "type": 3,
      "path": "510000,510700,510725",
      "parentCode": "510700"
},
{
      "code": "510726",
      "name": "北川羌族自治县",
      "type": 3,
      "path": "510000,510700,510726",
      "parentCode": "510700"
},
{
      "code": "510727",
      "name": "平武县",
      "type": 3,
      "path": "510000,510700,510727",
      "parentCode": "510700"
},
{
      "code": "510781",
      "name": "江油市",
      "type": 3,
      "path": "510000,510700,510781",
      "parentCode": "510700"
},
{
      "code": "510800",
      "name": "广元市",
      "type": 2,
      "path": "510000,510800",
      "parentCode": "510000"
},
{
      "code": "510802",
      "name": "利州区",
      "type": 3,
      "path": "510000,510800,510802",
      "parentCode": "510800"
},
{
      "code": "510811",
      "name": "昭化区",
      "type": 3,
      "path": "510000,510800,510811",
      "parentCode": "510800"
},
{
      "code": "510812",
      "name": "朝天区",
      "type": 3,
      "path": "510000,510800,510812",
      "parentCode": "510800"
},
{
      "code": "510821",
      "name": "旺苍县",
      "type": 3,
      "path": "510000,510800,510821",
      "parentCode": "510800"
},
{
      "code": "510822",
      "name": "青川县",
      "type": 3,
      "path": "510000,510800,510822",
      "parentCode": "510800"
},
{
      "code": "510823",
      "name": "剑阁县",
      "type": 3,
      "path": "510000,510800,510823",
      "parentCode": "510800"
},
{
      "code": "510824",
      "name": "苍溪县",
      "type": 3,
      "path": "510000,510800,510824",
      "parentCode": "510800"
},
{
      "code": "510900",
      "name": "遂宁市",
      "type": 2,
      "path": "510000,510900",
      "parentCode": "510000"
},
{
      "code": "510903",
      "name": "船山区",
      "type": 3,
      "path": "510000,510900,510903",
      "parentCode": "510900"
},
{
      "code": "510904",
      "name": "安居区",
      "type": 3,
      "path": "510000,510900,510904",
      "parentCode": "510900"
},
{
      "code": "510921",
      "name": "蓬溪县",
      "type": 3,
      "path": "510000,510900,510921",
      "parentCode": "510900"
},
{
      "code": "510922",
      "name": "射洪县",
      "type": 3,
      "path": "510000,510900,510922",
      "parentCode": "510900"
},
{
      "code": "510923",
      "name": "大英县",
      "type": 3,
      "path": "510000,510900,510923",
      "parentCode": "510900"
},
{
      "code": "511000",
      "name": "内江市",
      "type": 2,
      "path": "510000,511000",
      "parentCode": "510000"
},
{
      "code": "511002",
      "name": "市中区",
      "type": 3,
      "path": "510000,511000,511002",
      "parentCode": "511000"
},
{
      "code": "511011",
      "name": "东兴区",
      "type": 3,
      "path": "510000,511000,511011",
      "parentCode": "511000"
},
{
      "code": "511024",
      "name": "威远县",
      "type": 3,
      "path": "510000,511000,511024",
      "parentCode": "511000"
},
{
      "code": "511025",
      "name": "资中县",
      "type": 3,
      "path": "510000,511000,511025",
      "parentCode": "511000"
},
{
      "code": "511028",
      "name": "隆昌县",
      "type": 3,
      "path": "510000,511000,511028",
      "parentCode": "511000"
},
{
      "code": "511100",
      "name": "乐山市",
      "type": 2,
      "path": "510000,511100",
      "parentCode": "510000"
},
{
      "code": "511102",
      "name": "市中区",
      "type": 3,
      "path": "510000,511100,511102",
      "parentCode": "511100"
},
{
      "code": "511111",
      "name": "沙湾区",
      "type": 3,
      "path": "510000,511100,511111",
      "parentCode": "511100"
},
{
      "code": "511112",
      "name": "五通桥区",
      "type": 3,
      "path": "510000,511100,511112",
      "parentCode": "511100"
},
{
      "code": "511113",
      "name": "金口河区",
      "type": 3,
      "path": "510000,511100,511113",
      "parentCode": "511100"
},
{
      "code": "511123",
      "name": "犍为县",
      "type": 3,
      "path": "510000,511100,511123",
      "parentCode": "511100"
},
{
      "code": "511124",
      "name": "井研县",
      "type": 3,
      "path": "510000,511100,511124",
      "parentCode": "511100"
},
{
      "code": "511126",
      "name": "夹江县",
      "type": 3,
      "path": "510000,511100,511126",
      "parentCode": "511100"
},
{
      "code": "511129",
      "name": "沐川县",
      "type": 3,
      "path": "510000,511100,511129",
      "parentCode": "511100"
},
{
      "code": "511132",
      "name": "峨边彝族自治县",
      "type": 3,
      "path": "510000,511100,511132",
      "parentCode": "511100"
},
{
      "code": "511133",
      "name": "马边彝族自治县",
      "type": 3,
      "path": "510000,511100,511133",
      "parentCode": "511100"
},
{
      "code": "511181",
      "name": "峨眉山市",
      "type": 3,
      "path": "510000,511100,511181",
      "parentCode": "511100"
},
{
      "code": "511300",
      "name": "南充市",
      "type": 2,
      "path": "510000,511300",
      "parentCode": "510000"
},
{
      "code": "511302",
      "name": "顺庆区",
      "type": 3,
      "path": "510000,511300,511302",
      "parentCode": "511300"
},
{
      "code": "511303",
      "name": "高坪区",
      "type": 3,
      "path": "510000,511300,511303",
      "parentCode": "511300"
},
{
      "code": "511304",
      "name": "嘉陵区",
      "type": 3,
      "path": "510000,511300,511304",
      "parentCode": "511300"
},
{
      "code": "511321",
      "name": "南部县",
      "type": 3,
      "path": "510000,511300,511321",
      "parentCode": "511300"
},
{
      "code": "511322",
      "name": "营山县",
      "type": 3,
      "path": "510000,511300,511322",
      "parentCode": "511300"
},
{
      "code": "511323",
      "name": "蓬安县",
      "type": 3,
      "path": "510000,511300,511323",
      "parentCode": "511300"
},
{
      "code": "511324",
      "name": "仪陇县",
      "type": 3,
      "path": "510000,511300,511324",
      "parentCode": "511300"
},
{
      "code": "511325",
      "name": "西充县",
      "type": 3,
      "path": "510000,511300,511325",
      "parentCode": "511300"
},
{
      "code": "511381",
      "name": "阆中市",
      "type": 3,
      "path": "510000,511300,511381",
      "parentCode": "511300"
},
{
      "code": "511400",
      "name": "眉山市",
      "type": 2,
      "path": "510000,511400",
      "parentCode": "510000"
},
{
      "code": "511402",
      "name": "东坡区",
      "type": 3,
      "path": "510000,511400,511402",
      "parentCode": "511400"
},
{
      "code": "511421",
      "name": "仁寿县",
      "type": 3,
      "path": "510000,511400,511421",
      "parentCode": "511400"
},
{
      "code": "511422",
      "name": "彭山县",
      "type": 3,
      "path": "510000,511400,511422",
      "parentCode": "511400"
},
{
      "code": "511423",
      "name": "洪雅县",
      "type": 3,
      "path": "510000,511400,511423",
      "parentCode": "511400"
},
{
      "code": "511424",
      "name": "丹棱县",
      "type": 3,
      "path": "510000,511400,511424",
      "parentCode": "511400"
},
{
      "code": "511425",
      "name": "青神县",
      "type": 3,
      "path": "510000,511400,511425",
      "parentCode": "511400"
},
{
      "code": "511500",
      "name": "宜宾市",
      "type": 2,
      "path": "510000,511500",
      "parentCode": "510000"
},
{
      "code": "511502",
      "name": "翠屏区",
      "type": 3,
      "path": "510000,511500,511502",
      "parentCode": "511500"
},
{
      "code": "511503",
      "name": "南溪区",
      "type": 3,
      "path": "510000,511500,511503",
      "parentCode": "511500"
},
{
      "code": "511521",
      "name": "宜宾县",
      "type": 3,
      "path": "510000,511500,511521",
      "parentCode": "511500"
},
{
      "code": "511523",
      "name": "江安县",
      "type": 3,
      "path": "510000,511500,511523",
      "parentCode": "511500"
},
{
      "code": "511524",
      "name": "长宁县",
      "type": 3,
      "path": "510000,511500,511524",
      "parentCode": "511500"
},
{
      "code": "511525",
      "name": "高县",
      "type": 3,
      "path": "510000,511500,511525",
      "parentCode": "511500"
},
{
      "code": "511526",
      "name": "珙县",
      "type": 3,
      "path": "510000,511500,511526",
      "parentCode": "511500"
},
{
      "code": "511527",
      "name": "筠连县",
      "type": 3,
      "path": "510000,511500,511527",
      "parentCode": "511500"
},
{
      "code": "511528",
      "name": "兴文县",
      "type": 3,
      "path": "510000,511500,511528",
      "parentCode": "511500"
},
{
      "code": "511529",
      "name": "屏山县",
      "type": 3,
      "path": "510000,511500,511529",
      "parentCode": "511500"
},
{
      "code": "511600",
      "name": "广安市",
      "type": 2,
      "path": "510000,511600",
      "parentCode": "510000"
},
{
      "code": "511602",
      "name": "广安区",
      "type": 3,
      "path": "510000,511600,511602",
      "parentCode": "511600"
},
{
      "code": "511603",
      "name": "前锋区",
      "type": 3,
      "path": "510000,511600,511603",
      "parentCode": "511600"
},
{
      "code": "511621",
      "name": "岳池县",
      "type": 3,
      "path": "510000,511600,511621",
      "parentCode": "511600"
},
{
      "code": "511622",
      "name": "武胜县",
      "type": 3,
      "path": "510000,511600,511622",
      "parentCode": "511600"
},
{
      "code": "511623",
      "name": "邻水县",
      "type": 3,
      "path": "510000,511600,511623",
      "parentCode": "511600"
},
{
      "code": "511681",
      "name": "华蓥市",
      "type": 3,
      "path": "510000,511600,511681",
      "parentCode": "511600"
},
{
      "code": "511700",
      "name": "达州市",
      "type": 2,
      "path": "510000,511700",
      "parentCode": "510000"
},
{
      "code": "511702",
      "name": "通川区",
      "type": 3,
      "path": "510000,511700,511702",
      "parentCode": "511700"
},
{
      "code": "511703",
      "name": "达川区",
      "type": 3,
      "path": "510000,511700,511703",
      "parentCode": "511700"
},
{
      "code": "511722",
      "name": "宣汉县",
      "type": 3,
      "path": "510000,511700,511722",
      "parentCode": "511700"
},
{
      "code": "511723",
      "name": "开江县",
      "type": 3,
      "path": "510000,511700,511723",
      "parentCode": "511700"
},
{
      "code": "511724",
      "name": "大竹县",
      "type": 3,
      "path": "510000,511700,511724",
      "parentCode": "511700"
},
{
      "code": "511725",
      "name": "渠县",
      "type": 3,
      "path": "510000,511700,511725",
      "parentCode": "511700"
},
{
      "code": "511781",
      "name": "万源市",
      "type": 3,
      "path": "510000,511700,511781",
      "parentCode": "511700"
},
{
      "code": "511800",
      "name": "雅安市",
      "type": 2,
      "path": "510000,511800",
      "parentCode": "510000"
},
{
      "code": "511802",
      "name": "雨城区",
      "type": 3,
      "path": "510000,511800,511802",
      "parentCode": "511800"
},
{
      "code": "511803",
      "name": "名山区",
      "type": 3,
      "path": "510000,511800,511803",
      "parentCode": "511800"
},
{
      "code": "511822",
      "name": "荥经县",
      "type": 3,
      "path": "510000,511800,511822",
      "parentCode": "511800"
},
{
      "code": "511823",
      "name": "汉源县",
      "type": 3,
      "path": "510000,511800,511823",
      "parentCode": "511800"
},
{
      "code": "511824",
      "name": "石棉县",
      "type": 3,
      "path": "510000,511800,511824",
      "parentCode": "511800"
},
{
      "code": "511825",
      "name": "天全县",
      "type": 3,
      "path": "510000,511800,511825",
      "parentCode": "511800"
},
{
      "code": "511826",
      "name": "芦山县",
      "type": 3,
      "path": "510000,511800,511826",
      "parentCode": "511800"
},
{
      "code": "511827",
      "name": "宝兴县",
      "type": 3,
      "path": "510000,511800,511827",
      "parentCode": "511800"
},
{
      "code": "511900",
      "name": "巴中市",
      "type": 2,
      "path": "510000,511900",
      "parentCode": "510000"
},
{
      "code": "511902",
      "name": "巴州区",
      "type": 3,
      "path": "510000,511900,511902",
      "parentCode": "511900"
},
{
      "code": "511903",
      "name": "恩阳区",
      "type": 3,
      "path": "510000,511900,511903",
      "parentCode": "511900"
},
{
      "code": "511921",
      "name": "通江县",
      "type": 3,
      "path": "510000,511900,511921",
      "parentCode": "511900"
},
{
      "code": "511922",
      "name": "南江县",
      "type": 3,
      "path": "510000,511900,511922",
      "parentCode": "511900"
},
{
      "code": "511923",
      "name": "平昌县",
      "type": 3,
      "path": "510000,511900,511923",
      "parentCode": "511900"
},
{
      "code": "512000",
      "name": "资阳市",
      "type": 2,
      "path": "510000,512000",
      "parentCode": "510000"
},
{
      "code": "512002",
      "name": "雁江区",
      "type": 3,
      "path": "510000,512000,512002",
      "parentCode": "512000"
},
{
      "code": "512021",
      "name": "安岳县",
      "type": 3,
      "path": "510000,512000,512021",
      "parentCode": "512000"
},
{
      "code": "512022",
      "name": "乐至县",
      "type": 3,
      "path": "510000,512000,512022",
      "parentCode": "512000"
},
{
      "code": "512081",
      "name": "简阳市",
      "type": 3,
      "path": "510000,512000,512081",
      "parentCode": "512000"
},
{
      "code": "513200",
      "name": "阿坝藏族羌族自治州",
      "type": 2,
      "path": "510000,513200",
      "parentCode": "510000"
},
{
      "code": "513221",
      "name": "汶川县",
      "type": 3,
      "path": "510000,513200,513221",
      "parentCode": "513200"
},
{
      "code": "513222",
      "name": "理县",
      "type": 3,
      "path": "510000,513200,513222",
      "parentCode": "513200"
},
{
      "code": "513223",
      "name": "茂县",
      "type": 3,
      "path": "510000,513200,513223",
      "parentCode": "513200"
},
{
      "code": "513224",
      "name": "松潘县",
      "type": 3,
      "path": "510000,513200,513224",
      "parentCode": "513200"
},
{
      "code": "513225",
      "name": "九寨沟县",
      "type": 3,
      "path": "510000,513200,513225",
      "parentCode": "513200"
},
{
      "code": "513226",
      "name": "金川县",
      "type": 3,
      "path": "510000,513200,513226",
      "parentCode": "513200"
},
{
      "code": "513227",
      "name": "小金县",
      "type": 3,
      "path": "510000,513200,513227",
      "parentCode": "513200"
},
{
      "code": "513228",
      "name": "黑水县",
      "type": 3,
      "path": "510000,513200,513228",
      "parentCode": "513200"
},
{
      "code": "513229",
      "name": "马尔康县",
      "type": 3,
      "path": "510000,513200,513229",
      "parentCode": "513200"
},
{
      "code": "513230",
      "name": "壤塘县",
      "type": 3,
      "path": "510000,513200,513230",
      "parentCode": "513200"
},
{
      "code": "513231",
      "name": "阿坝县",
      "type": 3,
      "path": "510000,513200,513231",
      "parentCode": "513200"
},
{
      "code": "513232",
      "name": "若尔盖县",
      "type": 3,
      "path": "510000,513200,513232",
      "parentCode": "513200"
},
{
      "code": "513233",
      "name": "红原县",
      "type": 3,
      "path": "510000,513200,513233",
      "parentCode": "513200"
},
{
      "code": "513300",
      "name": "甘孜藏族自治州",
      "type": 2,
      "path": "510000,513300",
      "parentCode": "510000"
},
{
      "code": "513321",
      "name": "康定县",
      "type": 3,
      "path": "510000,513300,513321",
      "parentCode": "513300"
},
{
      "code": "513322",
      "name": "泸定县",
      "type": 3,
      "path": "510000,513300,513322",
      "parentCode": "513300"
},
{
      "code": "513323",
      "name": "丹巴县",
      "type": 3,
      "path": "510000,513300,513323",
      "parentCode": "513300"
},
{
      "code": "513324",
      "name": "九龙县",
      "type": 3,
      "path": "510000,513300,513324",
      "parentCode": "513300"
},
{
      "code": "513325",
      "name": "雅江县",
      "type": 3,
      "path": "510000,513300,513325",
      "parentCode": "513300"
},
{
      "code": "513326",
      "name": "道孚县",
      "type": 3,
      "path": "510000,513300,513326",
      "parentCode": "513300"
},
{
      "code": "513327",
      "name": "炉霍县",
      "type": 3,
      "path": "510000,513300,513327",
      "parentCode": "513300"
},
{
      "code": "513328",
      "name": "甘孜县",
      "type": 3,
      "path": "510000,513300,513328",
      "parentCode": "513300"
},
{
      "code": "513329",
      "name": "新龙县",
      "type": 3,
      "path": "510000,513300,513329",
      "parentCode": "513300"
},
{
      "code": "513330",
      "name": "德格县",
      "type": 3,
      "path": "510000,513300,513330",
      "parentCode": "513300"
},
{
      "code": "513331",
      "name": "白玉县",
      "type": 3,
      "path": "510000,513300,513331",
      "parentCode": "513300"
},
{
      "code": "513332",
      "name": "石渠县",
      "type": 3,
      "path": "510000,513300,513332",
      "parentCode": "513300"
},
{
      "code": "513333",
      "name": "色达县",
      "type": 3,
      "path": "510000,513300,513333",
      "parentCode": "513300"
},
{
      "code": "513334",
      "name": "理塘县",
      "type": 3,
      "path": "510000,513300,513334",
      "parentCode": "513300"
},
{
      "code": "513335",
      "name": "巴塘县",
      "type": 3,
      "path": "510000,513300,513335",
      "parentCode": "513300"
},
{
      "code": "513336",
      "name": "乡城县",
      "type": 3,
      "path": "510000,513300,513336",
      "parentCode": "513300"
},
{
      "code": "513337",
      "name": "稻城县",
      "type": 3,
      "path": "510000,513300,513337",
      "parentCode": "513300"
},
{
      "code": "513338",
      "name": "得荣县",
      "type": 3,
      "path": "510000,513300,513338",
      "parentCode": "513300"
},
{
      "code": "513400",
      "name": "凉山彝族自治州",
      "type": 2,
      "path": "510000,513400",
      "parentCode": "510000"
},
{
      "code": "513401",
      "name": "西昌市",
      "type": 3,
      "path": "510000,513400,513401",
      "parentCode": "513400"
},
{
      "code": "513422",
      "name": "木里藏族自治县",
      "type": 3,
      "path": "510000,513400,513422",
      "parentCode": "513400"
},
{
      "code": "513423",
      "name": "盐源县",
      "type": 3,
      "path": "510000,513400,513423",
      "parentCode": "513400"
},
{
      "code": "513424",
      "name": "德昌县",
      "type": 3,
      "path": "510000,513400,513424",
      "parentCode": "513400"
},
{
      "code": "513425",
      "name": "会理县",
      "type": 3,
      "path": "510000,513400,513425",
      "parentCode": "513400"
},
{
      "code": "513426",
      "name": "会东县",
      "type": 3,
      "path": "510000,513400,513426",
      "parentCode": "513400"
},
{
      "code": "513427",
      "name": "宁南县",
      "type": 3,
      "path": "510000,513400,513427",
      "parentCode": "513400"
},
{
      "code": "513428",
      "name": "普格县",
      "type": 3,
      "path": "510000,513400,513428",
      "parentCode": "513400"
},
{
      "code": "513429",
      "name": "布拖县",
      "type": 3,
      "path": "510000,513400,513429",
      "parentCode": "513400"
},
{
      "code": "513430",
      "name": "金阳县",
      "type": 3,
      "path": "510000,513400,513430",
      "parentCode": "513400"
},
{
      "code": "513431",
      "name": "昭觉县",
      "type": 3,
      "path": "510000,513400,513431",
      "parentCode": "513400"
},
{
      "code": "513432",
      "name": "喜德县",
      "type": 3,
      "path": "510000,513400,513432",
      "parentCode": "513400"
},
{
      "code": "513433",
      "name": "冕宁县",
      "type": 3,
      "path": "510000,513400,513433",
      "parentCode": "513400"
},
{
      "code": "513434",
      "name": "越西县",
      "type": 3,
      "path": "510000,513400,513434",
      "parentCode": "513400"
},
{
      "code": "513435",
      "name": "甘洛县",
      "type": 3,
      "path": "510000,513400,513435",
      "parentCode": "513400"
},
{
      "code": "513436",
      "name": "美姑县",
      "type": 3,
      "path": "510000,513400,513436",
      "parentCode": "513400"
},
{
      "code": "513437",
      "name": "雷波县",
      "type": 3,
      "path": "510000,513400,513437",
      "parentCode": "513400"
},
{
      "code": "520000",
      "name": "贵州省",
      "type": 1,
      "path": "520000",
      "parentCode": null
},
{
      "code": "520100",
      "name": "贵阳市",
      "type": 2,
      "path": "520000,520100",
      "parentCode": "520000"
},
{
      "code": "520102",
      "name": "南明区",
      "type": 3,
      "path": "520000,520100,520102",
      "parentCode": "520100"
},
{
      "code": "520103",
      "name": "云岩区",
      "type": 3,
      "path": "520000,520100,520103",
      "parentCode": "520100"
},
{
      "code": "520111",
      "name": "花溪区",
      "type": 3,
      "path": "520000,520100,520111",
      "parentCode": "520100"
},
{
      "code": "520112",
      "name": "乌当区",
      "type": 3,
      "path": "520000,520100,520112",
      "parentCode": "520100"
},
{
      "code": "520113",
      "name": "白云区",
      "type": 3,
      "path": "520000,520100,520113",
      "parentCode": "520100"
},
{
      "code": "520115",
      "name": "观山湖区",
      "type": 3,
      "path": "520000,520100,520115",
      "parentCode": "520100"
},
{
      "code": "520121",
      "name": "开阳县",
      "type": 3,
      "path": "520000,520100,520121",
      "parentCode": "520100"
},
{
      "code": "520122",
      "name": "息烽县",
      "type": 3,
      "path": "520000,520100,520122",
      "parentCode": "520100"
},
{
      "code": "520123",
      "name": "修文县",
      "type": 3,
      "path": "520000,520100,520123",
      "parentCode": "520100"
},
{
      "code": "520181",
      "name": "清镇市",
      "type": 3,
      "path": "520000,520100,520181",
      "parentCode": "520100"
},
{
      "code": "520200",
      "name": "六盘水市",
      "type": 2,
      "path": "520000,520200",
      "parentCode": "520000"
},
{
      "code": "520201",
      "name": "钟山区",
      "type": 3,
      "path": "520000,520200,520201",
      "parentCode": "520200"
},
{
      "code": "520203",
      "name": "六枝特区",
      "type": 3,
      "path": "520000,520200,520203",
      "parentCode": "520200"
},
{
      "code": "520221",
      "name": "水城县",
      "type": 3,
      "path": "520000,520200,520221",
      "parentCode": "520200"
},
{
      "code": "520222",
      "name": "盘县",
      "type": 3,
      "path": "520000,520200,520222",
      "parentCode": "520200"
},
{
      "code": "520300",
      "name": "遵义市",
      "type": 2,
      "path": "520000,520300",
      "parentCode": "520000"
},
{
      "code": "520302",
      "name": "红花岗区",
      "type": 3,
      "path": "520000,520300,520302",
      "parentCode": "520300"
},
{
      "code": "520303",
      "name": "汇川区",
      "type": 3,
      "path": "520000,520300,520303",
      "parentCode": "520300"
},
{
      "code": "520321",
      "name": "遵义县",
      "type": 3,
      "path": "520000,520300,520321",
      "parentCode": "520300"
},
{
      "code": "520322",
      "name": "桐梓县",
      "type": 3,
      "path": "520000,520300,520322",
      "parentCode": "520300"
},
{
      "code": "520323",
      "name": "绥阳县",
      "type": 3,
      "path": "520000,520300,520323",
      "parentCode": "520300"
},
{
      "code": "520324",
      "name": "正安县",
      "type": 3,
      "path": "520000,520300,520324",
      "parentCode": "520300"
},
{
      "code": "520325",
      "name": "道真仡佬族苗族自治县",
      "type": 3,
      "path": "520000,520300,520325",
      "parentCode": "520300"
},
{
      "code": "520326",
      "name": "务川仡佬族苗族自治县",
      "type": 3,
      "path": "520000,520300,520326",
      "parentCode": "520300"
},
{
      "code": "520327",
      "name": "凤冈县",
      "type": 3,
      "path": "520000,520300,520327",
      "parentCode": "520300"
},
{
      "code": "520328",
      "name": "湄潭县",
      "type": 3,
      "path": "520000,520300,520328",
      "parentCode": "520300"
},
{
      "code": "520329",
      "name": "余庆县",
      "type": 3,
      "path": "520000,520300,520329",
      "parentCode": "520300"
},
{
      "code": "520330",
      "name": "习水县",
      "type": 3,
      "path": "520000,520300,520330",
      "parentCode": "520300"
},
{
      "code": "520381",
      "name": "赤水市",
      "type": 3,
      "path": "520000,520300,520381",
      "parentCode": "520300"
},
{
      "code": "520382",
      "name": "仁怀市",
      "type": 3,
      "path": "520000,520300,520382",
      "parentCode": "520300"
},
{
      "code": "520400",
      "name": "安顺市",
      "type": 2,
      "path": "520000,520400",
      "parentCode": "520000"
},
{
      "code": "520402",
      "name": "西秀区",
      "type": 3,
      "path": "520000,520400,520402",
      "parentCode": "520400"
},
{
      "code": "520421",
      "name": "平坝县",
      "type": 3,
      "path": "520000,520400,520421",
      "parentCode": "520400"
},
{
      "code": "520422",
      "name": "普定县",
      "type": 3,
      "path": "520000,520400,520422",
      "parentCode": "520400"
},
{
      "code": "520423",
      "name": "镇宁布依族苗族自治县",
      "type": 3,
      "path": "520000,520400,520423",
      "parentCode": "520400"
},
{
      "code": "520424",
      "name": "关岭布依族苗族自治县",
      "type": 3,
      "path": "520000,520400,520424",
      "parentCode": "520400"
},
{
      "code": "520425",
      "name": "紫云苗族布依族自治县",
      "type": 3,
      "path": "520000,520400,520425",
      "parentCode": "520400"
},
{
      "code": "522200",
      "name": "铜仁地区",
      "type": 2,
      "path": "520000,522200",
      "parentCode": "520000"
},
{
      "code": "520602",
      "name": "碧江区",
      "type": 3,
      "path": "520000,522200,520602",
      "parentCode": "522200"
},
{
      "code": "520603",
      "name": "万山区",
      "type": 3,
      "path": "520000,522200,520603",
      "parentCode": "522200"
},
{
      "code": "520621",
      "name": "江口县",
      "type": 3,
      "path": "520000,522200,520621",
      "parentCode": "522200"
},
{
      "code": "520622",
      "name": "玉屏侗族自治县",
      "type": 3,
      "path": "520000,522200,520622",
      "parentCode": "522200"
},
{
      "code": "520623",
      "name": "石阡县",
      "type": 3,
      "path": "520000,522200,520623",
      "parentCode": "522200"
},
{
      "code": "520624",
      "name": "思南县",
      "type": 3,
      "path": "520000,522200,520624",
      "parentCode": "522200"
},
{
      "code": "520625",
      "name": "印江土家族苗族自治县",
      "type": 3,
      "path": "520000,522200,520625",
      "parentCode": "522200"
},
{
      "code": "520626",
      "name": "德江县",
      "type": 3,
      "path": "520000,522200,520626",
      "parentCode": "522200"
},
{
      "code": "520627",
      "name": "沿河土家族自治县",
      "type": 3,
      "path": "520000,522200,520627",
      "parentCode": "522200"
},
{
      "code": "520628",
      "name": "松桃苗族自治县",
      "type": 3,
      "path": "520000,522200,520628",
      "parentCode": "522200"
},
{
      "code": "522200",
      "name": "铜仁地区",
      "type": 3,
      "path": "520000,522200,522200",
      "parentCode": "522200"
},
{
      "code": "522300",
      "name": "黔西南布依族苗族自治州",
      "type": 2,
      "path": "520000,522300",
      "parentCode": "520000"
},
{
      "code": "522301",
      "name": "兴义市",
      "type": 3,
      "path": "520000,522300,522301",
      "parentCode": "522300"
},
{
      "code": "522322",
      "name": "兴仁县",
      "type": 3,
      "path": "520000,522300,522322",
      "parentCode": "522300"
},
{
      "code": "522323",
      "name": "普安县",
      "type": 3,
      "path": "520000,522300,522323",
      "parentCode": "522300"
},
{
      "code": "522324",
      "name": "晴隆县",
      "type": 3,
      "path": "520000,522300,522324",
      "parentCode": "522300"
},
{
      "code": "522325",
      "name": "贞丰县",
      "type": 3,
      "path": "520000,522300,522325",
      "parentCode": "522300"
},
{
      "code": "522326",
      "name": "望谟县",
      "type": 3,
      "path": "520000,522300,522326",
      "parentCode": "522300"
},
{
      "code": "522327",
      "name": "册亨县",
      "type": 3,
      "path": "520000,522300,522327",
      "parentCode": "522300"
},
{
      "code": "522328",
      "name": "安龙县",
      "type": 3,
      "path": "520000,522300,522328",
      "parentCode": "522300"
},
{
      "code": "522400",
      "name": "毕节地区",
      "type": 2,
      "path": "520000,522400",
      "parentCode": "520000"
},
{
      "code": "520502",
      "name": "七星关区",
      "type": 3,
      "path": "520000,522400,520502",
      "parentCode": "522400"
},
{
      "code": "520521",
      "name": "大方县",
      "type": 3,
      "path": "520000,522400,520521",
      "parentCode": "522400"
},
{
      "code": "520522",
      "name": "黔西县",
      "type": 3,
      "path": "520000,522400,520522",
      "parentCode": "522400"
},
{
      "code": "520523",
      "name": "金沙县",
      "type": 3,
      "path": "520000,522400,520523",
      "parentCode": "522400"
},
{
      "code": "520524",
      "name": "织金县",
      "type": 3,
      "path": "520000,522400,520524",
      "parentCode": "522400"
},
{
      "code": "520525",
      "name": "纳雍县",
      "type": 3,
      "path": "520000,522400,520525",
      "parentCode": "522400"
},
{
      "code": "520526",
      "name": "威宁彝族回族苗族自治县",
      "type": 3,
      "path": "520000,522400,520526",
      "parentCode": "522400"
},
{
      "code": "520527",
      "name": "赫章县",
      "type": 3,
      "path": "520000,522400,520527",
      "parentCode": "522400"
},
{
      "code": "522400",
      "name": "毕节地区",
      "type": 3,
      "path": "520000,522400,522400",
      "parentCode": "522400"
},
{
      "code": "522600",
      "name": "黔东南苗族侗族自治州",
      "type": 2,
      "path": "520000,522600",
      "parentCode": "520000"
},
{
      "code": "522601",
      "name": "凯里市",
      "type": 3,
      "path": "520000,522600,522601",
      "parentCode": "522600"
},
{
      "code": "522622",
      "name": "黄平县",
      "type": 3,
      "path": "520000,522600,522622",
      "parentCode": "522600"
},
{
      "code": "522623",
      "name": "施秉县",
      "type": 3,
      "path": "520000,522600,522623",
      "parentCode": "522600"
},
{
      "code": "522624",
      "name": "三穗县",
      "type": 3,
      "path": "520000,522600,522624",
      "parentCode": "522600"
},
{
      "code": "522625",
      "name": "镇远县",
      "type": 3,
      "path": "520000,522600,522625",
      "parentCode": "522600"
},
{
      "code": "522626",
      "name": "岑巩县",
      "type": 3,
      "path": "520000,522600,522626",
      "parentCode": "522600"
},
{
      "code": "522627",
      "name": "天柱县",
      "type": 3,
      "path": "520000,522600,522627",
      "parentCode": "522600"
},
{
      "code": "522628",
      "name": "锦屏县",
      "type": 3,
      "path": "520000,522600,522628",
      "parentCode": "522600"
},
{
      "code": "522629",
      "name": "剑河县",
      "type": 3,
      "path": "520000,522600,522629",
      "parentCode": "522600"
},
{
      "code": "522630",
      "name": "台江县",
      "type": 3,
      "path": "520000,522600,522630",
      "parentCode": "522600"
},
{
      "code": "522631",
      "name": "黎平县",
      "type": 3,
      "path": "520000,522600,522631",
      "parentCode": "522600"
},
{
      "code": "522632",
      "name": "榕江县",
      "type": 3,
      "path": "520000,522600,522632",
      "parentCode": "522600"
},
{
      "code": "522633",
      "name": "从江县",
      "type": 3,
      "path": "520000,522600,522633",
      "parentCode": "522600"
},
{
      "code": "522634",
      "name": "雷山县",
      "type": 3,
      "path": "520000,522600,522634",
      "parentCode": "522600"
},
{
      "code": "522635",
      "name": "麻江县",
      "type": 3,
      "path": "520000,522600,522635",
      "parentCode": "522600"
},
{
      "code": "522636",
      "name": "丹寨县",
      "type": 3,
      "path": "520000,522600,522636",
      "parentCode": "522600"
},
{
      "code": "522700",
      "name": "黔南布依族苗族自治州",
      "type": 2,
      "path": "520000,522700",
      "parentCode": "520000"
},
{
      "code": "522701",
      "name": "都匀市",
      "type": 3,
      "path": "520000,522700,522701",
      "parentCode": "522700"
},
{
      "code": "522702",
      "name": "福泉市",
      "type": 3,
      "path": "520000,522700,522702",
      "parentCode": "522700"
},
{
      "code": "522722",
      "name": "荔波县",
      "type": 3,
      "path": "520000,522700,522722",
      "parentCode": "522700"
},
{
      "code": "522723",
      "name": "贵定县",
      "type": 3,
      "path": "520000,522700,522723",
      "parentCode": "522700"
},
{
      "code": "522725",
      "name": "瓮安县",
      "type": 3,
      "path": "520000,522700,522725",
      "parentCode": "522700"
},
{
      "code": "522726",
      "name": "独山县",
      "type": 3,
      "path": "520000,522700,522726",
      "parentCode": "522700"
},
{
      "code": "522727",
      "name": "平塘县",
      "type": 3,
      "path": "520000,522700,522727",
      "parentCode": "522700"
},
{
      "code": "522728",
      "name": "罗甸县",
      "type": 3,
      "path": "520000,522700,522728",
      "parentCode": "522700"
},
{
      "code": "522729",
      "name": "长顺县",
      "type": 3,
      "path": "520000,522700,522729",
      "parentCode": "522700"
},
{
      "code": "522730",
      "name": "龙里县",
      "type": 3,
      "path": "520000,522700,522730",
      "parentCode": "522700"
},
{
      "code": "522731",
      "name": "惠水县",
      "type": 3,
      "path": "520000,522700,522731",
      "parentCode": "522700"
},
{
      "code": "522732",
      "name": "三都水族自治县",
      "type": 3,
      "path": "520000,522700,522732",
      "parentCode": "522700"
},
{
      "code": "530000",
      "name": "云南省",
      "type": 1,
      "path": "530000",
      "parentCode": null
},
{
      "code": "530100",
      "name": "昆明市",
      "type": 2,
      "path": "530000,530100",
      "parentCode": "530000"
},
{
      "code": "530102",
      "name": "五华区",
      "type": 3,
      "path": "530000,530100,530102",
      "parentCode": "530100"
},
{
      "code": "530103",
      "name": "盘龙区",
      "type": 3,
      "path": "530000,530100,530103",
      "parentCode": "530100"
},
{
      "code": "530111",
      "name": "官渡区",
      "type": 3,
      "path": "530000,530100,530111",
      "parentCode": "530100"
},
{
      "code": "530112",
      "name": "西山区",
      "type": 3,
      "path": "530000,530100,530112",
      "parentCode": "530100"
},
{
      "code": "530113",
      "name": "东川区",
      "type": 3,
      "path": "530000,530100,530113",
      "parentCode": "530100"
},
{
      "code": "530114",
      "name": "呈贡区",
      "type": 3,
      "path": "530000,530100,530114",
      "parentCode": "530100"
},
{
      "code": "530122",
      "name": "晋宁县",
      "type": 3,
      "path": "530000,530100,530122",
      "parentCode": "530100"
},
{
      "code": "530124",
      "name": "富民县",
      "type": 3,
      "path": "530000,530100,530124",
      "parentCode": "530100"
},
{
      "code": "530125",
      "name": "宜良县",
      "type": 3,
      "path": "530000,530100,530125",
      "parentCode": "530100"
},
{
      "code": "530126",
      "name": "石林彝族自治县",
      "type": 3,
      "path": "530000,530100,530126",
      "parentCode": "530100"
},
{
      "code": "530127",
      "name": "嵩明县",
      "type": 3,
      "path": "530000,530100,530127",
      "parentCode": "530100"
},
{
      "code": "530128",
      "name": "禄劝彝族苗族自治县",
      "type": 3,
      "path": "530000,530100,530128",
      "parentCode": "530100"
},
{
      "code": "530129",
      "name": "寻甸回族彝族自治县",
      "type": 3,
      "path": "530000,530100,530129",
      "parentCode": "530100"
},
{
      "code": "530181",
      "name": "安宁市",
      "type": 3,
      "path": "530000,530100,530181",
      "parentCode": "530100"
},
{
      "code": "530300",
      "name": "曲靖市",
      "type": 2,
      "path": "530000,530300",
      "parentCode": "530000"
},
{
      "code": "530302",
      "name": "麒麟区",
      "type": 3,
      "path": "530000,530300,530302",
      "parentCode": "530300"
},
{
      "code": "530321",
      "name": "马龙县",
      "type": 3,
      "path": "530000,530300,530321",
      "parentCode": "530300"
},
{
      "code": "530322",
      "name": "陆良县",
      "type": 3,
      "path": "530000,530300,530322",
      "parentCode": "530300"
},
{
      "code": "530323",
      "name": "师宗县",
      "type": 3,
      "path": "530000,530300,530323",
      "parentCode": "530300"
},
{
      "code": "530324",
      "name": "罗平县",
      "type": 3,
      "path": "530000,530300,530324",
      "parentCode": "530300"
},
{
      "code": "530325",
      "name": "富源县",
      "type": 3,
      "path": "530000,530300,530325",
      "parentCode": "530300"
},
{
      "code": "530326",
      "name": "会泽县",
      "type": 3,
      "path": "530000,530300,530326",
      "parentCode": "530300"
},
{
      "code": "530328",
      "name": "沾益县",
      "type": 3,
      "path": "530000,530300,530328",
      "parentCode": "530300"
},
{
      "code": "530381",
      "name": "宣威市",
      "type": 3,
      "path": "530000,530300,530381",
      "parentCode": "530300"
},
{
      "code": "530400",
      "name": "玉溪市",
      "type": 2,
      "path": "530000,530400",
      "parentCode": "530000"
},
{
      "code": "530402",
      "name": "红塔区",
      "type": 3,
      "path": "530000,530400,530402",
      "parentCode": "530400"
},
{
      "code": "530421",
      "name": "江川县",
      "type": 3,
      "path": "530000,530400,530421",
      "parentCode": "530400"
},
{
      "code": "530422",
      "name": "澄江县",
      "type": 3,
      "path": "530000,530400,530422",
      "parentCode": "530400"
},
{
      "code": "530423",
      "name": "通海县",
      "type": 3,
      "path": "530000,530400,530423",
      "parentCode": "530400"
},
{
      "code": "530424",
      "name": "华宁县",
      "type": 3,
      "path": "530000,530400,530424",
      "parentCode": "530400"
},
{
      "code": "530425",
      "name": "易门县",
      "type": 3,
      "path": "530000,530400,530425",
      "parentCode": "530400"
},
{
      "code": "530426",
      "name": "峨山彝族自治县",
      "type": 3,
      "path": "530000,530400,530426",
      "parentCode": "530400"
},
{
      "code": "530427",
      "name": "新平彝族傣族自治县",
      "type": 3,
      "path": "530000,530400,530427",
      "parentCode": "530400"
},
{
      "code": "530428",
      "name": "元江哈尼族彝族傣族自治县",
      "type": 3,
      "path": "530000,530400,530428",
      "parentCode": "530400"
},
{
      "code": "530500",
      "name": "保山市",
      "type": 2,
      "path": "530000,530500",
      "parentCode": "530000"
},
{
      "code": "530502",
      "name": "隆阳区",
      "type": 3,
      "path": "530000,530500,530502",
      "parentCode": "530500"
},
{
      "code": "530521",
      "name": "施甸县",
      "type": 3,
      "path": "530000,530500,530521",
      "parentCode": "530500"
},
{
      "code": "530522",
      "name": "腾冲县",
      "type": 3,
      "path": "530000,530500,530522",
      "parentCode": "530500"
},
{
      "code": "530523",
      "name": "龙陵县",
      "type": 3,
      "path": "530000,530500,530523",
      "parentCode": "530500"
},
{
      "code": "530524",
      "name": "昌宁县",
      "type": 3,
      "path": "530000,530500,530524",
      "parentCode": "530500"
},
{
      "code": "530600",
      "name": "昭通市",
      "type": 2,
      "path": "530000,530600",
      "parentCode": "530000"
},
{
      "code": "530602",
      "name": "昭阳区",
      "type": 3,
      "path": "530000,530600,530602",
      "parentCode": "530600"
},
{
      "code": "530621",
      "name": "鲁甸县",
      "type": 3,
      "path": "530000,530600,530621",
      "parentCode": "530600"
},
{
      "code": "530622",
      "name": "巧家县",
      "type": 3,
      "path": "530000,530600,530622",
      "parentCode": "530600"
},
{
      "code": "530623",
      "name": "盐津县",
      "type": 3,
      "path": "530000,530600,530623",
      "parentCode": "530600"
},
{
      "code": "530624",
      "name": "大关县",
      "type": 3,
      "path": "530000,530600,530624",
      "parentCode": "530600"
},
{
      "code": "530625",
      "name": "永善县",
      "type": 3,
      "path": "530000,530600,530625",
      "parentCode": "530600"
},
{
      "code": "530626",
      "name": "绥江县",
      "type": 3,
      "path": "530000,530600,530626",
      "parentCode": "530600"
},
{
      "code": "530627",
      "name": "镇雄县",
      "type": 3,
      "path": "530000,530600,530627",
      "parentCode": "530600"
},
{
      "code": "530628",
      "name": "彝良县",
      "type": 3,
      "path": "530000,530600,530628",
      "parentCode": "530600"
},
{
      "code": "530629",
      "name": "威信县",
      "type": 3,
      "path": "530000,530600,530629",
      "parentCode": "530600"
},
{
      "code": "530630",
      "name": "水富县",
      "type": 3,
      "path": "530000,530600,530630",
      "parentCode": "530600"
},
{
      "code": "530700",
      "name": "丽江市",
      "type": 2,
      "path": "530000,530700",
      "parentCode": "530000"
},
{
      "code": "530702",
      "name": "古城区",
      "type": 3,
      "path": "530000,530700,530702",
      "parentCode": "530700"
},
{
      "code": "530721",
      "name": "玉龙纳西族自治县",
      "type": 3,
      "path": "530000,530700,530721",
      "parentCode": "530700"
},
{
      "code": "530722",
      "name": "永胜县",
      "type": 3,
      "path": "530000,530700,530722",
      "parentCode": "530700"
},
{
      "code": "530723",
      "name": "华坪县",
      "type": 3,
      "path": "530000,530700,530723",
      "parentCode": "530700"
},
{
      "code": "530724",
      "name": "宁蒗彝族自治县",
      "type": 3,
      "path": "530000,530700,530724",
      "parentCode": "530700"
},
{
      "code": "530800",
      "name": "思茅市",
      "type": 2,
      "path": "530000,530800",
      "parentCode": "530000"
},
{
      "code": "530802",
      "name": "思茅区",
      "type": 3,
      "path": "530000,530800,530802",
      "parentCode": "530800"
},
{
      "code": "530821",
      "name": "宁洱哈尼族彝族自治县",
      "type": 3,
      "path": "530000,530800,530821",
      "parentCode": "530800"
},
{
      "code": "530822",
      "name": "墨江哈尼族自治县",
      "type": 3,
      "path": "530000,530800,530822",
      "parentCode": "530800"
},
{
      "code": "530823",
      "name": "景东彝族自治县",
      "type": 3,
      "path": "530000,530800,530823",
      "parentCode": "530800"
},
{
      "code": "530824",
      "name": "景谷傣族彝族自治县",
      "type": 3,
      "path": "530000,530800,530824",
      "parentCode": "530800"
},
{
      "code": "530825",
      "name": "镇沅彝族哈尼族拉祜族自治县",
      "type": 3,
      "path": "530000,530800,530825",
      "parentCode": "530800"
},
{
      "code": "530826",
      "name": "江城哈尼族彝族自治县",
      "type": 3,
      "path": "530000,530800,530826",
      "parentCode": "530800"
},
{
      "code": "530827",
      "name": "孟连傣族拉祜族佤族自治县",
      "type": 3,
      "path": "530000,530800,530827",
      "parentCode": "530800"
},
{
      "code": "530828",
      "name": "澜沧拉祜族自治县",
      "type": 3,
      "path": "530000,530800,530828",
      "parentCode": "530800"
},
{
      "code": "530829",
      "name": "西盟佤族自治县",
      "type": 3,
      "path": "530000,530800,530829",
      "parentCode": "530800"
},
{
      "code": "530900",
      "name": "临沧市",
      "type": 2,
      "path": "530000,530900",
      "parentCode": "530000"
},
{
      "code": "530902",
      "name": "临翔区",
      "type": 3,
      "path": "530000,530900,530902",
      "parentCode": "530900"
},
{
      "code": "530921",
      "name": "凤庆县",
      "type": 3,
      "path": "530000,530900,530921",
      "parentCode": "530900"
},
{
      "code": "530922",
      "name": "云县",
      "type": 3,
      "path": "530000,530900,530922",
      "parentCode": "530900"
},
{
      "code": "530923",
      "name": "永德县",
      "type": 3,
      "path": "530000,530900,530923",
      "parentCode": "530900"
},
{
      "code": "530924",
      "name": "镇康县",
      "type": 3,
      "path": "530000,530900,530924",
      "parentCode": "530900"
},
{
      "code": "530925",
      "name": "双江拉祜族佤族布朗族傣族自治县",
      "type": 3,
      "path": "530000,530900,530925",
      "parentCode": "530900"
},
{
      "code": "530926",
      "name": "耿马傣族佤族自治县",
      "type": 3,
      "path": "530000,530900,530926",
      "parentCode": "530900"
},
{
      "code": "530927",
      "name": "沧源佤族自治县",
      "type": 3,
      "path": "530000,530900,530927",
      "parentCode": "530900"
},
{
      "code": "532300",
      "name": "楚雄彝族自治州",
      "type": 2,
      "path": "530000,532300",
      "parentCode": "530000"
},
{
      "code": "532301",
      "name": "楚雄市",
      "type": 3,
      "path": "530000,532300,532301",
      "parentCode": "532300"
},
{
      "code": "532322",
      "name": "双柏县",
      "type": 3,
      "path": "530000,532300,532322",
      "parentCode": "532300"
},
{
      "code": "532323",
      "name": "牟定县",
      "type": 3,
      "path": "530000,532300,532323",
      "parentCode": "532300"
},
{
      "code": "532324",
      "name": "南华县",
      "type": 3,
      "path": "530000,532300,532324",
      "parentCode": "532300"
},
{
      "code": "532325",
      "name": "姚安县",
      "type": 3,
      "path": "530000,532300,532325",
      "parentCode": "532300"
},
{
      "code": "532326",
      "name": "大姚县",
      "type": 3,
      "path": "530000,532300,532326",
      "parentCode": "532300"
},
{
      "code": "532327",
      "name": "永仁县",
      "type": 3,
      "path": "530000,532300,532327",
      "parentCode": "532300"
},
{
      "code": "532328",
      "name": "元谋县",
      "type": 3,
      "path": "530000,532300,532328",
      "parentCode": "532300"
},
{
      "code": "532329",
      "name": "武定县",
      "type": 3,
      "path": "530000,532300,532329",
      "parentCode": "532300"
},
{
      "code": "532331",
      "name": "禄丰县",
      "type": 3,
      "path": "530000,532300,532331",
      "parentCode": "532300"
},
{
      "code": "532500",
      "name": "红河哈尼族彝族自治州",
      "type": 2,
      "path": "530000,532500",
      "parentCode": "530000"
},
{
      "code": "532501",
      "name": "个旧市",
      "type": 3,
      "path": "530000,532500,532501",
      "parentCode": "532500"
},
{
      "code": "532502",
      "name": "开远市",
      "type": 3,
      "path": "530000,532500,532502",
      "parentCode": "532500"
},
{
      "code": "532503",
      "name": "蒙自市",
      "type": 3,
      "path": "530000,532500,532503",
      "parentCode": "532500"
},
{
      "code": "532504",
      "name": "弥勒市",
      "type": 3,
      "path": "530000,532500,532504",
      "parentCode": "532500"
},
{
      "code": "532523",
      "name": "屏边苗族自治县",
      "type": 3,
      "path": "530000,532500,532523",
      "parentCode": "532500"
},
{
      "code": "532524",
      "name": "建水县",
      "type": 3,
      "path": "530000,532500,532524",
      "parentCode": "532500"
},
{
      "code": "532525",
      "name": "石屏县",
      "type": 3,
      "path": "530000,532500,532525",
      "parentCode": "532500"
},
{
      "code": "532527",
      "name": "泸西县",
      "type": 3,
      "path": "530000,532500,532527",
      "parentCode": "532500"
},
{
      "code": "532528",
      "name": "元阳县",
      "type": 3,
      "path": "530000,532500,532528",
      "parentCode": "532500"
},
{
      "code": "532529",
      "name": "红河县",
      "type": 3,
      "path": "530000,532500,532529",
      "parentCode": "532500"
},
{
      "code": "532530",
      "name": "金平苗族瑶族傣族自治县",
      "type": 3,
      "path": "530000,532500,532530",
      "parentCode": "532500"
},
{
      "code": "532531",
      "name": "绿春县",
      "type": 3,
      "path": "530000,532500,532531",
      "parentCode": "532500"
},
{
      "code": "532532",
      "name": "河口瑶族自治县",
      "type": 3,
      "path": "530000,532500,532532",
      "parentCode": "532500"
},
{
      "code": "532600",
      "name": "文山壮族苗族自治州",
      "type": 2,
      "path": "530000,532600",
      "parentCode": "530000"
},
{
      "code": "532601",
      "name": "文山市",
      "type": 3,
      "path": "530000,532600,532601",
      "parentCode": "532600"
},
{
      "code": "532622",
      "name": "砚山县",
      "type": 3,
      "path": "530000,532600,532622",
      "parentCode": "532600"
},
{
      "code": "532623",
      "name": "西畴县",
      "type": 3,
      "path": "530000,532600,532623",
      "parentCode": "532600"
},
{
      "code": "532624",
      "name": "麻栗坡县",
      "type": 3,
      "path": "530000,532600,532624",
      "parentCode": "532600"
},
{
      "code": "532625",
      "name": "马关县",
      "type": 3,
      "path": "530000,532600,532625",
      "parentCode": "532600"
},
{
      "code": "532626",
      "name": "丘北县",
      "type": 3,
      "path": "530000,532600,532626",
      "parentCode": "532600"
},
{
      "code": "532627",
      "name": "广南县",
      "type": 3,
      "path": "530000,532600,532627",
      "parentCode": "532600"
},
{
      "code": "532628",
      "name": "富宁县",
      "type": 3,
      "path": "530000,532600,532628",
      "parentCode": "532600"
},
{
      "code": "532800",
      "name": "西双版纳傣族自治州",
      "type": 2,
      "path": "530000,532800",
      "parentCode": "530000"
},
{
      "code": "532801",
      "name": "景洪市",
      "type": 3,
      "path": "530000,532800,532801",
      "parentCode": "532800"
},
{
      "code": "532822",
      "name": "勐海县",
      "type": 3,
      "path": "530000,532800,532822",
      "parentCode": "532800"
},
{
      "code": "532823",
      "name": "勐腊县",
      "type": 3,
      "path": "530000,532800,532823",
      "parentCode": "532800"
},
{
      "code": "532900",
      "name": "大理白族自治州",
      "type": 2,
      "path": "530000,532900",
      "parentCode": "530000"
},
{
      "code": "532901",
      "name": "大理市",
      "type": 3,
      "path": "530000,532900,532901",
      "parentCode": "532900"
},
{
      "code": "532922",
      "name": "漾濞彝族自治县",
      "type": 3,
      "path": "530000,532900,532922",
      "parentCode": "532900"
},
{
      "code": "532923",
      "name": "祥云县",
      "type": 3,
      "path": "530000,532900,532923",
      "parentCode": "532900"
},
{
      "code": "532924",
      "name": "宾川县",
      "type": 3,
      "path": "530000,532900,532924",
      "parentCode": "532900"
},
{
      "code": "532925",
      "name": "弥渡县",
      "type": 3,
      "path": "530000,532900,532925",
      "parentCode": "532900"
},
{
      "code": "532926",
      "name": "南涧彝族自治县",
      "type": 3,
      "path": "530000,532900,532926",
      "parentCode": "532900"
},
{
      "code": "532927",
      "name": "巍山彝族回族自治县",
      "type": 3,
      "path": "530000,532900,532927",
      "parentCode": "532900"
},
{
      "code": "532928",
      "name": "永平县",
      "type": 3,
      "path": "530000,532900,532928",
      "parentCode": "532900"
},
{
      "code": "532929",
      "name": "云龙县",
      "type": 3,
      "path": "530000,532900,532929",
      "parentCode": "532900"
},
{
      "code": "532930",
      "name": "洱源县",
      "type": 3,
      "path": "530000,532900,532930",
      "parentCode": "532900"
},
{
      "code": "532931",
      "name": "剑川县",
      "type": 3,
      "path": "530000,532900,532931",
      "parentCode": "532900"
},
{
      "code": "532932",
      "name": "鹤庆县",
      "type": 3,
      "path": "530000,532900,532932",
      "parentCode": "532900"
},
{
      "code": "533100",
      "name": "德宏傣族景颇族自治州",
      "type": 2,
      "path": "530000,533100",
      "parentCode": "530000"
},
{
      "code": "533102",
      "name": "瑞丽市",
      "type": 3,
      "path": "530000,533100,533102",
      "parentCode": "533100"
},
{
      "code": "533103",
      "name": "芒市",
      "type": 3,
      "path": "530000,533100,533103",
      "parentCode": "533100"
},
{
      "code": "533122",
      "name": "梁河县",
      "type": 3,
      "path": "530000,533100,533122",
      "parentCode": "533100"
},
{
      "code": "533123",
      "name": "盈江县",
      "type": 3,
      "path": "530000,533100,533123",
      "parentCode": "533100"
},
{
      "code": "533124",
      "name": "陇川县",
      "type": 3,
      "path": "530000,533100,533124",
      "parentCode": "533100"
},
{
      "code": "533300",
      "name": "怒江傈僳族自治州",
      "type": 2,
      "path": "530000,533300",
      "parentCode": "530000"
},
{
      "code": "533321",
      "name": "泸水县",
      "type": 3,
      "path": "530000,533300,533321",
      "parentCode": "533300"
},
{
      "code": "533323",
      "name": "福贡县",
      "type": 3,
      "path": "530000,533300,533323",
      "parentCode": "533300"
},
{
      "code": "533324",
      "name": "贡山独龙族怒族自治县",
      "type": 3,
      "path": "530000,533300,533324",
      "parentCode": "533300"
},
{
      "code": "533325",
      "name": "兰坪白族普米族自治县",
      "type": 3,
      "path": "530000,533300,533325",
      "parentCode": "533300"
},
{
      "code": "533400",
      "name": "迪庆藏族自治州",
      "type": 2,
      "path": "530000,533400",
      "parentCode": "530000"
},
{
      "code": "533421",
      "name": "香格里拉县",
      "type": 3,
      "path": "530000,533400,533421",
      "parentCode": "533400"
},
{
      "code": "533422",
      "name": "德钦县",
      "type": 3,
      "path": "530000,533400,533422",
      "parentCode": "533400"
},
{
      "code": "533423",
      "name": "维西傈僳族自治县",
      "type": 3,
      "path": "530000,533400,533423",
      "parentCode": "533400"
},
{
      "code": "540000",
      "name": "西藏自治区",
      "type": 1,
      "path": "540000",
      "parentCode": null
},
{
      "code": "540100",
      "name": "拉萨市",
      "type": 2,
      "path": "540000,540100",
      "parentCode": "540000"
},
{
      "code": "540102",
      "name": "城关区",
      "type": 3,
      "path": "540000,540100,540102",
      "parentCode": "540100"
},
{
      "code": "540121",
      "name": "林周县",
      "type": 3,
      "path": "540000,540100,540121",
      "parentCode": "540100"
},
{
      "code": "540122",
      "name": "当雄县",
      "type": 3,
      "path": "540000,540100,540122",
      "parentCode": "540100"
},
{
      "code": "540123",
      "name": "尼木县",
      "type": 3,
      "path": "540000,540100,540123",
      "parentCode": "540100"
},
{
      "code": "540124",
      "name": "曲水县",
      "type": 3,
      "path": "540000,540100,540124",
      "parentCode": "540100"
},
{
      "code": "540125",
      "name": "堆龙德庆县",
      "type": 3,
      "path": "540000,540100,540125",
      "parentCode": "540100"
},
{
      "code": "540126",
      "name": "达孜县",
      "type": 3,
      "path": "540000,540100,540126",
      "parentCode": "540100"
},
{
      "code": "540127",
      "name": "墨竹工卡县",
      "type": 3,
      "path": "540000,540100,540127",
      "parentCode": "540100"
},
{
      "code": "542100",
      "name": "昌都地区",
      "type": 2,
      "path": "540000,542100",
      "parentCode": "540000"
},
{
      "code": "542121",
      "name": "昌都县",
      "type": 3,
      "path": "540000,542100,542121",
      "parentCode": "542100"
},
{
      "code": "542122",
      "name": "江达县",
      "type": 3,
      "path": "540000,542100,542122",
      "parentCode": "542100"
},
{
      "code": "542123",
      "name": "贡觉县",
      "type": 3,
      "path": "540000,542100,542123",
      "parentCode": "542100"
},
{
      "code": "542124",
      "name": "类乌齐县",
      "type": 3,
      "path": "540000,542100,542124",
      "parentCode": "542100"
},
{
      "code": "542125",
      "name": "丁青县",
      "type": 3,
      "path": "540000,542100,542125",
      "parentCode": "542100"
},
{
      "code": "542126",
      "name": "察雅县",
      "type": 3,
      "path": "540000,542100,542126",
      "parentCode": "542100"
},
{
      "code": "542127",
      "name": "八宿县",
      "type": 3,
      "path": "540000,542100,542127",
      "parentCode": "542100"
},
{
      "code": "542128",
      "name": "左贡县",
      "type": 3,
      "path": "540000,542100,542128",
      "parentCode": "542100"
},
{
      "code": "542129",
      "name": "芒康县",
      "type": 3,
      "path": "540000,542100,542129",
      "parentCode": "542100"
},
{
      "code": "542132",
      "name": "洛隆县",
      "type": 3,
      "path": "540000,542100,542132",
      "parentCode": "542100"
},
{
      "code": "542133",
      "name": "边坝县",
      "type": 3,
      "path": "540000,542100,542133",
      "parentCode": "542100"
},
{
      "code": "542200",
      "name": "山南地区",
      "type": 2,
      "path": "540000,542200",
      "parentCode": "540000"
},
{
      "code": "542221",
      "name": "乃东县",
      "type": 3,
      "path": "540000,542200,542221",
      "parentCode": "542200"
},
{
      "code": "542222",
      "name": "扎囊县",
      "type": 3,
      "path": "540000,542200,542222",
      "parentCode": "542200"
},
{
      "code": "542223",
      "name": "贡嘎县",
      "type": 3,
      "path": "540000,542200,542223",
      "parentCode": "542200"
},
{
      "code": "542224",
      "name": "桑日县",
      "type": 3,
      "path": "540000,542200,542224",
      "parentCode": "542200"
},
{
      "code": "542225",
      "name": "琼结县",
      "type": 3,
      "path": "540000,542200,542225",
      "parentCode": "542200"
},
{
      "code": "542226",
      "name": "曲松县",
      "type": 3,
      "path": "540000,542200,542226",
      "parentCode": "542200"
},
{
      "code": "542227",
      "name": "措美县",
      "type": 3,
      "path": "540000,542200,542227",
      "parentCode": "542200"
},
{
      "code": "542228",
      "name": "洛扎县",
      "type": 3,
      "path": "540000,542200,542228",
      "parentCode": "542200"
},
{
      "code": "542229",
      "name": "加查县",
      "type": 3,
      "path": "540000,542200,542229",
      "parentCode": "542200"
},
{
      "code": "542231",
      "name": "隆子县",
      "type": 3,
      "path": "540000,542200,542231",
      "parentCode": "542200"
},
{
      "code": "542232",
      "name": "错那县",
      "type": 3,
      "path": "540000,542200,542232",
      "parentCode": "542200"
},
{
      "code": "542233",
      "name": "浪卡子县",
      "type": 3,
      "path": "540000,542200,542233",
      "parentCode": "542200"
},
{
      "code": "542300",
      "name": "日喀则地区",
      "type": 2,
      "path": "540000,542300",
      "parentCode": "540000"
},
{
      "code": "540202",
      "name": "桑珠孜区",
      "type": 3,
      "path": "540000,542300,540202",
      "parentCode": "542300"
},
{
      "code": "540221",
      "name": "南木林县",
      "type": 3,
      "path": "540000,542300,540221",
      "parentCode": "542300"
},
{
      "code": "540222",
      "name": "江孜县",
      "type": 3,
      "path": "540000,542300,540222",
      "parentCode": "542300"
},
{
      "code": "540223",
      "name": "定日县",
      "type": 3,
      "path": "540000,542300,540223",
      "parentCode": "542300"
},
{
      "code": "540224",
      "name": "萨迦县",
      "type": 3,
      "path": "540000,542300,540224",
      "parentCode": "542300"
},
{
      "code": "540225",
      "name": "拉孜县",
      "type": 3,
      "path": "540000,542300,540225",
      "parentCode": "542300"
},
{
      "code": "540226",
      "name": "昂仁县",
      "type": 3,
      "path": "540000,542300,540226",
      "parentCode": "542300"
},
{
      "code": "540227",
      "name": "谢通门县",
      "type": 3,
      "path": "540000,542300,540227",
      "parentCode": "542300"
},
{
      "code": "540228",
      "name": "白朗县",
      "type": 3,
      "path": "540000,542300,540228",
      "parentCode": "542300"
},
{
      "code": "540229",
      "name": "仁布县",
      "type": 3,
      "path": "540000,542300,540229",
      "parentCode": "542300"
},
{
      "code": "540230",
      "name": "康马县",
      "type": 3,
      "path": "540000,542300,540230",
      "parentCode": "542300"
},
{
      "code": "540231",
      "name": "定结县",
      "type": 3,
      "path": "540000,542300,540231",
      "parentCode": "542300"
},
{
      "code": "540232",
      "name": "仲巴县",
      "type": 3,
      "path": "540000,542300,540232",
      "parentCode": "542300"
},
{
      "code": "540233",
      "name": "亚东县",
      "type": 3,
      "path": "540000,542300,540233",
      "parentCode": "542300"
},
{
      "code": "540234",
      "name": "吉隆县",
      "type": 3,
      "path": "540000,542300,540234",
      "parentCode": "542300"
},
{
      "code": "540235",
      "name": "聂拉木县",
      "type": 3,
      "path": "540000,542300,540235",
      "parentCode": "542300"
},
{
      "code": "540236",
      "name": "萨嘎县",
      "type": 3,
      "path": "540000,542300,540236",
      "parentCode": "542300"
},
{
      "code": "540237",
      "name": "岗巴县",
      "type": 3,
      "path": "540000,542300,540237",
      "parentCode": "542300"
},
{
      "code": "542300",
      "name": "日喀则地区",
      "type": 3,
      "path": "540000,542300,542300",
      "parentCode": "542300"
},
{
      "code": "542400",
      "name": "那曲地区",
      "type": 2,
      "path": "540000,542400",
      "parentCode": "540000"
},
{
      "code": "542421",
      "name": "那曲县",
      "type": 3,
      "path": "540000,542400,542421",
      "parentCode": "542400"
},
{
      "code": "542422",
      "name": "嘉黎县",
      "type": 3,
      "path": "540000,542400,542422",
      "parentCode": "542400"
},
{
      "code": "542423",
      "name": "比如县",
      "type": 3,
      "path": "540000,542400,542423",
      "parentCode": "542400"
},
{
      "code": "542424",
      "name": "聂荣县",
      "type": 3,
      "path": "540000,542400,542424",
      "parentCode": "542400"
},
{
      "code": "542425",
      "name": "安多县",
      "type": 3,
      "path": "540000,542400,542425",
      "parentCode": "542400"
},
{
      "code": "542426",
      "name": "申扎县",
      "type": 3,
      "path": "540000,542400,542426",
      "parentCode": "542400"
},
{
      "code": "542427",
      "name": "索县",
      "type": 3,
      "path": "540000,542400,542427",
      "parentCode": "542400"
},
{
      "code": "542428",
      "name": "班戈县",
      "type": 3,
      "path": "540000,542400,542428",
      "parentCode": "542400"
},
{
      "code": "542429",
      "name": "巴青县",
      "type": 3,
      "path": "540000,542400,542429",
      "parentCode": "542400"
},
{
      "code": "542430",
      "name": "尼玛县",
      "type": 3,
      "path": "540000,542400,542430",
      "parentCode": "542400"
},
{
      "code": "542431",
      "name": "双湖县",
      "type": 3,
      "path": "540000,542400,542431",
      "parentCode": "542400"
},
{
      "code": "542500",
      "name": "阿里地区",
      "type": 2,
      "path": "540000,542500",
      "parentCode": "540000"
},
{
      "code": "542521",
      "name": "普兰县",
      "type": 3,
      "path": "540000,542500,542521",
      "parentCode": "542500"
},
{
      "code": "542522",
      "name": "札达县",
      "type": 3,
      "path": "540000,542500,542522",
      "parentCode": "542500"
},
{
      "code": "542523",
      "name": "噶尔县",
      "type": 3,
      "path": "540000,542500,542523",
      "parentCode": "542500"
},
{
      "code": "542524",
      "name": "日土县",
      "type": 3,
      "path": "540000,542500,542524",
      "parentCode": "542500"
},
{
      "code": "542525",
      "name": "革吉县",
      "type": 3,
      "path": "540000,542500,542525",
      "parentCode": "542500"
},
{
      "code": "542526",
      "name": "改则县",
      "type": 3,
      "path": "540000,542500,542526",
      "parentCode": "542500"
},
{
      "code": "542527",
      "name": "措勤县",
      "type": 3,
      "path": "540000,542500,542527",
      "parentCode": "542500"
},
{
      "code": "542600",
      "name": "林芝地区",
      "type": 2,
      "path": "540000,542600",
      "parentCode": "540000"
},
{
      "code": "542621",
      "name": "林芝县",
      "type": 3,
      "path": "540000,542600,542621",
      "parentCode": "542600"
},
{
      "code": "542622",
      "name": "工布江达县",
      "type": 3,
      "path": "540000,542600,542622",
      "parentCode": "542600"
},
{
      "code": "542623",
      "name": "米林县",
      "type": 3,
      "path": "540000,542600,542623",
      "parentCode": "542600"
},
{
      "code": "542624",
      "name": "墨脱县",
      "type": 3,
      "path": "540000,542600,542624",
      "parentCode": "542600"
},
{
      "code": "542625",
      "name": "波密县",
      "type": 3,
      "path": "540000,542600,542625",
      "parentCode": "542600"
},
{
      "code": "542626",
      "name": "察隅县",
      "type": 3,
      "path": "540000,542600,542626",
      "parentCode": "542600"
},
{
      "code": "542627",
      "name": "朗县",
      "type": 3,
      "path": "540000,542600,542627",
      "parentCode": "542600"
},
{
      "code": "610000",
      "name": "陕西省",
      "type": 1,
      "path": "610000",
      "parentCode": null
},
{
      "code": "610100",
      "name": "西安市",
      "type": 2,
      "path": "610000,610100",
      "parentCode": "610000"
},
{
      "code": "610102",
      "name": "新城区",
      "type": 3,
      "path": "610000,610100,610102",
      "parentCode": "610100"
},
{
      "code": "610103",
      "name": "碑林区",
      "type": 3,
      "path": "610000,610100,610103",
      "parentCode": "610100"
},
{
      "code": "610104",
      "name": "莲湖区",
      "type": 3,
      "path": "610000,610100,610104",
      "parentCode": "610100"
},
{
      "code": "610111",
      "name": "灞桥区",
      "type": 3,
      "path": "610000,610100,610111",
      "parentCode": "610100"
},
{
      "code": "610112",
      "name": "未央区",
      "type": 3,
      "path": "610000,610100,610112",
      "parentCode": "610100"
},
{
      "code": "610113",
      "name": "雁塔区",
      "type": 3,
      "path": "610000,610100,610113",
      "parentCode": "610100"
},
{
      "code": "610114",
      "name": "阎良区",
      "type": 3,
      "path": "610000,610100,610114",
      "parentCode": "610100"
},
{
      "code": "610115",
      "name": "临潼区",
      "type": 3,
      "path": "610000,610100,610115",
      "parentCode": "610100"
},
{
      "code": "610116",
      "name": "长安区",
      "type": 3,
      "path": "610000,610100,610116",
      "parentCode": "610100"
},
{
      "code": "610122",
      "name": "蓝田县",
      "type": 3,
      "path": "610000,610100,610122",
      "parentCode": "610100"
},
{
      "code": "610124",
      "name": "周至县",
      "type": 3,
      "path": "610000,610100,610124",
      "parentCode": "610100"
},
{
      "code": "610125",
      "name": "户县",
      "type": 3,
      "path": "610000,610100,610125",
      "parentCode": "610100"
},
{
      "code": "610126",
      "name": "高陵县",
      "type": 3,
      "path": "610000,610100,610126",
      "parentCode": "610100"
},
{
      "code": "610200",
      "name": "铜川市",
      "type": 2,
      "path": "610000,610200",
      "parentCode": "610000"
},
{
      "code": "610202",
      "name": "王益区",
      "type": 3,
      "path": "610000,610200,610202",
      "parentCode": "610200"
},
{
      "code": "610203",
      "name": "印台区",
      "type": 3,
      "path": "610000,610200,610203",
      "parentCode": "610200"
},
{
      "code": "610204",
      "name": "耀州区",
      "type": 3,
      "path": "610000,610200,610204",
      "parentCode": "610200"
},
{
      "code": "610222",
      "name": "宜君县",
      "type": 3,
      "path": "610000,610200,610222",
      "parentCode": "610200"
},
{
      "code": "610300",
      "name": "宝鸡市",
      "type": 2,
      "path": "610000,610300",
      "parentCode": "610000"
},
{
      "code": "610302",
      "name": "渭滨区",
      "type": 3,
      "path": "610000,610300,610302",
      "parentCode": "610300"
},
{
      "code": "610303",
      "name": "金台区",
      "type": 3,
      "path": "610000,610300,610303",
      "parentCode": "610300"
},
{
      "code": "610304",
      "name": "陈仓区",
      "type": 3,
      "path": "610000,610300,610304",
      "parentCode": "610300"
},
{
      "code": "610322",
      "name": "凤翔县",
      "type": 3,
      "path": "610000,610300,610322",
      "parentCode": "610300"
},
{
      "code": "610323",
      "name": "岐山县",
      "type": 3,
      "path": "610000,610300,610323",
      "parentCode": "610300"
},
{
      "code": "610324",
      "name": "扶风县",
      "type": 3,
      "path": "610000,610300,610324",
      "parentCode": "610300"
},
{
      "code": "610326",
      "name": "眉县",
      "type": 3,
      "path": "610000,610300,610326",
      "parentCode": "610300"
},
{
      "code": "610327",
      "name": "陇县",
      "type": 3,
      "path": "610000,610300,610327",
      "parentCode": "610300"
},
{
      "code": "610328",
      "name": "千阳县",
      "type": 3,
      "path": "610000,610300,610328",
      "parentCode": "610300"
},
{
      "code": "610329",
      "name": "麟游县",
      "type": 3,
      "path": "610000,610300,610329",
      "parentCode": "610300"
},
{
      "code": "610330",
      "name": "凤县",
      "type": 3,
      "path": "610000,610300,610330",
      "parentCode": "610300"
},
{
      "code": "610331",
      "name": "太白县",
      "type": 3,
      "path": "610000,610300,610331",
      "parentCode": "610300"
},
{
      "code": "610400",
      "name": "咸阳市",
      "type": 2,
      "path": "610000,610400",
      "parentCode": "610000"
},
{
      "code": "610402",
      "name": "秦都区",
      "type": 3,
      "path": "610000,610400,610402",
      "parentCode": "610400"
},
{
      "code": "610403",
      "name": "杨陵区",
      "type": 3,
      "path": "610000,610400,610403",
      "parentCode": "610400"
},
{
      "code": "610404",
      "name": "渭城区",
      "type": 3,
      "path": "610000,610400,610404",
      "parentCode": "610400"
},
{
      "code": "610422",
      "name": "三原县",
      "type": 3,
      "path": "610000,610400,610422",
      "parentCode": "610400"
},
{
      "code": "610423",
      "name": "泾阳县",
      "type": 3,
      "path": "610000,610400,610423",
      "parentCode": "610400"
},
{
      "code": "610424",
      "name": "乾县",
      "type": 3,
      "path": "610000,610400,610424",
      "parentCode": "610400"
},
{
      "code": "610425",
      "name": "礼泉县",
      "type": 3,
      "path": "610000,610400,610425",
      "parentCode": "610400"
},
{
      "code": "610426",
      "name": "永寿县",
      "type": 3,
      "path": "610000,610400,610426",
      "parentCode": "610400"
},
{
      "code": "610427",
      "name": "彬县",
      "type": 3,
      "path": "610000,610400,610427",
      "parentCode": "610400"
},
{
      "code": "610428",
      "name": "长武县",
      "type": 3,
      "path": "610000,610400,610428",
      "parentCode": "610400"
},
{
      "code": "610429",
      "name": "旬邑县",
      "type": 3,
      "path": "610000,610400,610429",
      "parentCode": "610400"
},
{
      "code": "610430",
      "name": "淳化县",
      "type": 3,
      "path": "610000,610400,610430",
      "parentCode": "610400"
},
{
      "code": "610431",
      "name": "武功县",
      "type": 3,
      "path": "610000,610400,610431",
      "parentCode": "610400"
},
{
      "code": "610481",
      "name": "兴平市",
      "type": 3,
      "path": "610000,610400,610481",
      "parentCode": "610400"
},
{
      "code": "610500",
      "name": "渭南市",
      "type": 2,
      "path": "610000,610500",
      "parentCode": "610000"
},
{
      "code": "610502",
      "name": "临渭区",
      "type": 3,
      "path": "610000,610500,610502",
      "parentCode": "610500"
},
{
      "code": "610521",
      "name": "华县",
      "type": 3,
      "path": "610000,610500,610521",
      "parentCode": "610500"
},
{
      "code": "610522",
      "name": "潼关县",
      "type": 3,
      "path": "610000,610500,610522",
      "parentCode": "610500"
},
{
      "code": "610523",
      "name": "大荔县",
      "type": 3,
      "path": "610000,610500,610523",
      "parentCode": "610500"
},
{
      "code": "610524",
      "name": "合阳县",
      "type": 3,
      "path": "610000,610500,610524",
      "parentCode": "610500"
},
{
      "code": "610525",
      "name": "澄城县",
      "type": 3,
      "path": "610000,610500,610525",
      "parentCode": "610500"
},
{
      "code": "610526",
      "name": "蒲城县",
      "type": 3,
      "path": "610000,610500,610526",
      "parentCode": "610500"
},
{
      "code": "610527",
      "name": "白水县",
      "type": 3,
      "path": "610000,610500,610527",
      "parentCode": "610500"
},
{
      "code": "610528",
      "name": "富平县",
      "type": 3,
      "path": "610000,610500,610528",
      "parentCode": "610500"
},
{
      "code": "610581",
      "name": "韩城市",
      "type": 3,
      "path": "610000,610500,610581",
      "parentCode": "610500"
},
{
      "code": "610582",
      "name": "华阴市",
      "type": 3,
      "path": "610000,610500,610582",
      "parentCode": "610500"
},
{
      "code": "610600",
      "name": "延安市",
      "type": 2,
      "path": "610000,610600",
      "parentCode": "610000"
},
{
      "code": "610602",
      "name": "宝塔区",
      "type": 3,
      "path": "610000,610600,610602",
      "parentCode": "610600"
},
{
      "code": "610621",
      "name": "延长县",
      "type": 3,
      "path": "610000,610600,610621",
      "parentCode": "610600"
},
{
      "code": "610622",
      "name": "延川县",
      "type": 3,
      "path": "610000,610600,610622",
      "parentCode": "610600"
},
{
      "code": "610623",
      "name": "子长县",
      "type": 3,
      "path": "610000,610600,610623",
      "parentCode": "610600"
},
{
      "code": "610624",
      "name": "安塞县",
      "type": 3,
      "path": "610000,610600,610624",
      "parentCode": "610600"
},
{
      "code": "610625",
      "name": "志丹县",
      "type": 3,
      "path": "610000,610600,610625",
      "parentCode": "610600"
},
{
      "code": "610626",
      "name": "吴起县",
      "type": 3,
      "path": "610000,610600,610626",
      "parentCode": "610600"
},
{
      "code": "610627",
      "name": "甘泉县",
      "type": 3,
      "path": "610000,610600,610627",
      "parentCode": "610600"
},
{
      "code": "610628",
      "name": "富县",
      "type": 3,
      "path": "610000,610600,610628",
      "parentCode": "610600"
},
{
      "code": "610629",
      "name": "洛川县",
      "type": 3,
      "path": "610000,610600,610629",
      "parentCode": "610600"
},
{
      "code": "610630",
      "name": "宜川县",
      "type": 3,
      "path": "610000,610600,610630",
      "parentCode": "610600"
},
{
      "code": "610631",
      "name": "黄龙县",
      "type": 3,
      "path": "610000,610600,610631",
      "parentCode": "610600"
},
{
      "code": "610632",
      "name": "黄陵县",
      "type": 3,
      "path": "610000,610600,610632",
      "parentCode": "610600"
},
{
      "code": "610700",
      "name": "汉中市",
      "type": 2,
      "path": "610000,610700",
      "parentCode": "610000"
},
{
      "code": "610702",
      "name": "汉台区",
      "type": 3,
      "path": "610000,610700,610702",
      "parentCode": "610700"
},
{
      "code": "610721",
      "name": "南郑县",
      "type": 3,
      "path": "610000,610700,610721",
      "parentCode": "610700"
},
{
      "code": "610722",
      "name": "城固县",
      "type": 3,
      "path": "610000,610700,610722",
      "parentCode": "610700"
},
{
      "code": "610723",
      "name": "洋县",
      "type": 3,
      "path": "610000,610700,610723",
      "parentCode": "610700"
},
{
      "code": "610724",
      "name": "西乡县",
      "type": 3,
      "path": "610000,610700,610724",
      "parentCode": "610700"
},
{
      "code": "610725",
      "name": "勉县",
      "type": 3,
      "path": "610000,610700,610725",
      "parentCode": "610700"
},
{
      "code": "610726",
      "name": "宁强县",
      "type": 3,
      "path": "610000,610700,610726",
      "parentCode": "610700"
},
{
      "code": "610727",
      "name": "略阳县",
      "type": 3,
      "path": "610000,610700,610727",
      "parentCode": "610700"
},
{
      "code": "610728",
      "name": "镇巴县",
      "type": 3,
      "path": "610000,610700,610728",
      "parentCode": "610700"
},
{
      "code": "610729",
      "name": "留坝县",
      "type": 3,
      "path": "610000,610700,610729",
      "parentCode": "610700"
},
{
      "code": "610730",
      "name": "佛坪县",
      "type": 3,
      "path": "610000,610700,610730",
      "parentCode": "610700"
},
{
      "code": "610800",
      "name": "榆林市",
      "type": 2,
      "path": "610000,610800",
      "parentCode": "610000"
},
{
      "code": "610802",
      "name": "榆阳区",
      "type": 3,
      "path": "610000,610800,610802",
      "parentCode": "610800"
},
{
      "code": "610821",
      "name": "神木县",
      "type": 3,
      "path": "610000,610800,610821",
      "parentCode": "610800"
},
{
      "code": "610822",
      "name": "府谷县",
      "type": 3,
      "path": "610000,610800,610822",
      "parentCode": "610800"
},
{
      "code": "610823",
      "name": "横山县",
      "type": 3,
      "path": "610000,610800,610823",
      "parentCode": "610800"
},
{
      "code": "610824",
      "name": "靖边县",
      "type": 3,
      "path": "610000,610800,610824",
      "parentCode": "610800"
},
{
      "code": "610825",
      "name": "定边县",
      "type": 3,
      "path": "610000,610800,610825",
      "parentCode": "610800"
},
{
      "code": "610826",
      "name": "绥德县",
      "type": 3,
      "path": "610000,610800,610826",
      "parentCode": "610800"
},
{
      "code": "610827",
      "name": "米脂县",
      "type": 3,
      "path": "610000,610800,610827",
      "parentCode": "610800"
},
{
      "code": "610828",
      "name": "佳县",
      "type": 3,
      "path": "610000,610800,610828",
      "parentCode": "610800"
},
{
      "code": "610829",
      "name": "吴堡县",
      "type": 3,
      "path": "610000,610800,610829",
      "parentCode": "610800"
},
{
      "code": "610830",
      "name": "清涧县",
      "type": 3,
      "path": "610000,610800,610830",
      "parentCode": "610800"
},
{
      "code": "610831",
      "name": "子洲县",
      "type": 3,
      "path": "610000,610800,610831",
      "parentCode": "610800"
},
{
      "code": "610900",
      "name": "安康市",
      "type": 2,
      "path": "610000,610900",
      "parentCode": "610000"
},
{
      "code": "610902",
      "name": "汉滨区",
      "type": 3,
      "path": "610000,610900,610902",
      "parentCode": "610900"
},
{
      "code": "610921",
      "name": "汉阴县",
      "type": 3,
      "path": "610000,610900,610921",
      "parentCode": "610900"
},
{
      "code": "610922",
      "name": "石泉县",
      "type": 3,
      "path": "610000,610900,610922",
      "parentCode": "610900"
},
{
      "code": "610923",
      "name": "宁陕县",
      "type": 3,
      "path": "610000,610900,610923",
      "parentCode": "610900"
},
{
      "code": "610924",
      "name": "紫阳县",
      "type": 3,
      "path": "610000,610900,610924",
      "parentCode": "610900"
},
{
      "code": "610925",
      "name": "岚皋县",
      "type": 3,
      "path": "610000,610900,610925",
      "parentCode": "610900"
},
{
      "code": "610926",
      "name": "平利县",
      "type": 3,
      "path": "610000,610900,610926",
      "parentCode": "610900"
},
{
      "code": "610927",
      "name": "镇坪县",
      "type": 3,
      "path": "610000,610900,610927",
      "parentCode": "610900"
},
{
      "code": "610928",
      "name": "旬阳县",
      "type": 3,
      "path": "610000,610900,610928",
      "parentCode": "610900"
},
{
      "code": "610929",
      "name": "白河县",
      "type": 3,
      "path": "610000,610900,610929",
      "parentCode": "610900"
},
{
      "code": "611000",
      "name": "商洛市",
      "type": 2,
      "path": "610000,611000",
      "parentCode": "610000"
},
{
      "code": "611002",
      "name": "商州区",
      "type": 3,
      "path": "610000,611000,611002",
      "parentCode": "611000"
},
{
      "code": "611021",
      "name": "洛南县",
      "type": 3,
      "path": "610000,611000,611021",
      "parentCode": "611000"
},
{
      "code": "611022",
      "name": "丹凤县",
      "type": 3,
      "path": "610000,611000,611022",
      "parentCode": "611000"
},
{
      "code": "611023",
      "name": "商南县",
      "type": 3,
      "path": "610000,611000,611023",
      "parentCode": "611000"
},
{
      "code": "611024",
      "name": "山阳县",
      "type": 3,
      "path": "610000,611000,611024",
      "parentCode": "611000"
},
{
      "code": "611025",
      "name": "镇安县",
      "type": 3,
      "path": "610000,611000,611025",
      "parentCode": "611000"
},
{
      "code": "611026",
      "name": "柞水县",
      "type": 3,
      "path": "610000,611000,611026",
      "parentCode": "611000"
},
{
      "code": "620000",
      "name": "甘肃省",
      "type": 1,
      "path": "620000",
      "parentCode": null
},
{
      "code": "620100",
      "name": "兰州市",
      "type": 2,
      "path": "620000,620100",
      "parentCode": "620000"
},
{
      "code": "620102",
      "name": "城关区",
      "type": 3,
      "path": "620000,620100,620102",
      "parentCode": "620100"
},
{
      "code": "620103",
      "name": "七里河区",
      "type": 3,
      "path": "620000,620100,620103",
      "parentCode": "620100"
},
{
      "code": "620104",
      "name": "西固区",
      "type": 3,
      "path": "620000,620100,620104",
      "parentCode": "620100"
},
{
      "code": "620105",
      "name": "安宁区",
      "type": 3,
      "path": "620000,620100,620105",
      "parentCode": "620100"
},
{
      "code": "620111",
      "name": "红古区",
      "type": 3,
      "path": "620000,620100,620111",
      "parentCode": "620100"
},
{
      "code": "620121",
      "name": "永登县",
      "type": 3,
      "path": "620000,620100,620121",
      "parentCode": "620100"
},
{
      "code": "620122",
      "name": "皋兰县",
      "type": 3,
      "path": "620000,620100,620122",
      "parentCode": "620100"
},
{
      "code": "620123",
      "name": "榆中县",
      "type": 3,
      "path": "620000,620100,620123",
      "parentCode": "620100"
},
{
      "code": "620200",
      "name": "嘉峪关市",
      "type": 2,
      "path": "620000,620200",
      "parentCode": "620000"
},
{
      "code": "620201",
      "name": "嘉峪关市辖区",
      "type": 3,
      "path": "620000,620200,620201",
      "parentCode": "620200"
},
{
      "code": "620300",
      "name": "金昌市",
      "type": 2,
      "path": "620000,620300",
      "parentCode": "620000"
},
{
      "code": "620302",
      "name": "金川区",
      "type": 3,
      "path": "620000,620300,620302",
      "parentCode": "620300"
},
{
      "code": "620321",
      "name": "永昌县",
      "type": 3,
      "path": "620000,620300,620321",
      "parentCode": "620300"
},
{
      "code": "620400",
      "name": "白银市",
      "type": 2,
      "path": "620000,620400",
      "parentCode": "620000"
},
{
      "code": "620402",
      "name": "白银区",
      "type": 3,
      "path": "620000,620400,620402",
      "parentCode": "620400"
},
{
      "code": "620403",
      "name": "平川区",
      "type": 3,
      "path": "620000,620400,620403",
      "parentCode": "620400"
},
{
      "code": "620421",
      "name": "靖远县",
      "type": 3,
      "path": "620000,620400,620421",
      "parentCode": "620400"
},
{
      "code": "620422",
      "name": "会宁县",
      "type": 3,
      "path": "620000,620400,620422",
      "parentCode": "620400"
},
{
      "code": "620423",
      "name": "景泰县",
      "type": 3,
      "path": "620000,620400,620423",
      "parentCode": "620400"
},
{
      "code": "620500",
      "name": "天水市",
      "type": 2,
      "path": "620000,620500",
      "parentCode": "620000"
},
{
      "code": "620502",
      "name": "秦州区",
      "type": 3,
      "path": "620000,620500,620502",
      "parentCode": "620500"
},
{
      "code": "620503",
      "name": "麦积区",
      "type": 3,
      "path": "620000,620500,620503",
      "parentCode": "620500"
},
{
      "code": "620521",
      "name": "清水县",
      "type": 3,
      "path": "620000,620500,620521",
      "parentCode": "620500"
},
{
      "code": "620522",
      "name": "秦安县",
      "type": 3,
      "path": "620000,620500,620522",
      "parentCode": "620500"
},
{
      "code": "620523",
      "name": "甘谷县",
      "type": 3,
      "path": "620000,620500,620523",
      "parentCode": "620500"
},
{
      "code": "620524",
      "name": "武山县",
      "type": 3,
      "path": "620000,620500,620524",
      "parentCode": "620500"
},
{
      "code": "620525",
      "name": "张家川回族自治县",
      "type": 3,
      "path": "620000,620500,620525",
      "parentCode": "620500"
},
{
      "code": "620600",
      "name": "武威市",
      "type": 2,
      "path": "620000,620600",
      "parentCode": "620000"
},
{
      "code": "620602",
      "name": "凉州区",
      "type": 3,
      "path": "620000,620600,620602",
      "parentCode": "620600"
},
{
      "code": "620621",
      "name": "民勤县",
      "type": 3,
      "path": "620000,620600,620621",
      "parentCode": "620600"
},
{
      "code": "620622",
      "name": "古浪县",
      "type": 3,
      "path": "620000,620600,620622",
      "parentCode": "620600"
},
{
      "code": "620623",
      "name": "天祝藏族自治县",
      "type": 3,
      "path": "620000,620600,620623",
      "parentCode": "620600"
},
{
      "code": "620700",
      "name": "张掖市",
      "type": 2,
      "path": "620000,620700",
      "parentCode": "620000"
},
{
      "code": "620702",
      "name": "甘州区",
      "type": 3,
      "path": "620000,620700,620702",
      "parentCode": "620700"
},
{
      "code": "620721",
      "name": "肃南裕固族自治县",
      "type": 3,
      "path": "620000,620700,620721",
      "parentCode": "620700"
},
{
      "code": "620722",
      "name": "民乐县",
      "type": 3,
      "path": "620000,620700,620722",
      "parentCode": "620700"
},
{
      "code": "620723",
      "name": "临泽县",
      "type": 3,
      "path": "620000,620700,620723",
      "parentCode": "620700"
},
{
      "code": "620724",
      "name": "高台县",
      "type": 3,
      "path": "620000,620700,620724",
      "parentCode": "620700"
},
{
      "code": "620725",
      "name": "山丹县",
      "type": 3,
      "path": "620000,620700,620725",
      "parentCode": "620700"
},
{
      "code": "620800",
      "name": "平凉市",
      "type": 2,
      "path": "620000,620800",
      "parentCode": "620000"
},
{
      "code": "620802",
      "name": "崆峒区",
      "type": 3,
      "path": "620000,620800,620802",
      "parentCode": "620800"
},
{
      "code": "620821",
      "name": "泾川县",
      "type": 3,
      "path": "620000,620800,620821",
      "parentCode": "620800"
},
{
      "code": "620822",
      "name": "灵台县",
      "type": 3,
      "path": "620000,620800,620822",
      "parentCode": "620800"
},
{
      "code": "620823",
      "name": "崇信县",
      "type": 3,
      "path": "620000,620800,620823",
      "parentCode": "620800"
},
{
      "code": "620824",
      "name": "华亭县",
      "type": 3,
      "path": "620000,620800,620824",
      "parentCode": "620800"
},
{
      "code": "620825",
      "name": "庄浪县",
      "type": 3,
      "path": "620000,620800,620825",
      "parentCode": "620800"
},
{
      "code": "620826",
      "name": "静宁县",
      "type": 3,
      "path": "620000,620800,620826",
      "parentCode": "620800"
},
{
      "code": "620900",
      "name": "酒泉市",
      "type": 2,
      "path": "620000,620900",
      "parentCode": "620000"
},
{
      "code": "620902",
      "name": "肃州区",
      "type": 3,
      "path": "620000,620900,620902",
      "parentCode": "620900"
},
{
      "code": "620921",
      "name": "金塔县",
      "type": 3,
      "path": "620000,620900,620921",
      "parentCode": "620900"
},
{
      "code": "620922",
      "name": "瓜州县",
      "type": 3,
      "path": "620000,620900,620922",
      "parentCode": "620900"
},
{
      "code": "620923",
      "name": "肃北蒙古族自治县",
      "type": 3,
      "path": "620000,620900,620923",
      "parentCode": "620900"
},
{
      "code": "620924",
      "name": "阿克塞哈萨克族自治县",
      "type": 3,
      "path": "620000,620900,620924",
      "parentCode": "620900"
},
{
      "code": "620981",
      "name": "玉门市",
      "type": 3,
      "path": "620000,620900,620981",
      "parentCode": "620900"
},
{
      "code": "620982",
      "name": "敦煌市",
      "type": 3,
      "path": "620000,620900,620982",
      "parentCode": "620900"
},
{
      "code": "621000",
      "name": "庆阳市",
      "type": 2,
      "path": "620000,621000",
      "parentCode": "620000"
},
{
      "code": "621002",
      "name": "西峰区",
      "type": 3,
      "path": "620000,621000,621002",
      "parentCode": "621000"
},
{
      "code": "621021",
      "name": "庆城县",
      "type": 3,
      "path": "620000,621000,621021",
      "parentCode": "621000"
},
{
      "code": "621022",
      "name": "环县",
      "type": 3,
      "path": "620000,621000,621022",
      "parentCode": "621000"
},
{
      "code": "621023",
      "name": "华池县",
      "type": 3,
      "path": "620000,621000,621023",
      "parentCode": "621000"
},
{
      "code": "621024",
      "name": "合水县",
      "type": 3,
      "path": "620000,621000,621024",
      "parentCode": "621000"
},
{
      "code": "621025",
      "name": "正宁县",
      "type": 3,
      "path": "620000,621000,621025",
      "parentCode": "621000"
},
{
      "code": "621026",
      "name": "宁县",
      "type": 3,
      "path": "620000,621000,621026",
      "parentCode": "621000"
},
{
      "code": "621027",
      "name": "镇原县",
      "type": 3,
      "path": "620000,621000,621027",
      "parentCode": "621000"
},
{
      "code": "621100",
      "name": "定西市",
      "type": 2,
      "path": "620000,621100",
      "parentCode": "620000"
},
{
      "code": "621102",
      "name": "安定区",
      "type": 3,
      "path": "620000,621100,621102",
      "parentCode": "621100"
},
{
      "code": "621121",
      "name": "通渭县",
      "type": 3,
      "path": "620000,621100,621121",
      "parentCode": "621100"
},
{
      "code": "621122",
      "name": "陇西县",
      "type": 3,
      "path": "620000,621100,621122",
      "parentCode": "621100"
},
{
      "code": "621123",
      "name": "渭源县",
      "type": 3,
      "path": "620000,621100,621123",
      "parentCode": "621100"
},
{
      "code": "621124",
      "name": "临洮县",
      "type": 3,
      "path": "620000,621100,621124",
      "parentCode": "621100"
},
{
      "code": "621125",
      "name": "漳县",
      "type": 3,
      "path": "620000,621100,621125",
      "parentCode": "621100"
},
{
      "code": "621126",
      "name": "岷县",
      "type": 3,
      "path": "620000,621100,621126",
      "parentCode": "621100"
},
{
      "code": "621200",
      "name": "陇南市",
      "type": 2,
      "path": "620000,621200",
      "parentCode": "620000"
},
{
      "code": "621202",
      "name": "武都区",
      "type": 3,
      "path": "620000,621200,621202",
      "parentCode": "621200"
},
{
      "code": "621221",
      "name": "成县",
      "type": 3,
      "path": "620000,621200,621221",
      "parentCode": "621200"
},
{
      "code": "621222",
      "name": "文县",
      "type": 3,
      "path": "620000,621200,621222",
      "parentCode": "621200"
},
{
      "code": "621223",
      "name": "宕昌县",
      "type": 3,
      "path": "620000,621200,621223",
      "parentCode": "621200"
},
{
      "code": "621224",
      "name": "康县",
      "type": 3,
      "path": "620000,621200,621224",
      "parentCode": "621200"
},
{
      "code": "621225",
      "name": "西和县",
      "type": 3,
      "path": "620000,621200,621225",
      "parentCode": "621200"
},
{
      "code": "621226",
      "name": "礼县",
      "type": 3,
      "path": "620000,621200,621226",
      "parentCode": "621200"
},
{
      "code": "621227",
      "name": "徽县",
      "type": 3,
      "path": "620000,621200,621227",
      "parentCode": "621200"
},
{
      "code": "621228",
      "name": "两当县",
      "type": 3,
      "path": "620000,621200,621228",
      "parentCode": "621200"
},
{
      "code": "622900",
      "name": "临夏回族自治州",
      "type": 2,
      "path": "620000,622900",
      "parentCode": "620000"
},
{
      "code": "622901",
      "name": "临夏市",
      "type": 3,
      "path": "620000,622900,622901",
      "parentCode": "622900"
},
{
      "code": "622921",
      "name": "临夏县",
      "type": 3,
      "path": "620000,622900,622921",
      "parentCode": "622900"
},
{
      "code": "622922",
      "name": "康乐县",
      "type": 3,
      "path": "620000,622900,622922",
      "parentCode": "622900"
},
{
      "code": "622923",
      "name": "永靖县",
      "type": 3,
      "path": "620000,622900,622923",
      "parentCode": "622900"
},
{
      "code": "622924",
      "name": "广河县",
      "type": 3,
      "path": "620000,622900,622924",
      "parentCode": "622900"
},
{
      "code": "622925",
      "name": "和政县",
      "type": 3,
      "path": "620000,622900,622925",
      "parentCode": "622900"
},
{
      "code": "622926",
      "name": "东乡族自治县",
      "type": 3,
      "path": "620000,622900,622926",
      "parentCode": "622900"
},
{
      "code": "622927",
      "name": "积石山保安族东乡族撒拉族自治县",
      "type": 3,
      "path": "620000,622900,622927",
      "parentCode": "622900"
},
{
      "code": "623000",
      "name": "甘南藏族自治州",
      "type": 2,
      "path": "620000,623000",
      "parentCode": "620000"
},
{
      "code": "623001",
      "name": "合作市",
      "type": 3,
      "path": "620000,623000,623001",
      "parentCode": "623000"
},
{
      "code": "623021",
      "name": "临潭县",
      "type": 3,
      "path": "620000,623000,623021",
      "parentCode": "623000"
},
{
      "code": "623022",
      "name": "卓尼县",
      "type": 3,
      "path": "620000,623000,623022",
      "parentCode": "623000"
},
{
      "code": "623023",
      "name": "舟曲县",
      "type": 3,
      "path": "620000,623000,623023",
      "parentCode": "623000"
},
{
      "code": "623024",
      "name": "迭部县",
      "type": 3,
      "path": "620000,623000,623024",
      "parentCode": "623000"
},
{
      "code": "623025",
      "name": "玛曲县",
      "type": 3,
      "path": "620000,623000,623025",
      "parentCode": "623000"
},
{
      "code": "623026",
      "name": "碌曲县",
      "type": 3,
      "path": "620000,623000,623026",
      "parentCode": "623000"
},
{
      "code": "623027",
      "name": "夏河县",
      "type": 3,
      "path": "620000,623000,623027",
      "parentCode": "623000"
},
{
      "code": "630000",
      "name": "青海省",
      "type": 1,
      "path": "630000",
      "parentCode": null
},
{
      "code": "630100",
      "name": "西宁市",
      "type": 2,
      "path": "630000,630100",
      "parentCode": "630000"
},
{
      "code": "630102",
      "name": "城东区",
      "type": 3,
      "path": "630000,630100,630102",
      "parentCode": "630100"
},
{
      "code": "630103",
      "name": "城中区",
      "type": 3,
      "path": "630000,630100,630103",
      "parentCode": "630100"
},
{
      "code": "630104",
      "name": "城西区",
      "type": 3,
      "path": "630000,630100,630104",
      "parentCode": "630100"
},
{
      "code": "630105",
      "name": "城北区",
      "type": 3,
      "path": "630000,630100,630105",
      "parentCode": "630100"
},
{
      "code": "630121",
      "name": "大通回族土族自治县",
      "type": 3,
      "path": "630000,630100,630121",
      "parentCode": "630100"
},
{
      "code": "630122",
      "name": "湟中县",
      "type": 3,
      "path": "630000,630100,630122",
      "parentCode": "630100"
},
{
      "code": "630123",
      "name": "湟源县",
      "type": 3,
      "path": "630000,630100,630123",
      "parentCode": "630100"
},
{
      "code": "632100",
      "name": "海东地区",
      "type": 2,
      "path": "630000,632100",
      "parentCode": "630000"
},
{
      "code": "632100",
      "name": "海东地区",
      "type": 3,
      "path": "630000,632100,632100",
      "parentCode": "632100"
},
{
      "code": "632121",
      "name": "平安县",
      "type": 3,
      "path": "630000,632100,632121",
      "parentCode": "632100"
},
{
      "code": "632122",
      "name": "民和回族土族自治县",
      "type": 3,
      "path": "630000,632100,632122",
      "parentCode": "632100"
},
{
      "code": "632123",
      "name": "乐都县",
      "type": 3,
      "path": "630000,632100,632123",
      "parentCode": "632100"
},
{
      "code": "632126",
      "name": "互助土族自治县",
      "type": 3,
      "path": "630000,632100,632126",
      "parentCode": "632100"
},
{
      "code": "632127",
      "name": "化隆回族自治县",
      "type": 3,
      "path": "630000,632100,632127",
      "parentCode": "632100"
},
{
      "code": "632128",
      "name": "循化撒拉族自治县",
      "type": 3,
      "path": "630000,632100,632128",
      "parentCode": "632100"
},
{
      "code": "632200",
      "name": "海北藏族自治州",
      "type": 2,
      "path": "630000,632200",
      "parentCode": "630000"
},
{
      "code": "632221",
      "name": "门源回族自治县",
      "type": 3,
      "path": "630000,632200,632221",
      "parentCode": "632200"
},
{
      "code": "632222",
      "name": "祁连县",
      "type": 3,
      "path": "630000,632200,632222",
      "parentCode": "632200"
},
{
      "code": "632223",
      "name": "海晏县",
      "type": 3,
      "path": "630000,632200,632223",
      "parentCode": "632200"
},
{
      "code": "632224",
      "name": "刚察县",
      "type": 3,
      "path": "630000,632200,632224",
      "parentCode": "632200"
},
{
      "code": "632300",
      "name": "黄南藏族自治州",
      "type": 2,
      "path": "630000,632300",
      "parentCode": "630000"
},
{
      "code": "632321",
      "name": "同仁县",
      "type": 3,
      "path": "630000,632300,632321",
      "parentCode": "632300"
},
{
      "code": "632322",
      "name": "尖扎县",
      "type": 3,
      "path": "630000,632300,632322",
      "parentCode": "632300"
},
{
      "code": "632323",
      "name": "泽库县",
      "type": 3,
      "path": "630000,632300,632323",
      "parentCode": "632300"
},
{
      "code": "632324",
      "name": "河南蒙古族自治县",
      "type": 3,
      "path": "630000,632300,632324",
      "parentCode": "632300"
},
{
      "code": "632500",
      "name": "海南藏族自治州",
      "type": 2,
      "path": "630000,632500",
      "parentCode": "630000"
},
{
      "code": "632521",
      "name": "共和县",
      "type": 3,
      "path": "630000,632500,632521",
      "parentCode": "632500"
},
{
      "code": "632522",
      "name": "同德县",
      "type": 3,
      "path": "630000,632500,632522",
      "parentCode": "632500"
},
{
      "code": "632523",
      "name": "贵德县",
      "type": 3,
      "path": "630000,632500,632523",
      "parentCode": "632500"
},
{
      "code": "632524",
      "name": "兴海县",
      "type": 3,
      "path": "630000,632500,632524",
      "parentCode": "632500"
},
{
      "code": "632525",
      "name": "贵南县",
      "type": 3,
      "path": "630000,632500,632525",
      "parentCode": "632500"
},
{
      "code": "632600",
      "name": "果洛藏族自治州",
      "type": 2,
      "path": "630000,632600",
      "parentCode": "630000"
},
{
      "code": "632621",
      "name": "玛沁县",
      "type": 3,
      "path": "630000,632600,632621",
      "parentCode": "632600"
},
{
      "code": "632622",
      "name": "班玛县",
      "type": 3,
      "path": "630000,632600,632622",
      "parentCode": "632600"
},
{
      "code": "632623",
      "name": "甘德县",
      "type": 3,
      "path": "630000,632600,632623",
      "parentCode": "632600"
},
{
      "code": "632624",
      "name": "达日县",
      "type": 3,
      "path": "630000,632600,632624",
      "parentCode": "632600"
},
{
      "code": "632625",
      "name": "久治县",
      "type": 3,
      "path": "630000,632600,632625",
      "parentCode": "632600"
},
{
      "code": "632626",
      "name": "玛多县",
      "type": 3,
      "path": "630000,632600,632626",
      "parentCode": "632600"
},
{
      "code": "632700",
      "name": "玉树藏族自治州",
      "type": 2,
      "path": "630000,632700",
      "parentCode": "630000"
},
{
      "code": "632701",
      "name": "玉树市",
      "type": 3,
      "path": "630000,632700,632701",
      "parentCode": "632700"
},
{
      "code": "632722",
      "name": "杂多县",
      "type": 3,
      "path": "630000,632700,632722",
      "parentCode": "632700"
},
{
      "code": "632723",
      "name": "称多县",
      "type": 3,
      "path": "630000,632700,632723",
      "parentCode": "632700"
},
{
      "code": "632724",
      "name": "治多县",
      "type": 3,
      "path": "630000,632700,632724",
      "parentCode": "632700"
},
{
      "code": "632725",
      "name": "囊谦县",
      "type": 3,
      "path": "630000,632700,632725",
      "parentCode": "632700"
},
{
      "code": "632726",
      "name": "曲麻莱县",
      "type": 3,
      "path": "630000,632700,632726",
      "parentCode": "632700"
},
{
      "code": "632800",
      "name": "海西蒙古族藏族自治州",
      "type": 2,
      "path": "630000,632800",
      "parentCode": "630000"
},
{
      "code": "632801",
      "name": "格尔木市",
      "type": 3,
      "path": "630000,632800,632801",
      "parentCode": "632800"
},
{
      "code": "632802",
      "name": "德令哈市",
      "type": 3,
      "path": "630000,632800,632802",
      "parentCode": "632800"
},
{
      "code": "632821",
      "name": "乌兰县",
      "type": 3,
      "path": "630000,632800,632821",
      "parentCode": "632800"
},
{
      "code": "632822",
      "name": "都兰县",
      "type": 3,
      "path": "630000,632800,632822",
      "parentCode": "632800"
},
{
      "code": "632823",
      "name": "天峻县",
      "type": 3,
      "path": "630000,632800,632823",
      "parentCode": "632800"
},
{
      "code": "640000",
      "name": "宁夏回族自治区",
      "type": 1,
      "path": "640000",
      "parentCode": null
},
{
      "code": "640100",
      "name": "银川市",
      "type": 2,
      "path": "640000,640100",
      "parentCode": "640000"
},
{
      "code": "640104",
      "name": "兴庆区",
      "type": 3,
      "path": "640000,640100,640104",
      "parentCode": "640100"
},
{
      "code": "640105",
      "name": "西夏区",
      "type": 3,
      "path": "640000,640100,640105",
      "parentCode": "640100"
},
{
      "code": "640106",
      "name": "金凤区",
      "type": 3,
      "path": "640000,640100,640106",
      "parentCode": "640100"
},
{
      "code": "640121",
      "name": "永宁县",
      "type": 3,
      "path": "640000,640100,640121",
      "parentCode": "640100"
},
{
      "code": "640122",
      "name": "贺兰县",
      "type": 3,
      "path": "640000,640100,640122",
      "parentCode": "640100"
},
{
      "code": "640181",
      "name": "灵武市",
      "type": 3,
      "path": "640000,640100,640181",
      "parentCode": "640100"
},
{
      "code": "640200",
      "name": "石嘴山市",
      "type": 2,
      "path": "640000,640200",
      "parentCode": "640000"
},
{
      "code": "640202",
      "name": "大武口区",
      "type": 3,
      "path": "640000,640200,640202",
      "parentCode": "640200"
},
{
      "code": "640205",
      "name": "惠农区",
      "type": 3,
      "path": "640000,640200,640205",
      "parentCode": "640200"
},
{
      "code": "640221",
      "name": "平罗县",
      "type": 3,
      "path": "640000,640200,640221",
      "parentCode": "640200"
},
{
      "code": "640300",
      "name": "吴忠市",
      "type": 2,
      "path": "640000,640300",
      "parentCode": "640000"
},
{
      "code": "640302",
      "name": "利通区",
      "type": 3,
      "path": "640000,640300,640302",
      "parentCode": "640300"
},
{
      "code": "640303",
      "name": "红寺堡区",
      "type": 3,
      "path": "640000,640300,640303",
      "parentCode": "640300"
},
{
      "code": "640323",
      "name": "盐池县",
      "type": 3,
      "path": "640000,640300,640323",
      "parentCode": "640300"
},
{
      "code": "640324",
      "name": "同心县",
      "type": 3,
      "path": "640000,640300,640324",
      "parentCode": "640300"
},
{
      "code": "640381",
      "name": "青铜峡市",
      "type": 3,
      "path": "640000,640300,640381",
      "parentCode": "640300"
},
{
      "code": "640400",
      "name": "固原市",
      "type": 2,
      "path": "640000,640400",
      "parentCode": "640000"
},
{
      "code": "640402",
      "name": "原州区",
      "type": 3,
      "path": "640000,640400,640402",
      "parentCode": "640400"
},
{
      "code": "640422",
      "name": "西吉县",
      "type": 3,
      "path": "640000,640400,640422",
      "parentCode": "640400"
},
{
      "code": "640423",
      "name": "隆德县",
      "type": 3,
      "path": "640000,640400,640423",
      "parentCode": "640400"
},
{
      "code": "640424",
      "name": "泾源县",
      "type": 3,
      "path": "640000,640400,640424",
      "parentCode": "640400"
},
{
      "code": "640425",
      "name": "彭阳县",
      "type": 3,
      "path": "640000,640400,640425",
      "parentCode": "640400"
},
{
      "code": "640500",
      "name": "中卫市",
      "type": 2,
      "path": "640000,640500",
      "parentCode": "640000"
},
{
      "code": "640502",
      "name": "沙坡头区",
      "type": 3,
      "path": "640000,640500,640502",
      "parentCode": "640500"
},
{
      "code": "640521",
      "name": "中宁县",
      "type": 3,
      "path": "640000,640500,640521",
      "parentCode": "640500"
},
{
      "code": "640522",
      "name": "海原县",
      "type": 3,
      "path": "640000,640500,640522",
      "parentCode": "640500"
},
{
      "code": "650000",
      "name": "新疆维吾尔自治区",
      "type": 1,
      "path": "650000",
      "parentCode": null
},
{
      "code": "650100",
      "name": "乌鲁木齐市",
      "type": 2,
      "path": "650000,650100",
      "parentCode": "650000"
},
{
      "code": "650102",
      "name": "天山区",
      "type": 3,
      "path": "650000,650100,650102",
      "parentCode": "650100"
},
{
      "code": "650103",
      "name": "沙依巴克区",
      "type": 3,
      "path": "650000,650100,650103",
      "parentCode": "650100"
},
{
      "code": "650104",
      "name": "新市区",
      "type": 3,
      "path": "650000,650100,650104",
      "parentCode": "650100"
},
{
      "code": "650105",
      "name": "水磨沟区",
      "type": 3,
      "path": "650000,650100,650105",
      "parentCode": "650100"
},
{
      "code": "650106",
      "name": "头屯河区",
      "type": 3,
      "path": "650000,650100,650106",
      "parentCode": "650100"
},
{
      "code": "650107",
      "name": "达坂城区",
      "type": 3,
      "path": "650000,650100,650107",
      "parentCode": "650100"
},
{
      "code": "650109",
      "name": "米东区",
      "type": 3,
      "path": "650000,650100,650109",
      "parentCode": "650100"
},
{
      "code": "650121",
      "name": "乌鲁木齐县",
      "type": 3,
      "path": "650000,650100,650121",
      "parentCode": "650100"
},
{
      "code": "650200",
      "name": "克拉玛依市",
      "type": 2,
      "path": "650000,650200",
      "parentCode": "650000"
},
{
      "code": "650202",
      "name": "独山子区",
      "type": 3,
      "path": "650000,650200,650202",
      "parentCode": "650200"
},
{
      "code": "650203",
      "name": "克拉玛依区",
      "type": 3,
      "path": "650000,650200,650203",
      "parentCode": "650200"
},
{
      "code": "650204",
      "name": "白碱滩区",
      "type": 3,
      "path": "650000,650200,650204",
      "parentCode": "650200"
},
{
      "code": "650205",
      "name": "乌尔禾区",
      "type": 3,
      "path": "650000,650200,650205",
      "parentCode": "650200"
},
{
      "code": "652100",
      "name": "吐鲁番地区",
      "type": 2,
      "path": "650000,652100",
      "parentCode": "650000"
},
{
      "code": "652101",
      "name": "吐鲁番市",
      "type": 3,
      "path": "650000,652100,652101",
      "parentCode": "652100"
},
{
      "code": "652122",
      "name": "鄯善县",
      "type": 3,
      "path": "650000,652100,652122",
      "parentCode": "652100"
},
{
      "code": "652123",
      "name": "托克逊县",
      "type": 3,
      "path": "650000,652100,652123",
      "parentCode": "652100"
},
{
      "code": "652200",
      "name": "哈密地区",
      "type": 2,
      "path": "650000,652200",
      "parentCode": "650000"
},
{
      "code": "652201",
      "name": "哈密市",
      "type": 3,
      "path": "650000,652200,652201",
      "parentCode": "652200"
},
{
      "code": "652222",
      "name": "巴里坤哈萨克自治县",
      "type": 3,
      "path": "650000,652200,652222",
      "parentCode": "652200"
},
{
      "code": "652223",
      "name": "伊吾县",
      "type": 3,
      "path": "650000,652200,652223",
      "parentCode": "652200"
},
{
      "code": "652300",
      "name": "昌吉回族自治州",
      "type": 2,
      "path": "650000,652300",
      "parentCode": "650000"
},
{
      "code": "652301",
      "name": "昌吉市",
      "type": 3,
      "path": "650000,652300,652301",
      "parentCode": "652300"
},
{
      "code": "652302",
      "name": "阜康市",
      "type": 3,
      "path": "650000,652300,652302",
      "parentCode": "652300"
},
{
      "code": "652323",
      "name": "呼图壁县",
      "type": 3,
      "path": "650000,652300,652323",
      "parentCode": "652300"
},
{
      "code": "652324",
      "name": "玛纳斯县",
      "type": 3,
      "path": "650000,652300,652324",
      "parentCode": "652300"
},
{
      "code": "652325",
      "name": "奇台县",
      "type": 3,
      "path": "650000,652300,652325",
      "parentCode": "652300"
},
{
      "code": "652327",
      "name": "吉木萨尔县",
      "type": 3,
      "path": "650000,652300,652327",
      "parentCode": "652300"
},
{
      "code": "652328",
      "name": "木垒哈萨克自治县",
      "type": 3,
      "path": "650000,652300,652328",
      "parentCode": "652300"
},
{
      "code": "652700",
      "name": "博尔塔拉蒙古自治州",
      "type": 2,
      "path": "650000,652700",
      "parentCode": "650000"
},
{
      "code": "652701",
      "name": "博乐市",
      "type": 3,
      "path": "650000,652700,652701",
      "parentCode": "652700"
},
{
      "code": "652702",
      "name": "阿拉山口市",
      "type": 3,
      "path": "650000,652700,652702",
      "parentCode": "652700"
},
{
      "code": "652722",
      "name": "精河县",
      "type": 3,
      "path": "650000,652700,652722",
      "parentCode": "652700"
},
{
      "code": "652723",
      "name": "温泉县",
      "type": 3,
      "path": "650000,652700,652723",
      "parentCode": "652700"
},
{
      "code": "652800",
      "name": "巴音郭楞蒙古自治州",
      "type": 2,
      "path": "650000,652800",
      "parentCode": "650000"
},
{
      "code": "652801",
      "name": "库尔勒市",
      "type": 3,
      "path": "650000,652800,652801",
      "parentCode": "652800"
},
{
      "code": "652822",
      "name": "轮台县",
      "type": 3,
      "path": "650000,652800,652822",
      "parentCode": "652800"
},
{
      "code": "652823",
      "name": "尉犁县",
      "type": 3,
      "path": "650000,652800,652823",
      "parentCode": "652800"
},
{
      "code": "652824",
      "name": "若羌县",
      "type": 3,
      "path": "650000,652800,652824",
      "parentCode": "652800"
},
{
      "code": "652825",
      "name": "且末县",
      "type": 3,
      "path": "650000,652800,652825",
      "parentCode": "652800"
},
{
      "code": "652826",
      "name": "焉耆回族自治县",
      "type": 3,
      "path": "650000,652800,652826",
      "parentCode": "652800"
},
{
      "code": "652827",
      "name": "和静县",
      "type": 3,
      "path": "650000,652800,652827",
      "parentCode": "652800"
},
{
      "code": "652828",
      "name": "和硕县",
      "type": 3,
      "path": "650000,652800,652828",
      "parentCode": "652800"
},
{
      "code": "652829",
      "name": "博湖县",
      "type": 3,
      "path": "650000,652800,652829",
      "parentCode": "652800"
},
{
      "code": "652900",
      "name": "阿克苏地区",
      "type": 2,
      "path": "650000,652900",
      "parentCode": "650000"
},
{
      "code": "652901",
      "name": "阿克苏市",
      "type": 3,
      "path": "650000,652900,652901",
      "parentCode": "652900"
},
{
      "code": "652922",
      "name": "温宿县",
      "type": 3,
      "path": "650000,652900,652922",
      "parentCode": "652900"
},
{
      "code": "652923",
      "name": "库车县",
      "type": 3,
      "path": "650000,652900,652923",
      "parentCode": "652900"
},
{
      "code": "652924",
      "name": "沙雅县",
      "type": 3,
      "path": "650000,652900,652924",
      "parentCode": "652900"
},
{
      "code": "652925",
      "name": "新和县",
      "type": 3,
      "path": "650000,652900,652925",
      "parentCode": "652900"
},
{
      "code": "652926",
      "name": "拜城县",
      "type": 3,
      "path": "650000,652900,652926",
      "parentCode": "652900"
},
{
      "code": "652927",
      "name": "乌什县",
      "type": 3,
      "path": "650000,652900,652927",
      "parentCode": "652900"
},
{
      "code": "652928",
      "name": "阿瓦提县",
      "type": 3,
      "path": "650000,652900,652928",
      "parentCode": "652900"
},
{
      "code": "652929",
      "name": "柯坪县",
      "type": 3,
      "path": "650000,652900,652929",
      "parentCode": "652900"
},
{
      "code": "653000",
      "name": "克孜勒苏柯尔克孜自治州",
      "type": 2,
      "path": "650000,653000",
      "parentCode": "650000"
},
{
      "code": "653001",
      "name": "阿图什市",
      "type": 3,
      "path": "650000,653000,653001",
      "parentCode": "653000"
},
{
      "code": "653022",
      "name": "阿克陶县",
      "type": 3,
      "path": "650000,653000,653022",
      "parentCode": "653000"
},
{
      "code": "653023",
      "name": "阿合奇县",
      "type": 3,
      "path": "650000,653000,653023",
      "parentCode": "653000"
},
{
      "code": "653024",
      "name": "乌恰县",
      "type": 3,
      "path": "650000,653000,653024",
      "parentCode": "653000"
},
{
      "code": "653100",
      "name": "喀什地区",
      "type": 2,
      "path": "650000,653100",
      "parentCode": "650000"
},
{
      "code": "653101",
      "name": "喀什市",
      "type": 3,
      "path": "650000,653100,653101",
      "parentCode": "653100"
},
{
      "code": "653121",
      "name": "疏附县",
      "type": 3,
      "path": "650000,653100,653121",
      "parentCode": "653100"
},
{
      "code": "653122",
      "name": "疏勒县",
      "type": 3,
      "path": "650000,653100,653122",
      "parentCode": "653100"
},
{
      "code": "653123",
      "name": "英吉沙县",
      "type": 3,
      "path": "650000,653100,653123",
      "parentCode": "653100"
},
{
      "code": "653124",
      "name": "泽普县",
      "type": 3,
      "path": "650000,653100,653124",
      "parentCode": "653100"
},
{
      "code": "653125",
      "name": "莎车县",
      "type": 3,
      "path": "650000,653100,653125",
      "parentCode": "653100"
},
{
      "code": "653126",
      "name": "叶城县",
      "type": 3,
      "path": "650000,653100,653126",
      "parentCode": "653100"
},
{
      "code": "653127",
      "name": "麦盖提县",
      "type": 3,
      "path": "650000,653100,653127",
      "parentCode": "653100"
},
{
      "code": "653128",
      "name": "岳普湖县",
      "type": 3,
      "path": "650000,653100,653128",
      "parentCode": "653100"
},
{
      "code": "653129",
      "name": "伽师县",
      "type": 3,
      "path": "650000,653100,653129",
      "parentCode": "653100"
},
{
      "code": "653130",
      "name": "巴楚县",
      "type": 3,
      "path": "650000,653100,653130",
      "parentCode": "653100"
},
{
      "code": "653131",
      "name": "塔什库尔干塔吉克自治县",
      "type": 3,
      "path": "650000,653100,653131",
      "parentCode": "653100"
},
{
      "code": "653200",
      "name": "和田地区",
      "type": 2,
      "path": "650000,653200",
      "parentCode": "650000"
},
{
      "code": "653201",
      "name": "和田市",
      "type": 3,
      "path": "650000,653200,653201",
      "parentCode": "653200"
},
{
      "code": "653221",
      "name": "和田县",
      "type": 3,
      "path": "650000,653200,653221",
      "parentCode": "653200"
},
{
      "code": "653222",
      "name": "墨玉县",
      "type": 3,
      "path": "650000,653200,653222",
      "parentCode": "653200"
},
{
      "code": "653223",
      "name": "皮山县",
      "type": 3,
      "path": "650000,653200,653223",
      "parentCode": "653200"
},
{
      "code": "653224",
      "name": "洛浦县",
      "type": 3,
      "path": "650000,653200,653224",
      "parentCode": "653200"
},
{
      "code": "653225",
      "name": "策勒县",
      "type": 3,
      "path": "650000,653200,653225",
      "parentCode": "653200"
},
{
      "code": "653226",
      "name": "于田县",
      "type": 3,
      "path": "650000,653200,653226",
      "parentCode": "653200"
},
{
      "code": "653227",
      "name": "民丰县",
      "type": 3,
      "path": "650000,653200,653227",
      "parentCode": "653200"
},
{
      "code": "654000",
      "name": "伊犁哈萨克自治州",
      "type": 2,
      "path": "650000,654000",
      "parentCode": "650000"
},
{
      "code": "654002",
      "name": "伊宁市",
      "type": 3,
      "path": "650000,654000,654002",
      "parentCode": "654000"
},
{
      "code": "654003",
      "name": "奎屯市",
      "type": 3,
      "path": "650000,654000,654003",
      "parentCode": "654000"
},
{
      "code": "654021",
      "name": "伊宁县",
      "type": 3,
      "path": "650000,654000,654021",
      "parentCode": "654000"
},
{
      "code": "654022",
      "name": "察布查尔锡伯自治县",
      "type": 3,
      "path": "650000,654000,654022",
      "parentCode": "654000"
},
{
      "code": "654023",
      "name": "霍城县",
      "type": 3,
      "path": "650000,654000,654023",
      "parentCode": "654000"
},
{
      "code": "654024",
      "name": "巩留县",
      "type": 3,
      "path": "650000,654000,654024",
      "parentCode": "654000"
},
{
      "code": "654025",
      "name": "新源县",
      "type": 3,
      "path": "650000,654000,654025",
      "parentCode": "654000"
},
{
      "code": "654026",
      "name": "昭苏县",
      "type": 3,
      "path": "650000,654000,654026",
      "parentCode": "654000"
},
{
      "code": "654027",
      "name": "特克斯县",
      "type": 3,
      "path": "650000,654000,654027",
      "parentCode": "654000"
},
{
      "code": "654028",
      "name": "尼勒克县",
      "type": 3,
      "path": "650000,654000,654028",
      "parentCode": "654000"
},
{
      "code": "654200",
      "name": "塔城地区",
      "type": 2,
      "path": "650000,654200",
      "parentCode": "650000"
},
{
      "code": "654201",
      "name": "塔城市",
      "type": 3,
      "path": "650000,654200,654201",
      "parentCode": "654200"
},
{
      "code": "654202",
      "name": "乌苏市",
      "type": 3,
      "path": "650000,654200,654202",
      "parentCode": "654200"
},
{
      "code": "654221",
      "name": "额敏县",
      "type": 3,
      "path": "650000,654200,654221",
      "parentCode": "654200"
},
{
      "code": "654223",
      "name": "沙湾县",
      "type": 3,
      "path": "650000,654200,654223",
      "parentCode": "654200"
},
{
      "code": "654224",
      "name": "托里县",
      "type": 3,
      "path": "650000,654200,654224",
      "parentCode": "654200"
},
{
      "code": "654225",
      "name": "裕民县",
      "type": 3,
      "path": "650000,654200,654225",
      "parentCode": "654200"
},
{
      "code": "654226",
      "name": "和布克赛尔蒙古自治县",
      "type": 3,
      "path": "650000,654200,654226",
      "parentCode": "654200"
},
{
      "code": "654300",
      "name": "阿勒泰地区",
      "type": 2,
      "path": "650000,654300",
      "parentCode": "650000"
},
{
      "code": "654301",
      "name": "阿勒泰市",
      "type": 3,
      "path": "650000,654300,654301",
      "parentCode": "654300"
},
{
      "code": "654321",
      "name": "布尔津县",
      "type": 3,
      "path": "650000,654300,654321",
      "parentCode": "654300"
},
{
      "code": "654322",
      "name": "富蕴县",
      "type": 3,
      "path": "650000,654300,654322",
      "parentCode": "654300"
},
{
      "code": "654323",
      "name": "福海县",
      "type": 3,
      "path": "650000,654300,654323",
      "parentCode": "654300"
},
{
      "code": "654324",
      "name": "哈巴河县",
      "type": 3,
      "path": "650000,654300,654324",
      "parentCode": "654300"
},
{
      "code": "654325",
      "name": "青河县",
      "type": 3,
      "path": "650000,654300,654325",
      "parentCode": "654300"
},
{
      "code": "654326",
      "name": "吉木乃县",
      "type": 3,
      "path": "650000,654300,654326",
      "parentCode": "654300"
},
{
      "code": "659000",
      "name": "省直辖行政单位",
      "type": 2,
      "path": "650000,659000",
      "parentCode": "650000"
},
{
      "code": "659001",
      "name": "石河子市",
      "type": 3,
      "path": "650000,659000,659001",
      "parentCode": "659000"
},
{
      "code": "659002",
      "name": "阿拉尔市",
      "type": 3,
      "path": "650000,659000,659002",
      "parentCode": "659000"
},
{
      "code": "659003",
      "name": "图木舒克市",
      "type": 3,
      "path": "650000,659000,659003",
      "parentCode": "659000"
},
{
      "code": "710000",
      "name": "台湾省",
      "type": 1,
      "path": "710000",
      "parentCode": null
},
{
      "code": "810000",
      "name": "香港特别行政区",
      "type": 1,
      "path": "810000",
      "parentCode": null
},
{
      "code": "820000",
      "name": "澳门特别行政区",
      "type": 1,
      "path": "820000",
      "parentCode": null
}
];