const map = {
    "data": [
        {
            "text": "北京市",
            "id": "1000",
            "citys": [
                {
                    "id": "100000",
                    "text": "北京市"
                }
            ]
        },
        {
            "text": "天津市",
            "id": "1100",
            "citys": [
                {
                    "id": "110000",
                    "text": "天津市"
                }
            ]
        },
        {
            "text": "河北",
            "id": "1210",
            "citys": [
                {
                    "id": "121000",
                    "text": "石家庄市"
                },
                {
                    "id": "124000",
                    "text": "唐山市"
                },
                {
                    "id": "126000",
                    "text": "秦皇岛市  "
                },
                {
                    "id": "127000",
                    "text": "邯郸市"
                },
                {
                    "id": "131000",
                    "text": "邢台市"
                },
                {
                    "id": "134000",
                    "text": "保定市"
                },
                {
                    "id": "138000",
                    "text": "张家口市"
                },
                {
                    "id": "141000",
                    "text": "承德市"
                },
                {
                    "id": "143000",
                    "text": "沧州市"
                },
                {
                    "id": "146000",
                    "text": "廊坊市"
                },
                {
                    "id": "148000",
                    "text": "衡水市"
                }
            ]
        },
        {
            "text": "山西",
            "id": "1610",
            "citys": [
                {
                    "id": "173000",
                    "text": "吕梁市"
                },
                {
                    "id": "175000",
                    "text": "晋中市"
                },
                {
                    "id": "177000",
                    "text": "临汾市"
                },
                {
                    "id": "181000",
                    "text": "运城市"
                },
                {
                    "id": "161000",
                    "text": "太原市"
                },
                {
                    "id": "162000",
                    "text": "大同市"
                },
                {
                    "id": "163000",
                    "text": "阳泉市"
                },
                {
                    "id": "164000",
                    "text": "长冶市"
                },
                {
                    "id": "168000",
                    "text": "晋城市"
                },
                {
                    "id": "169000",
                    "text": "朔州市"
                },
                {
                    "id": "171000",
                    "text": "忻州市"
                }
            ]
        },
        {
            "text": "内蒙古",
            "id": "1910",
            "citys": [
                {
                    "id": "205000",
                    "text": "鄂尔多斯市  "
                },
                {
                    "id": "207400",
                    "text": "乌拉特前旗  "
                },
                {
                    "id": "208000",
                    "text": "阿拉善盟  "
                },
                {
                    "id": "191000",
                    "text": "呼和浩特市"
                },
                {
                    "id": "192000",
                    "text": "包头市"
                },
                {
                    "id": "193000",
                    "text": "乌海市"
                },
                {
                    "id": "194000",
                    "text": "赤峰市"
                },
                {
                    "id": "196000",
                    "text": "呼伦贝尔市（海拉尔区）"
                },
                {
                    "id": "198000",
                    "text": "兴安盟"
                },
                {
                    "id": "199000",
                    "text": "通辽市"
                },
                {
                    "id": "201000",
                    "text": "锡林郭勒盟  "
                },
                {
                    "id": "203000",
                    "text": "乌兰察布盟  "
                }
            ]
        },
        {
            "text": "辽宁",
            "id": "2210",
            "citys": [
                {
                    "id": "221000",
                    "text": "沈阳市"
                },
                {
                    "id": "222000",
                    "text": "大连市"
                },
                {
                    "id": "223000",
                    "text": "鞍山市"
                },
                {
                    "id": "224000",
                    "text": "抚顺市"
                },
                {
                    "id": "225000",
                    "text": "本溪市"
                },
                {
                    "id": "226000",
                    "text": "丹东市"
                },
                {
                    "id": "227000",
                    "text": "锦州市"
                },
                {
                    "id": "227600",
                    "text": "葫芦岛市"
                },
                {
                    "id": "228000",
                    "text": "营口市"
                },
                {
                    "id": "229000",
                    "text": "阜新市"
                },
                {
                    "id": "231000",
                    "text": "辽阳市"
                },
                {
                    "id": "232000",
                    "text": "盘锦市"
                },
                {
                    "id": "233000",
                    "text": "铁岭市"
                },
                {
                    "id": "234000",
                    "text": "朝阳市"
                }
            ]
        },
        {
            "text": "吉林",
            "id": "2410",
            "citys": [
                {
                    "id": "241000",
                    "text": "长春市"
                },
                {
                    "id": "242000",
                    "text": "吉林市"
                },
                {
                    "id": "243000",
                    "text": "四平市"
                },
                {
                    "id": "244000",
                    "text": "辽源市"
                },
                {
                    "id": "245000",
                    "text": "通化市"
                },
                {
                    "id": "246000",
                    "text": "白山市"
                },
                {
                    "id": "247000",
                    "text": "白城市"
                },
                {
                    "id": "252000",
                    "text": "松原市"
                },
                {
                    "id": "249000",
                    "text": "延吉市"
                }
            ]
        },
        {
            "text": "黑龙江",
            "id": "2610",
            "citys": [
                {
                    "id": "261000",
                    "text": "哈尔滨市  "
                },
                {
                    "id": "264000",
                    "text": "齐齐哈尔市"
                },
                {
                    "id": "265000",
                    "text": "大庆市"
                },
                {
                    "id": "266000",
                    "text": "鸡西市"
                },
                {
                    "id": "267000",
                    "text": "鹤岗市"
                },
                {
                    "id": "268000",
                    "text": "双鸭山市"
                },
                {
                    "id": "269000",
                    "text": "佳木斯市"
                },
                {
                    "id": "271000",
                    "text": "伊春市"
                },
                {
                    "id": "272000",
                    "text": "牡丹江市"
                },
                {
                    "id": "274000",
                    "text": "七台河市  "
                },
                {
                    "id": "276000",
                    "text": "绥化市"
                },
                {
                    "id": "278000",
                    "text": "黑河市"
                },
                {
                    "id": "279000",
                    "text": "大兴安岭地区  "
                }
            ]
        },
        {
            "text": "上海市",
            "id": "2900",
            "citys": [
                {
                    "id": "290000",
                    "text": "上海市"
                }
            ]
        },
        {
            "text": "江苏",
            "id": "3010",
            "citys": [
                {
                    "id": "301000",
                    "text": "南京市"
                },
                {
                    "id": "302000",
                    "text": "无锡市"
                },
                {
                    "id": "303000",
                    "text": "徐州市"
                },
                {
                    "id": "304000",
                    "text": "常州市"
                },
                {
                    "id": "305000",
                    "text": "苏州市"
                },
                {
                    "id": "306000",
                    "text": "南通市"
                },
                {
                    "id": "307000",
                    "text": "连云港市"
                },
                {
                    "id": "308000",
                    "text": "淮安市"
                },
                {
                    "id": "309000",
                    "text": "宿迁市"
                },
                {
                    "id": "311000",
                    "text": "盐城市"
                },
                {
                    "id": "312000",
                    "text": "扬州市"
                },
                {
                    "id": "312800",
                    "text": "泰州市"
                },
                {
                    "id": "314000",
                    "text": "镇江市"
                }
            ]
        },
        {
            "text": "浙江",
            "id": "3310",
            "citys": [
                {
                    "id": "345000",
                    "text": "台州市"
                },
                {
                    "id": "343000",
                    "text": "丽水市"
                },
                {
                    "id": "331000",
                    "text": "杭州市"
                },
                {
                    "id": "332000",
                    "text": "宁波市"
                },
                {
                    "id": "333000",
                    "text": "温州市"
                },
                {
                    "id": "335000",
                    "text": "嘉兴市"
                },
                {
                    "id": "336000",
                    "text": "湖州市"
                },
                {
                    "id": "337000",
                    "text": "绍兴市"
                },
                {
                    "id": "338000",
                    "text": "金华市"
                },
                {
                    "id": "341000",
                    "text": "衢州市"
                },
                {
                    "id": "342000",
                    "text": "舟山市"
                }
            ]
        },
        {
            "text": "安徽",
            "id": "3610",
            "citys": [
                {
                    "id": "361000",
                    "text": "合肥市"
                },
                {
                    "id": "362000",
                    "text": "芜湖市"
                },
                {
                    "id": "363000",
                    "text": "蚌埠市"
                },
                {
                    "id": "364000",
                    "text": "淮南市"
                },
                {
                    "id": "365000",
                    "text": "马鞍山市  "
                },
                {
                    "id": "366000",
                    "text": "淮北市"
                },
                {
                    "id": "367000",
                    "text": "铜陵市"
                },
                {
                    "id": "368000",
                    "text": "安庆市"
                },
                {
                    "id": "371000",
                    "text": "黄山市"
                },
                {
                    "id": "372000",
                    "text": "阜阳市"
                },
                {
                    "id": "372200",
                    "text": "亳州市"
                },
                {
                    "id": "374000",
                    "text": "宿州市"
                },
                {
                    "id": "375000",
                    "text": "滁州市"
                },
                {
                    "id": "376000",
                    "text": "六安市"
                },
                {
                    "id": "377100",
                    "text": "宣城市"
                },
                {
                    "id": "378100",
                    "text": "巢湖市"
                },
                {
                    "id": "379000",
                    "text": "池州市"
                }
            ]
        },
        {
            "text": "福建",
            "id": "3910",
            "citys": [
                {
                    "id": "391000",
                    "text": "福州市"
                },
                {
                    "id": "393000",
                    "text": "厦门市"
                },
                {
                    "id": "394000",
                    "text": "莆田市"
                },
                {
                    "id": "395000",
                    "text": "三明市"
                },
                {
                    "id": "397000",
                    "text": "泉州市"
                },
                {
                    "id": "399000",
                    "text": "漳州市"
                },
                {
                    "id": "401000",
                    "text": "南平市"
                },
                {
                    "id": "403000",
                    "text": "宁德市"
                },
                {
                    "id": "405000",
                    "text": "龙岩市"
                }
            ]
        },
        {
            "text": "江西",
            "id": "4210",
            "citys": [
                {
                    "id": "421000",
                    "text": "南昌市"
                },
                {
                    "id": "422000",
                    "text": "景德镇市"
                },
                {
                    "id": "423000",
                    "text": "萍乡市"
                },
                {
                    "id": "424000",
                    "text": "九江市"
                },
                {
                    "id": "426000",
                    "text": "新余市"
                },
                {
                    "id": "427000",
                    "text": "鹰谭市"
                },
                {
                    "id": "428000",
                    "text": "赣州市"
                },
                {
                    "id": "431000",
                    "text": "宜春市"
                },
                {
                    "id": "433000",
                    "text": "上饶市"
                },
                {
                    "id": "435000",
                    "text": "吉安市"
                },
                {
                    "id": "437000",
                    "text": "抚州市"
                }
            ]
        },
        {
            "text": "山东",
            "id": "4510",
            "citys": [
                {
                    "id": "468000",
                    "text": "德州市"
                },
                {
                    "id": "471000",
                    "text": "聊城市"
                },
                {
                    "id": "473000",
                    "text": "临沂市"
                },
                {
                    "id": "473200",
                    "text": "日照市"
                },
                {
                    "id": "475000",
                    "text": "菏泽市"
                },
                {
                    "id": "451000",
                    "text": "济南市"
                },
                {
                    "id": "452000",
                    "text": "青岛市"
                },
                {
                    "id": "453000",
                    "text": "淄博市"
                },
                {
                    "id": "454000",
                    "text": "枣庄市"
                },
                {
                    "id": "455000",
                    "text": "东营市"
                },
                {
                    "id": "456000",
                    "text": "烟台市"
                },
                {
                    "id": "458000",
                    "text": "潍坊市"
                },
                {
                    "id": "461000",
                    "text": "济宁市"
                },
                {
                    "id": "463000",
                    "text": "泰安市"
                },
                {
                    "id": "463400",
                    "text": "莱芜市"
                },
                {
                    "id": "465000",
                    "text": "威海市"
                },
                {
                    "id": "466000",
                    "text": "滨州市"
                }
            ]
        },
        {
            "text": "河南",
            "id": "4910",
            "citys": [
                {
                    "id": "491000",
                    "text": "郑州市"
                },
                {
                    "id": "492000",
                    "text": "开封市"
                },
                {
                    "id": "493000",
                    "text": "洛阳市"
                },
                {
                    "id": "495000",
                    "text": "平顶山市  "
                },
                {
                    "id": "496000",
                    "text": "安阳市"
                },
                {
                    "id": "497000",
                    "text": "鹤壁市"
                },
                {
                    "id": "498000",
                    "text": "新乡市"
                },
                {
                    "id": "501000",
                    "text": "焦作市"
                },
                {
                    "id": "502000",
                    "text": "濮阳市"
                },
                {
                    "id": "503000",
                    "text": "许昌市"
                },
                {
                    "id": "504000",
                    "text": "漯河市"
                },
                {
                    "id": "505000",
                    "text": "三门峡市  "
                },
                {
                    "id": "506000",
                    "text": "商丘市"
                },
                {
                    "id": "508000",
                    "text": "周口市"
                },
                {
                    "id": "511000",
                    "text": "驻马店市  "
                },
                {
                    "id": "513000",
                    "text": "南阳市"
                },
                {
                    "id": "515000",
                    "text": "信阳市"
                }
            ]
        },
        {
            "text": "湖北",
            "id": "5210",
            "citys": [
                {
                    "id": "521000",
                    "text": "武汉市"
                },
                {
                    "id": "522000",
                    "text": "黄石市"
                },
                {
                    "id": "523000",
                    "text": "十堰市"
                },
                {
                    "id": "526000",
                    "text": "宜昌市"
                },
                {
                    "id": "528000",
                    "text": "襄樊市"
                },
                {
                    "id": "528600",
                    "text": "随州市"
                },
                {
                    "id": "531000",
                    "text": "鄂州市"
                },
                {
                    "id": "532000",
                    "text": "荆门市"
                },
                {
                    "id": "533000",
                    "text": "黄冈市"
                },
                {
                    "id": "535000",
                    "text": "孝感市"
                },
                {
                    "id": "536000",
                    "text": "咸宁市"
                },
                {
                    "id": "537000",
                    "text": "荆州市"
                },
                {
                    "id": "541000",
                    "text": "恩施州"
                }
            ]
        },
        {
            "text": "湖南",
            "id": "5510",
            "citys": [
                {
                    "id": "552000",
                    "text": "株州市"
                },
                {
                    "id": "553000",
                    "text": "湘潭市"
                },
                {
                    "id": "554000",
                    "text": "衡阳市"
                },
                {
                    "id": "555000",
                    "text": "邵阳市"
                },
                {
                    "id": "557000",
                    "text": "岳阳市"
                },
                {
                    "id": "558000",
                    "text": "常德市"
                },
                {
                    "id": "559000",
                    "text": "张家界市  "
                },
                {
                    "id": "561000",
                    "text": "益阳市"
                },
                {
                    "id": "562000",
                    "text": "娄底市"
                },
                {
                    "id": "563000",
                    "text": "郴州市"
                },
                {
                    "id": "565000",
                    "text": "永州市"
                },
                {
                    "id": "567000",
                    "text": "怀化市"
                },
                {
                    "id": "569000",
                    "text": "吉首市"
                },
                {
                    "id": "551000",
                    "text": "长沙市"
                }
            ]
        },
        {
            "text": "广东",
            "id": "5810",
            "citys": [
                {
                    "id": "581000",
                    "text": "广州市"
                },
                {
                    "id": "582000",
                    "text": "韶关市"
                },
                {
                    "id": "584000",
                    "text": "深圳市"
                },
                {
                    "id": "585000",
                    "text": "珠海市"
                },
                {
                    "id": "586000",
                    "text": "汕头市"
                },
                {
                    "id": "586500",
                    "text": "揭阳市"
                },
                {
                    "id": "586900",
                    "text": "潮州市"
                },
                {
                    "id": "588000",
                    "text": "佛山市"
                },
                {
                    "id": "589000",
                    "text": "江门市"
                },
                {
                    "id": "591000",
                    "text": "湛江市"
                },
                {
                    "id": "592000",
                    "text": "茂名市"
                },
                {
                    "id": "593000",
                    "text": "肇庆市"
                },
                {
                    "id": "593700",
                    "text": "云浮市"
                },
                {
                    "id": "595000",
                    "text": "惠州市"
                },
                {
                    "id": "596000",
                    "text": "梅州市"
                },
                {
                    "id": "597000",
                    "text": "汕尾市"
                },
                {
                    "id": "598000",
                    "text": "河源市"
                },
                {
                    "id": "599000",
                    "text": "阳江市"
                },
                {
                    "id": "601000",
                    "text": "清远市"
                },
                {
                    "id": "602000",
                    "text": "东莞市"
                },
                {
                    "id": "603000",
                    "text": "中山市"
                }
            ]
        },
        {
            "text": "广西",
            "id": "6110",
            "citys": [
                {
                    "id": "611000",
                    "text": "南宁市"
                },
                {
                    "id": "612800",
                    "text": "崇左市"
                },
                {
                    "id": "614000",
                    "text": "柳州市"
                },
                {
                    "id": "615500",
                    "text": "来宾市"
                },
                {
                    "id": "617000",
                    "text": "桂林市"
                },
                {
                    "id": "621000",
                    "text": "梧州市"
                },
                {
                    "id": "622500",
                    "text": "贺州市"
                },
                {
                    "id": "623000",
                    "text": "北海市"
                },
                {
                    "id": "624000",
                    "text": "玉林市"
                },
                {
                    "id": "624200",
                    "text": "贵港市"
                },
                {
                    "id": "626100",
                    "text": "百色市"
                },
                {
                    "id": "628100",
                    "text": "河池市"
                },
                {
                    "id": "631100",
                    "text": "钦州市"
                },
                {
                    "id": "633000",
                    "text": "防城港市  "
                }
            ]
        },
        {
            "text": "海南",
            "id": "6410",
            "citys": [
                {
                    "id": "641000",
                    "text": "海口市"
                },
                {
                    "id": "642000",
                    "text": "三亚市"
                }
            ]
        },
        {
            "text": "四川",
            "id": "6510",
            "citys": [
                {
                    "id": "651000",
                    "text": "成都市"
                },
                {
                    "id": "655000",
                    "text": "自贡市"
                },
                {
                    "id": "656000",
                    "text": "攀枝花市  "
                },
                {
                    "id": "657000",
                    "text": "泸州市"
                },
                {
                    "id": "658000",
                    "text": "德阳市"
                },
                {
                    "id": "659000",
                    "text": "绵阳市"
                },
                {
                    "id": "661000",
                    "text": "广元市"
                },
                {
                    "id": "662000",
                    "text": "遂宁市"
                },
                {
                    "id": "663000",
                    "text": "内江市"
                },
                {
                    "id": "663600",
                    "text": "资阳市"
                },
                {
                    "id": "665000",
                    "text": "乐山市"
                },
                {
                    "id": "665200",
                    "text": "眉山市"
                },
                {
                    "id": "671000",
                    "text": "宜宾市"
                },
                {
                    "id": "673000",
                    "text": "南充市"
                },
                {
                    "id": "673700",
                    "text": "广安市"
                },
                {
                    "id": "675000",
                    "text": "达州市"
                },
                {
                    "id": "675800",
                    "text": "巴中市"
                },
                {
                    "id": "677000",
                    "text": "雅安市"
                },
                {
                    "id": "679000",
                    "text": "马尔康县  "
                },
                {
                    "id": "681000",
                    "text": "康定县"
                },
                {
                    "id": "684000",
                    "text": "西昌市"
                }
            ]
        },
        {
            "text": "重庆市",
            "id": "6530",
            "citys": [
                {
                    "id": "653000",
                    "text": "重庆市"
                },
                {
                    "id": "667000",
                    "text": "万州区"
                },
                {
                    "id": "669000",
                    "text": "涪陵区"
                },
                {
                    "id": "687000",
                    "text": "黔江区"
                }
            ]
        },
        {
            "text": "贵州",
            "id": "7010",
            "citys": [
                {
                    "id": "705000",
                    "text": "铜仁市"
                },
                {
                    "id": "707000",
                    "text": "兴义市"
                },
                {
                    "id": "709000",
                    "text": "毕节市"
                },
                {
                    "id": "711000",
                    "text": "安顺市"
                },
                {
                    "id": "713000",
                    "text": "凯里市"
                },
                {
                    "id": "715000",
                    "text": "都匀市"
                },
                {
                    "id": "701000",
                    "text": "贵阳市"
                },
                {
                    "id": "702000",
                    "text": "六盘水市  "
                },
                {
                    "id": "703000",
                    "text": "遵义市"
                }
            ]
        },
        {
            "text": "云南",
            "id": "7310",
            "citys": [
                {
                    "id": "731000",
                    "text": "昆明市"
                },
                {
                    "id": "734000",
                    "text": "昭通市"
                },
                {
                    "id": "736000",
                    "text": "曲靖市"
                },
                {
                    "id": "738000",
                    "text": "楚雄市"
                },
                {
                    "id": "741000",
                    "text": "玉溪市"
                },
                {
                    "id": "743000",
                    "text": "个旧市"
                },
                {
                    "id": "745000",
                    "text": "文山县"
                },
                {
                    "id": "747000",
                    "text": "思茅市"
                },
                {
                    "id": "749000",
                    "text": "景洪市"
                },
                {
                    "id": "751000",
                    "text": "大理市"
                },
                {
                    "id": "753000",
                    "text": "保山市"
                },
                {
                    "id": "754000",
                    "text": "潞西市"
                },
                {
                    "id": "755000",
                    "text": "丽江县"
                },
                {
                    "id": "756000",
                    "text": "泸水县"
                },
                {
                    "id": "757000",
                    "text": "香格里拉县  "
                },
                {
                    "id": "758000",
                    "text": "临沧县"
                }
            ]
        },
        {
            "text": "西藏",
            "id": "7700",
            "citys": [
                {
                    "id": "770000",
                    "text": "拉萨市"
                },
                {
                    "id": "772000",
                    "text": "昌都县"
                },
                {
                    "id": "774000",
                    "text": "乃东县"
                },
                {
                    "id": "776000",
                    "text": "日喀则市  "
                },
                {
                    "id": "779000",
                    "text": "那曲县"
                },
                {
                    "id": "781100",
                    "text": "普兰县"
                },
                {
                    "id": "783000",
                    "text": "林芝县"
                }
            ]
        },
        {
            "text": "陕西",
            "id": "7910",
            "citys": [
                {
                    "id": "791000",
                    "text": "西安市"
                },
                {
                    "id": "792000",
                    "text": "铜川市"
                },
                {
                    "id": "793000",
                    "text": "宝鸡市"
                },
                {
                    "id": "795000",
                    "text": "咸阳市"
                },
                {
                    "id": "797000",
                    "text": "渭南市"
                },
                {
                    "id": "799000",
                    "text": "汉中市"
                },
                {
                    "id": "801000",
                    "text": "安康市"
                },
                {
                    "id": "803000",
                    "text": "商洛市"
                },
                {
                    "id": "804000",
                    "text": "延安市"
                },
                {
                    "id": "806000",
                    "text": "榆林市"
                }
            ]
        },
        {
            "text": "甘肃",
            "id": "8210",
            "citys": [
                {
                    "id": "821000",
                    "text": "兰州市"
                },
                {
                    "id": "822000",
                    "text": "嘉峪关市  "
                },
                {
                    "id": "823000",
                    "text": "金昌市"
                },
                {
                    "id": "824000",
                    "text": "白银市"
                },
                {
                    "id": "825000",
                    "text": "天水市"
                },
                {
                    "id": "826000",
                    "text": "酒泉市"
                },
                {
                    "id": "827000",
                    "text": "张掖市"
                },
                {
                    "id": "828000",
                    "text": "武威市"
                },
                {
                    "id": "829000",
                    "text": "定西市"
                },
                {
                    "id": "831000",
                    "text": "陇南市"
                },
                {
                    "id": "833000",
                    "text": "平凉市"
                },
                {
                    "id": "834000",
                    "text": "庆阳市"
                },
                {
                    "id": "836000",
                    "text": "临夏州"
                },
                {
                    "id": "838000",
                    "text": "甘南州"
                }
            ]
        },
        {
            "text": "青海",
            "id": "8510",
            "citys": [
                {
                    "id": "851000",
                    "text": "西宁市"
                },
                {
                    "id": "852100",
                    "text": "平安县"
                },
                {
                    "id": "854000",
                    "text": "海北州"
                },
                {
                    "id": "855000",
                    "text": "黄南州"
                },
                {
                    "id": "856000",
                    "text": "海南州"
                },
                {
                    "id": "857000",
                    "text": "果洛州"
                },
                {
                    "id": "858000",
                    "text": "玉树州"
                },
                {
                    "id": "859000",
                    "text": "海西州"
                }
            ]
        },
        {
            "text": "宁夏",
            "id": "8710",
            "citys": [
                {
                    "id": "871000",
                    "text": "银川市"
                },
                {
                    "id": "872000",
                    "text": "石嘴山市  "
                },
                {
                    "id": "873100",
                    "text": "吴忠市"
                },
                {
                    "id": "874100",
                    "text": "固原市"
                }
            ]
        },
        {
            "text": "新疆",
            "id": "8810",
            "citys": [
                {
                    "id": "887000",
                    "text": "博乐市"
                },
                {
                    "id": "888000",
                    "text": "库尔勒市  "
                },
                {
                    "id": "891000",
                    "text": "阿克苏市  "
                },
                {
                    "id": "893000",
                    "text": "阿图什市  "
                },
                {
                    "id": "894000",
                    "text": "喀什市"
                },
                {
                    "id": "896000",
                    "text": "和田市"
                },
                {
                    "id": "898000",
                    "text": "伊宁市"
                },
                {
                    "id": "901000",
                    "text": "塔城市"
                },
                {
                    "id": "902000",
                    "text": "阿勒泰市  "
                },
                {
                    "id": "902800",
                    "text": "石河子市  "
                },
                {
                    "id": "902900",
                    "text": "三道岭县  "
                },
                {
                    "id": "881000",
                    "text": "乌鲁木齐市  "
                },
                {
                    "id": "882000",
                    "text": "克拉玛依市  "
                },
                {
                    "id": "883000",
                    "text": "吐鲁番市  "
                },
                {
                    "id": "884000",
                    "text": "哈密市"
                },
                {
                    "id": "884400",
                    "text": "北屯县"
                },
                {
                    "id": "885000",
                    "text": "昌吉市"
                }
            ]
        }
    ],
    getProvinceList() {
        let provinceList = [];
        this.data.forEach(function (province) {
            provinceList.push(province.text);
        }, this);

        return provinceList;
    },
    getCityListBy(provinceText) {
        let cityArr = [];
        let cityList = [];
        //ES5的forEach无法中止或者跳出循环，所以用普通简单的for循环来代替
        for (let i = 0; i < this.data.length; i++) {
            if (this.data[i].text === provinceText) {
                cityArr = this.data[i].citys;
                break;
            }
        }

        cityArr.forEach(function (city) {
            cityList.push(city.text);
        }, this);

        return cityList;
    },
    getProvinceIdByText(provinceText) {
        for (let i = 0; i < this.data.length; i++) {
            if (this.data[i].text === provinceText) {
                return this.data[i].id;
            }
        }
    },
    getCityInfoListByProvinceText(provinceText) {
        for (let i = 0; i < this.data.length; i++) {
            if (this.data[i].text === provinceText) {
                return this.data[i].citys;
            }
        }
    },
    getCityIdByText(provinceText, cityText) {
        let cityInfoList = this.getCityInfoListByProvinceText(provinceText);
        for (let i = 0; i < cityInfoList.length; i++) {
            if (cityInfoList[i].text === cityText) {
                return cityInfoList[i].id;
            }
        }
    }
};

export default  map;