{
  "lover": [
	"我也曾把光阴浪费，甚至撞到视死如归。然后因为爱上你，而渴望长命百岁。——《身体健康》",
	"我们以为，惊喜是刻意制造的浪漫，但很多时候，惊喜可能只是一个温暖的举动。大概就是，你用你独特的方式，陪着我，爱着我。",
	"“爱情”的定义，简单到不能再简单——只要在一起就好，只要以你的方式让我安枕无忧。",
	"把那些有关你的悲喜 都汇集成保险单，等到哪天我就笑着对你说，看啊，这些都是我爱你的证据。",
	"一个不寻常的男人，会为了他爱的女人做不可能的事。——《险战丛林，泰山归来》",
	"我特别难想象，每天没有你，我应该怎么过。——《谎言西西里》",
	"爱永远是突然降临的，只有从来没有爱过的人，才以为爱是一个感情渐变的过程。——《夜孔雀》",
	"也许，世界上最幸福的一件事，就是当你拥抱一个你爱的人时，他竟然把你抱得更紧。",
	"如果你累了可以止步看夕阳，人生路上有我陪你流浪。",
	"山有木兮木有枝，心说君兮君不知。—《越人歌》",
	"我愿意陪你从青涩的时光，走到白发苍苍。",
	"我会给他一个他无法拒绝的承诺。——《教父》",
	"如果你要找一个人陪伴，但愿陪伴的人是我，从现在直到永远。——《大好时光》",
	"我手上的爱情线、生命线和事业线，都是你的名字拼成的。——《玻璃之城》",
	"我爱你不是因为你是谁，而是我在你面前可以是谁。——《剪刀手爱德华》"
  ],
  "parents": [
	"父母的恩，情，爱，是我这辈子都还不清的。",
	"你也曾经彷徨以后老了会怎样，若是你会迷路，我当你的眼睛。若是你会遇险，我当你的保险。",
	"你们总是以为我不会长大，你们错了；我总是以为你们不会变老，我也错了。岁月静好，我想为你们多一点爱，多一点陪伴与保护。",
	"我是一尾游鱼，你是包容我的海洋，浩瀚沉默，爱藏海底。",
	"你们看着我长大，我陪着你们变老，你们的白发，我的全世界。",
	"他们说要为你们写一封情书，我却迟迟没有动笔，因为想到你们的时候，泪水已经盈眶了。",
	"人，即使活到八九十岁，有父母便可以多少还有点孩子气。",
	"去过的地方多了，越知道自己想回到你们身边，见过的人越多，越知道自己真正想待在你们身边。",
	"你老了，越来越像个孩子，可是我知道，你比我小时候好哄多了。",
	"最大的快乐就是，以前你抱着我呵呵笑，以后我搀着你慢慢走。",
	"“累了就回家吧，我养你。”这话只有你是认真的。",
	"经过无数的日夜交替，我选择了辽阔的空间，而你却承受了邈远的时间。",
	"从未让你骄傲，你却待我如宝。",
	"没有一个地方可以和家相提并论。——《绿野仙踪》",
	"一个男孩最好的朋友是他的母亲。——《惊魂记》"
  ],
  "son": [
	"你是上天带给我的小天使，最好的礼物，遇到你是我这辈子最幸运的事。",
	"孩子，愿你的人生永远不会辜负你，那些转错的弯，走错的路，流下的泪水，滴下的汗水，留下的伤痕，全都能让你成为独一无二的自己。",
	"希望你在成为井井有条的大人前，拥有很多开心得一塌糊涂的回忆。",
	"每个童话故事都有自己的烦恼，小美人鱼没有腿，睡美人一半的时间都没有醒。但这样的故事才好看，而你也会因此拥有意想不到的人生。",
	"你要做一个不动声色的大人了。不能情绪化，不能偷偷想念，不能回头看。去过自己另外的生活。",
	"孩子，你知道吗?当你出生的那一刹那，妈妈就感到是世界上最幸福的人!",
	"就看你的了,孩子。——《卡萨布兰卡》",
	"现在,我想我是这个世界上最幸运的人。——《扬基的骄傲》",
	"人生就应该是快乐的,要抓住每一天,孩子们。让你们的生活变得非凡起来。——《死亡诗社》",
	"有些人生来伟大，有些需要努力才伟大。——《博物馆奇妙夜3》",
	"每个人只能陪你走一段路。——《山河故人》",
	"其实光一直都在，我们只是需要一点时间来适应黑暗。——《重返20岁》",
	"星星在哪里都是很亮的，就看你有没有抬头去看他们。——《玻璃樽》",
	"孩子，你是我们心中的一颗骄傲。",
	"陪伴，就是不管你需不需要，我一直都在。"
  ],
  "friends": [
	"我想攒多一张保单，为你保驾护航。",
	"世间最好的默契，并非有人懂你的言外之意，而是你懂得我的欲言又止。",
	"需要你的时候，你还是来了。——《卧虎藏龙2》",
	"世间最美好的东西，莫过于有几个头脑和心地都很正直的严正的朋友。——爱因斯坦",
	"莫笑友朋多,患难知交寡。——蒲松龄 ",
	"换我心，为你心，始知相忆深。 ——（宋）顾夏",
	"落地为兄弟，何必骨肉亲。 ——陶潜",
	"千千万万匹走马,换不来真友情。",
	"肝胆相照,才叫友情。",
	"除了一个真心的朋友之外，没有一样药剂是可以通心的。 ——培根",
	"遇见你，是我最美丽的意外。",
	"天下快意之事莫若友，快友之事莫若谈。",
	"你是我没有血缘关系的亲人。",
	"是你浪费在我身上的时间让我变得珍贵。",
	"我们是彼此嫉妒却共同进步的伙伴。"
  ],
  "oneself": [
	"永远像十八岁时一样热爱自己。",
	"天亮之前，如果我们都没死，此生都要好好地活着。——《天亮之前》",
	"幸福不是依靠等待所能得到的。——《晚春》",
	"活着的东西都是很费功夫的。——《海街》",
	"唢呐，不是吹给别人听的，是吹给自己听的。——《百鸟朝凤》",
	"你奋斗的身姿，改变了许多许多人的人生。——《垫底辣妹》",
	"你今天受的苦，吃的亏，担的责，扛的罪，忍的痛，到最后都会变成光，照亮你的路。",
	"认真洗脸，多读书，按时睡，少食多餐，然后变得温柔、大度，继续善良，保持爱。",
	"希望你遇到那个对的人和那件对的事，让之前种种狼狈不堪都成为伏笔。",
	"好好去做吧,站在世界之巅!——《歼匪喋血战》",
	"毕竟,明天又是新的一天!——《乱世佳人》",
	"你应该问你自己一个问题:我是幸运的吗?快点去做,年轻人,无知的年轻人。——《警探》",
	"生活，就是生下来，活下去。——《有种你爱我》",
	"不择手段非豪杰，不改初衷真英雄。——《道士下山》",
	"勇敢不代表不紧张，可是信念不能伪装。——《煎饼侠》"
   ],
   "teacher": [
    "一生平凡，一世艰辛，默默把知识奉献，您是文明的使者，您是辛勤的园丁，衷心感谢您，祝您健康快乐！",
	"老师永远带着笑容，总是那样快乐幽默，喜欢谈论人生，也爱听听我的梦，那就是我--永远的老师。",
	"在这个特别的日子里，我想对老师您说声：老师节日快乐！愿您在今后的日子里健康快乐！",
	"思念将我丝丝思念化作殷殷祝福捎给远方的您……曾经给我阳光、雨露、春风的老师。",
	"您不是歌唱家，却让知识的清泉叮咚作响，唱出迷人的歌曲；您不是雕塑家，却塑造着一批批青年人的灵魂。",
	"人生旅程上您为我点燃希望的光芒丰富我的心灵，增添我的智慧谢谢您！",
	"如果我能够高高飞翔，感谢您给了我一双有力的翅膀。在您的目光中，我如沐春风。",
	"经历了风雨，才知道您的可贵；走上了成功，才知道您的伟大。谢谢您，我尊敬的老师！",
	"十卷诗赋九章勾股，八索文史七纬地理，连同六艺五经，四书三字两雅一心栽树，点点心血育英才泽神州。",
	"能使艰难之事变得容易的人是教育者。",
	"高山不移，碧水常流，我师恩泽，在心永留！",
	"您的教诲催我风雨兼程，我的祝福伴您昼夜耕耘。",
	"纵然岁月会重新塑造我们的容颜，我永远是您的孩子，敬爱的吾师!",
	"投之于桃，报之于李，老师，谢谢您!"
   ],
  "title": "情书活动",
  "date": "2016-08-18"
}